[
  {
    "type": "long",
    "text": "Explain the factors affecting the location and growth of human settlements in India. (Practice Set 7.1)",
    "answer": "The location and growth of human settlements in India are influenced by several factors:\n\n1.  **Water Availability:** Historically, most settlements have developed along river banks, lakes, and other water sources. The availability of water is crucial for drinking, agriculture, and other domestic and economic activities.\n2.  **Land and Soil:** Settlements thrive in areas with flat land and fertile soil, which are ideal for agriculture. This is why the northern plains and coastal plains are densely populated.\n3.  **Climate:** A moderate and favorable climate encourages human settlement. Extreme climates, such as those in deserts or polar regions, discourage dense settlements.\n4.  **Economic Factors:** The availability of economic opportunities, such as industries, jobs, and trade routes, leads to the growth of new settlements or the expansion of existing ones. Major cities are located in industrial and economic hubs.\n5.  **Relief:** Areas with plain or gently sloping land are easier to build on and are more suitable for infrastructure development. Hilly and mountainous regions have dispersed settlements.",
    "marks": 4
  },
  {
    "type": "short",
    "text": "What is the primary difference between a rural and an urban settlement?",
    "answer": "A rural settlement is primarily engaged in primary activities like agriculture, fishing, and mining, while an urban settlement is primarily engaged in secondary and tertiary activities like manufacturing and services.",
    "marks": 2
  },
  {
    "type": "long",
    "text": "Differentiate between rural and urban settlements. (PYQ: March 2020)",
    "answer": "### **Rural Settlements**\n* **Main Occupation:** The population is primarily engaged in primary activities like farming, forestry, fishing, and animal husbandry.\n* **Population:** The population size is relatively small.\n* **Lifestyle:** The lifestyle is simple and closely connected to nature.\n* **Infrastructure:** Basic infrastructure like roads, schools, and hospitals is often limited.\n\n### **Urban Settlements**\n* **Main Occupation:** The population is primarily engaged in secondary and tertiary activities like manufacturing, trade, services, and administration.\n* **Population:** The population size is large and the density is high.\n* **Lifestyle:** The lifestyle is complex, fast-paced, and modern.\n* **Infrastructure:** Urban areas have developed infrastructure, including good roads, transport, schools, hospitals, and communication facilities.",
    "marks": 4
  },
  {
    "type": "short",
    "text": "What is a 'Dispersed Settlement'?",
    "answer": "A dispersed settlement is one where houses are scattered and located far from each other, often found in hilly or forested areas.",
    "marks": 2
  },
  {
    "type": "mcq",
    "text": "Which of the following is an example of a linear settlement?",
    "options": ["A village along a river bank", "A village on a hill top", "A village in a desert", "A village in a dense forest"],
    "correct_answer": "A",
    "answer": "A linear settlement is a type of settlement where houses are arranged in a line, often along a road, river, or coastline. A village along a river bank is a classic example. The correct option is **A**.",
    "marks": 1
  },
  {
    "type": "long",
    "text": "Explain the characteristics of the settlement patterns in Brazil. (Practice Set 7.2)",
    "answer": "The settlement patterns in Brazil are heavily influenced by its geography and history:\n\n1.  **Coastal Concentration:** The majority of the population is concentrated along the eastern coast. This is due to historical factors, as these areas were the first to be colonized by the Portuguese. They offer good ports, favorable climate, and economic opportunities.\n2.  **Dispersed Interior:** The interior of the country, especially the Amazon Basin, is sparsely populated. The dense rainforest, hot and humid climate, and lack of infrastructure make it difficult for human settlement.\n3.  **Linear and Compact Settlements:** Along the major rivers in the Amazon basin, you can find linear settlements. In the southern and southeastern parts, settlements are more compact and clustered around agricultural and industrial centers.\n4.  **Urbanization:** Brazil is a highly urbanized country, with more than 85% of its population living in cities. Major urban centers like São Paulo and Rio de Janeiro are densely populated.",
    "marks": 4
  },
  {
    "type": "short",
    "text": "Why is the Amazon basin sparsely populated?",
    "answer": "The Amazon basin is sparsely populated due to its dense, impenetrable rainforest, unfavorable climate, and inaccessibility.",
    "marks": 1
  },
  {
    "type": "long",
    "text": "Differentiate between the settlement patterns of India and Brazil. (PYQ: March 2022)",
    "answer": "### **Settlement Patterns of India**\n* **Distribution:** India has a very high population density, but the distribution is uneven. Settlements are dense in the northern plains and coastal areas.\n* **Settlement Types:** Both rural and urban settlements are found, with a high proportion of the population still living in rural areas.\n* **Factors:** Settlement patterns are influenced by fertile land, water availability, and economic development.\n\n### **Settlement Patterns of Brazil**\n* **Distribution:** Brazil has a relatively low population density, with most of the population concentrated along the eastern coast.\n* **Settlement Types:** The country is highly urbanized, with a large majority of the population living in cities. The interior is largely uninhabited.\n* **Factors:** Settlement patterns are influenced by historical colonization, coastal relief, and the difficult terrain of the Amazon basin.",
    "marks": 4
  },
  {
    "type": "short",
    "text": "Name any two major urban centers in Brazil.",
    "answer": "Two major urban centers in Brazil are **São Paulo** and **Rio de Janeiro**.",
    "marks": 1
  },
  {
    "type": "long",
    "text": "Explain the different types of rural settlements found in India. (Practice Set 7.3)",
    "answer": "Based on the arrangement of houses, rural settlements in India can be classified into:\n\n1.  **Compact/Clustered Settlements:** Houses are built very close to each other. They are typically found in fertile plains and river valleys where land is suitable for agriculture. This pattern provides a sense of community and security.\n2.  **Semi-Compact Settlements:** These are settlements that are not very compact or very dispersed. They are often the result of fragmentation of a large compact village.\n3.  **Dispersed Settlements:** Houses are scattered over a wide area, often in hilly, mountainous, or arid regions. The residents live far from each other, and there is a lack of social cohesion.\n4.  **Hamlets:** These are smaller, isolated clusters of houses that are part of a larger village, often separated by fields.",
    "marks": 3
  },
  {
    "type": "mcq",
    "text": "Which of the following is a characteristic of a compact settlement?",
    "options": ["Scattered houses", "Located in hilly areas", "Lack of social cohesion", "Houses built very close to each other"],
    "correct_answer": "D",
    "answer": "A compact settlement is characterized by houses built very close to each other, often found in fertile plains. The correct option is **D**.",
    "marks": 1
  },
  {
    "type": "long",
    "text": "Explain the concept of 'Urbanization' with reference to India. (Practice Set 7.4)",
    "answer": "Urbanization is the process of a country's population shifting from rural to urban areas. In India, urbanization is a significant trend, driven by:\n\n1.  **Migration:** People migrate from villages to cities in search of better employment, education, and healthcare facilities.\n2.  **Industrialization:** The growth of industries and factories in and around cities attracts a large workforce.\n3.  **Lifestyle:** The lure of a modern lifestyle, entertainment, and better amenities encourages people to move to urban areas.\n4.  **Government Policies:** Government initiatives and policies to develop new urban centers and smart cities also contribute to urbanization.",
    "marks": 3
  },
  {
    "type": "short",
    "text": "What is the main occupation of people in urban settlements?",
    "answer": "The main occupation of people in urban settlements is related to **secondary** and **tertiary activities**, such as manufacturing, services, trade, and administration.",
    "marks": 2
  },
  {
    "type": "long",
    "text": "Describe the main characteristics of a compact settlement. (PYQ: March 2019)",
    "answer": "A compact settlement, also known as a clustered settlement, has the following characteristics:\n\n1.  **Dense Housing:** Houses are built in close proximity to each other, forming a dense cluster.\n2.  **Proximity to Resources:** They are often located in a favorable environment, such as a fertile plain or a river valley, which provides a good source of water and agricultural land.\n3.  **Community Feeling:** The close proximity of houses fosters a strong sense of community and social interaction.\n4.  **Security:** Historically, compact settlements were easier to defend from external threats.",
    "marks": 3
  },
  {
    "type": "short",
    "text": "What is the population of Brazil that lives in cities?",
    "answer": "More than **85%** of Brazil's population lives in cities.",
    "marks": 1
  },
  {
    "type": "long",
    "text": "Why are human settlements in Brazil more concentrated on the coast than in the interior? (Practice Set 7.5)",
    "answer": "The concentration of human settlements along Brazil's coast is due to a combination of historical and geographical reasons:\n\n1.  **Colonial History:** The Portuguese colonists first settled along the eastern coast, establishing major port cities like Salvador and Rio de Janeiro. This historical development led to the concentration of population and economic activities in these areas.\n2.  **Geographical Barriers:** The vast interior of Brazil is dominated by the Amazon rainforest and the difficult terrain of the Brazilian Highlands, which are not conducive to large-scale settlement.\n3.  **Economic Advantage:** The coastal areas provide access to the sea for trade and commerce. Major industrial and financial centers are located here, attracting a large population in search of economic opportunities.",
    "marks": 4
  }
]
