[
  {
    "type": "long",
    "text": "Differentiate between the tertiary occupations of India and Brazil. (Practice Set 8.1)",
    "answer": "### **Tertiary Occupations in India**\n* **Employment:** A significant portion of India's workforce is employed in the service sector. This sector's contribution to GDP is constantly growing.\n* **Sub-sectors:** Key tertiary sub-sectors include IT and IT-enabled services, banking, insurance, transportation, and tourism. The IT sector, in particular, is a major contributor to the economy.\n* **Informal Sector:** A large part of the service sector is unorganized and informal, with a high number of small businesses and street vendors.\n\n### **Tertiary Occupations in Brazil**\n* **Employment:** Brazil has a highly developed service sector, employing the majority of its population.\n* **Sub-sectors:** Important service sectors include finance, banking, insurance, retail, and tourism. The banking and financial services are well-developed.\n* **Formal Sector:** The service sector is more organized and formal compared to India, with a greater emphasis on professional services.",
    "marks": 4
  },
  {
    "type": "short",
    "text": "Name the three main economic sectors.",
    "answer": "The three main economic sectors are **Primary**, **Secondary**, and **Tertiary**.",
    "marks": 1
  },
  {
    "type": "long",
    "text": "Explain the major factors influencing India's economic development. (PYQ: March 2020)",
    "answer": "India's economic development is influenced by several factors:\n\n1.  **Large and Diverse Workforce:** A large, young population provides a vast workforce for various sectors.\n2.  **Technological Advancement:** The IT and software industry have played a crucial role in India's economic growth.\n3.  **Agriculture:** The agricultural sector is still a major employer, and its performance affects the overall economy.\n4.  **Globalization:** India's integration into the global economy has opened up new opportunities for trade and foreign investment.\n5.  **Government Policies:** Government initiatives like 'Make in India' and 'Digital India' aim to boost various sectors of the economy.",
    "marks": 4
  },
  {
    "type": "short",
    "text": "What is a 'mixed economy'?",
    "answer": "A **mixed economy** is an economic system where both the government and the private sector have a role in economic activities.",
    "marks": 2
  },
  {
    "type": "mcq",
    "text": "Which of the following is an example of a primary occupation?",
    "options": ["Banking", "Fishing", "Manufacturing", "Tourism"],
    "correct_answer": "B",
    "answer": "Primary occupations involve direct use of natural resources. Fishing is a primary occupation. The correct option is **B**.",
    "marks": 1
  },
  {
    "type": "long",
    "text": "Explain the characteristics of the secondary occupations in India. (Practice Set 8.2)",
    "answer": "Secondary occupations in India include a wide range of manufacturing and processing activities:\n\n1.  **Variety:** India has a diverse secondary sector, from traditional cottage industries to large-scale modern manufacturing plants.\n2.  **Major Industries:** Key industries include textiles, iron and steel, cement, sugar, and automobiles. The manufacturing sector is a significant contributor to the country's GDP.\n3.  **Employment:** It employs a large number of people, but faces challenges such as a lack of skilled labor, outdated technology, and competition from other countries.\n4.  **Growth:** With the 'Make in India' initiative, the government aims to boost the manufacturing sector and create more jobs.",
    "marks": 3
  },
  {
    "type": "short",
    "text": "Name two major agricultural crops of Brazil.",
    "answer": "Two major agricultural crops of Brazil are **coffee** and **sugarcane**.",
    "marks": 2
  },
  {
    "type": "long",
    "text": "Differentiate between the primary occupations of India and Brazil. (PYQ: March 2022)",
    "answer": "### **Primary Occupations in India**\n* **Dominance:** The primary sector, particularly agriculture, is the largest employer in India, with a majority of the rural population depending on it.\n* **Crops:** Major crops include rice, wheat, pulses, sugarcane, and cotton.\n* **Challenges:** The sector faces challenges such as dependence on monsoons, small landholdings, and a lack of modern technology.\n\n### **Primary Occupations in Brazil**\n* **Dominance:** The primary sector is a significant contributor to Brazil's economy but employs a smaller percentage of the population compared to India.\n* **Crops:** Brazil is a leading producer of coffee, sugarcane, soybeans, and rubber.\n* **Features:** The agriculture is often large-scale and mechanized, with a focus on exports. Fishing and mining are also important primary activities.",
    "marks": 4
  },
  {
    "type": "short",
    "text": "What is the main source of income for India?",
    "answer": "The main source of income for India is the **service sector** (tertiary sector), which contributes the most to the country's GDP.",
    "marks": 1
  },
  {
    "type": "long",
    "text": "Explain the major factors influencing Brazil's economic development. (Practice Set 8.3)",
    "answer": "Brazil's economic development is influenced by several factors:\n\n1.  **Natural Resources:** Abundant natural resources like iron ore, bauxite, and petroleum, as well as vast forests, provide a strong base for industries.\n2.  **Agriculture:** The agricultural sector, especially the large-scale production of coffee, soybeans, and sugarcane, is a major contributor to the economy.\n3.  **Industrialization:** The country has a well-developed industrial base, particularly in the automotive, aircraft, and consumer goods sectors.\n4.  **Trade and Exports:** Brazil is a major exporter of agricultural products and minerals, which strengthens its economy.\n5.  **Service Sector:** The service sector is the largest contributor to GDP and provides the most employment.",
    "marks": 4
  },
  {
    "type": "mcq",
    "text": "Which of the following is a major economic activity in the Amazon basin?",
    "options": ["Agriculture", "Manufacturing", "Mining", "Finance"],
    "correct_answer": "C",
    "answer": "The Amazon basin is rich in mineral resources, and **mining** is a major economic activity in the region. The correct option is **C**.",
    "marks": 1
  },
  {
    "type": "long",
    "text": "Describe the main characteristics of Brazil's service sector. (PYQ: March 2019)",
    "answer": "The service sector in Brazil is the largest contributor to the country's GDP and has the following characteristics:\n\n1.  **Major Contributor:** It contributes a substantial portion to the national income, reflecting a shift from an agrarian to a service-based economy.\n2.  **Employment:** It employs a majority of the workforce, especially in urban areas.\n3.  **Developed Sub-sectors:** The financial, banking, and retail sectors are well-developed and modernized.\n4.  **Tourism:** Tourism is a growing sub-sector, contributing significantly to the economy.",
    "marks": 3
  },
  {
    "type": "short",
    "text": "What is the main occupation of people in the Amazon river basin?",
    "answer": "The main occupation of people in the Amazon river basin is related to **forestry, fishing, and limited agriculture**.",
    "marks": 2
  },
  {
    "type": "long",
    "text": "Explain the different sectors of the Indian economy. (Practice Set 8.4)",
    "answer": "The Indian economy can be divided into three main sectors:\n\n1.  **Primary Sector:** This sector includes activities that directly use natural resources. It is the largest employer, but its contribution to GDP has been declining. It includes agriculture, forestry, fishing, and mining.\n2.  **Secondary Sector:** This sector includes manufacturing and processing activities that transform raw materials into finished goods. It includes industries like textiles, iron and steel, and automobiles. Its contribution to GDP and employment is significant.\n3.  **Tertiary Sector:** This sector, also known as the service sector, provides services to the other two sectors. It is the fastest-growing sector and the largest contributor to GDP. It includes banking, transport, trade, and IT services.",
    "marks": 4
  },
  {
    "type": "short",
    "text": "What is the main occupation of people in the Brazilian coast?",
    "answer": "The main occupation of people in the Brazilian coast is related to **services, trade, and industries**.",
    "marks": 1
  },
  {
    "type": "long",
    "text": "Explain the characteristics of the secondary occupations in Brazil. (Practice Set 8.5)",
    "answer": "The secondary sector in Brazil has the following characteristics:\n\n1.  **Well-Developed:** It is a well-developed sector, contributing a significant portion to the GDP.\n2.  **Major Industries:** Key industries include automobiles, aircraft manufacturing, consumer goods, and iron and steel production.\n3.  **Employment:** It employs a large number of people, particularly in the southeastern states like São Paulo and Rio de Janeiro.\n4.  **Export-Oriented:** A significant portion of the manufactured goods are for export, contributing to the country's foreign exchange earnings.",
    "marks": 3
  },
  {
    "type": "short",
    "text": "Name two major minerals found in Brazil.",
    "answer": "Two major minerals found in Brazil are **iron ore** and **bauxite**.",
    "marks": 2
  },
  {
    "type": "long",
    "text": "Why is the per capita income of Brazil higher than that of India? (PYQ: March 2022)",
    "answer": "The per capita income of Brazil is higher than that of India due to several reasons:\n\n1.  **Population Size:** Brazil has a much smaller population than India. A smaller population means that the national income is divided among fewer people, resulting in a higher per capita income.\n2.  **Economic Development:** Brazil's economy is more industrialized and has a larger service sector, which generates higher income.\n3.  **Productivity:** Brazil's primary sector, especially agriculture, is more mechanized and productive, leading to higher output per worker.\n4.  **Urbanization:** Brazil is a highly urbanized country, and urban areas generally have higher incomes and better employment opportunities.",
    "marks": 4
  }
]
