[
  {
    "type": "long",
    "text": "Explain the major factors affecting the development of tourism in India. (Practice Set 9.1)",
    "answer": "The development of tourism in India is influenced by several factors:\n\n1.  **Diverse Geography:** India has a wide range of geographical features, including mountains (Himalayas), coastal areas, deserts (Thar), and forests, which attract different types of tourists.\n2.  **Rich Cultural Heritage:** India has a rich history with numerous monuments, forts, palaces, and archaeological sites that draw a large number of cultural tourists.\n3.  **Spirituality and Religion:** India is home to several religions, and many religious sites like Varanasi, Tirupati, and Ajmer Sharif attract a large number of pilgrims.\n4.  **Government Initiatives:** The government has launched campaigns like 'Incredible India' and 'Atithi Devo Bhava' to promote tourism. It is also improving infrastructure and transport facilities to make travel easier.",
    "marks": 4
  },
  {
    "type": "short",
    "text": "What is the motto of the Department of Tourism, India?",
    "answer": "The motto of the Department of Tourism, India, is **'Atithi Devo Bhava'**, which means 'The guest is God'.",
    "marks": 1
  },
  {
    "type": "long",
    "text": "Explain the characteristics of the tourism sector in Brazil. (Practice Set 9.2)",
    "answer": "Brazil has a diverse and developing tourism sector with the following characteristics:\n\n1.  **Natural Attractions:** Brazil is known for its natural beauty, including the Amazon rainforest, the Pantanal, and the Iguazu Falls, which are major eco-tourism destinations.\n2.  **Coastal and Urban Tourism:** The country's long coastline with beautiful beaches, especially in Rio de Janeiro, attracts a large number of international tourists. Cities like Rio and São Paulo are popular urban tourist destinations.\n3.  **Challenges:** The development of tourism in Brazil is hindered by factors such as a lack of adequate infrastructure in some remote areas and safety concerns in certain cities.\n4.  **Government Efforts:** The government is focusing on promoting eco-tourism and adventure tourism to showcase the country's natural wealth.",
    "marks": 4
  },
  {
    "type": "short",
    "text": "Name two major tourist attractions in Brazil.",
    "answer": "Two major tourist attractions in Brazil are the **Iguazu Falls** and the **Amazon rainforest**.",
    "marks": 2
  },
  {
    "type": "mcq",
    "text": "The 'Incredible India' campaign is related to which sector?",
    "options": ["Agriculture", "Tourism", "Manufacturing", "Finance"],
    "correct_answer": "B",
    "answer": "The 'Incredible India' campaign is a marketing initiative launched by the Government of India to promote tourism. The correct option is **B**.",
    "marks": 1
  },
  {
    "type": "long",
    "text": "Differentiate between the development of tourism in India and Brazil. (PYQ: March 2020)",
    "answer": "### **Tourism in India**\n* **Diversity:** India's tourism is driven by a mix of cultural, historical, spiritual, and natural attractions.\n* **Scale:** A very large number of both domestic and international tourists visit India.\n* **Growth:** The government is actively promoting tourism as a major source of income and employment.\n\n### **Tourism in Brazil**\n* **Diversity:** Brazil's tourism is primarily focused on natural attractions like the Amazon rainforest and coastal beaches.\n* **Scale:** The number of international tourists is lower compared to India, but the sector has huge potential.\n* **Growth:** The focus is on developing eco-tourism and improving infrastructure, especially in the interior parts of the country.",
    "marks": 4
  },
  {
    "type": "short",
    "text": "Why is tourism considered an 'invisible trade'?",
    "answer": "Tourism is considered an 'invisible trade' because it involves the exchange of services rather than physical goods, which is a key part of the service sector.",
    "marks": 2
  },
  {
    "type": "long",
    "text": "What is the importance of tourism for a country's economy?",
    "answer": "Tourism is a vital sector for a country's economy for the following reasons:\n\n1.  **Foreign Exchange:** It brings in foreign currency, which helps in improving a country's balance of payments.\n2.  **Job Creation:** It creates a large number of direct and indirect jobs in hotels, restaurants, transportation, and travel agencies.\n3.  **Infrastructure Development:** The need to cater to tourists leads to the development of infrastructure like airports, roads, and hotels.\n4.  **Local Economy:** It helps in the growth of local economies by providing a market for handicrafts, local food, and other products.",
    "marks": 4
  },
  {
    "type": "short",
    "text": "Name two major spiritual tourist destinations in India.",
    "answer": "Two major spiritual tourist destinations in India are **Varanasi** and **Tirupati**.",
    "marks": 1
  },
  {
    "type": "long",
    "text": "Explain the concept of 'eco-tourism' and its importance. (Practice Set 9.3)",
    "answer": "Eco-tourism is a form of tourism that involves traveling to natural areas in a way that conserves the environment and improves the well-being of the local people. Its importance lies in the following aspects:\n\n1.  **Environmental Conservation:** It promotes responsible travel to fragile, pristine, and often protected areas, helping to preserve the environment and prevent pollution.\n2.  **Community Development:** It focuses on empowering local communities by involving them in the tourism business and ensuring that a portion of the revenue stays within the community.\n3.  **Educational Value:** It provides a platform for tourists to learn about the importance of biodiversity and environmental conservation.\n4.  **Sustainable Income:** It offers a sustainable source of income for people living in remote and ecologically sensitive areas, reducing their dependence on activities that harm the environment.",
    "marks": 3
  },
  {
    "type": "mcq",
    "text": "Which of the following is a type of tourism related to medical treatment?",
    "options": ["Eco-tourism", "Agro-tourism", "Medical tourism", "Cultural tourism"],
    "correct_answer": "C",
    "answer": "Medical tourism is a type of tourism where people travel to another country for medical treatment. The correct option is **C**.",
    "marks": 1
  },
  {
    "type": "long",
    "text": "Why is the tourism sector in India a major source of employment? (PYQ: March 2022)",
    "answer": "The tourism sector is a major source of employment in India due to:\n\n1.  **Wide Range of Activities:** It provides jobs in diverse fields such as hotels, restaurants, tour operations, travel agencies, and transportation.\n2.  **Indirect Employment:** It also generates indirect employment in related sectors like handicrafts, retail, and local transportation.\n3.  **Low-Skilled Jobs:** The sector creates jobs for people with varying skill levels, from hotel staff to tour guides and drivers.\n4.  **Community Involvement:** It promotes the involvement of local communities, especially in remote areas, by providing them with opportunities to work as guides or sell local products.",
    "marks": 3
  },
  {
    "type": "short",
    "text": "Name two types of tourism.",
    "answer": "Two types of tourism are **Eco-tourism** and **Medical tourism**.",
    "marks": 2
  },
  {
    "type": "long",
    "text": "What are the government initiatives to promote tourism in India? (Practice Set 9.4)",
    "answer": "The Indian government has taken several initiatives to promote tourism:\n\n1.  **Marketing Campaigns:** Launching global marketing campaigns like 'Incredible India' to showcase the country's diverse attractions.\n2.  **Visa Policy:** Relaxing visa policies and introducing e-visas to attract more foreign tourists.\n3.  **Infrastructure Development:** Investing in the development of airports, railways, and roads to improve connectivity to tourist destinations.\n4.  **Niche Tourism:** Promoting niche tourism like medical tourism, adventure tourism, and spiritual tourism to attract specific segments of tourists.\n5.  **Cleanliness and Safety:** The 'Swachh Bharat Abhiyan' is also focused on improving the cleanliness of tourist sites.",
    "marks": 4
  },
  {
    "type": "short",
    "text": "What is the motto of the Department of Tourism, Brazil?",
    "answer": "The motto of the Department of Tourism, Brazil, is **'Brasil: Um país, vários mundos'** (Brazil: One country, several worlds).",
    "marks": 1
  },
  {
    "type": "long",
    "text": "Describe the main characteristics of a 'Medical Tourist'.",
    "answer": "A medical tourist is a person who travels to another country for medical treatment or surgery. Their main characteristics are:\n\n1.  **Cost-conscious:** They often seek treatment in countries where medical care is cheaper but of good quality.\n2.  **Quality-conscious:** They look for countries with advanced medical technology, skilled doctors, and good healthcare facilities.\n3.  **Combined Trip:** They often combine their medical trip with a vacation to the destination.\n4.  **Specific Needs:** They have specific medical needs, such as a particular surgery or a specialized treatment.",
    "marks": 3
  }
]
