[
  {
    "type": "short",
    "text": "Why does p-nitrochlorobenzene undergo displacement reactions readily with attack of nucleophilic OH⁻ ion? (March 2013)",
    "answer": "p-Nitrochlorobenzene undergoes nucleophilic substitution more readily than chlorobenzene because of the presence of the electron-withdrawing nitro group ($-NO_2$) at the para position. The $-NO_2$ group withdraws electron density from the benzene ring, especially at the ortho and para positions, through a strong resonance effect (–R effect) and inductive effect (–I effect). This makes the carbon atom attached to the chlorine more electron-deficient and thus more susceptible to nucleophilic attack. Furthermore, the nitro group stabilizes the intermediate carbanion (Meisenheimer complex) formed during the reaction by delocalizing the negative charge.",
    "marks": 2
  },
  {
    "type": "short",
    "text": "Write chemical equations for the action of: (a) Phosphorus trichloride on propan-2-ol. (b) Hydrogen bromide on styrene in the presence of a peroxide. (c) Methyl bromide on silver propanoate. (March 2013)",
    "answer": "(a) **Phosphorus trichloride on propan-2-ol:** \n   $3CH_3-CH(OH)-CH_3 + PCl_3 \\rightarrow 3CH_3-CH(Cl)-CH_3 + H_3PO_3$ \n(b) **Hydrogen bromide on styrene in the presence of a peroxide:** The addition of HBr to styrene (phenylethene) follows the anti-Markovnikov rule in the presence of peroxide due to a free-radical mechanism. \n   $C_6H_5-CH=CH_2 + HBr \\xrightarrow{Peroxide} C_6H_5-CH_2-CH_2Br$ \n(c) **Methyl bromide on silver propanoate:** This is an esterification reaction. \n   $CH_3CH_2COOAg + CH_3Br \\rightarrow CH_3CH_2COOCH_3 + AgBr$",
    "marks": 3
  },
  {
    "type": "long",
    "text": "Explain optical activity of lactic acid. Draw a neat, labelled energy profile diagram for Sₙ1 reaction mechanism. (Oct. 2013)",
    "answer": "**Optical Activity of Lactic Acid:** \nLactic acid ($CH_3-CH(OH)-COOH$) is optically active because it contains a chiral carbon atom (the carbon bonded to -H, -OH, $-CH_3$, and -COOH groups). A chiral carbon is an asymmetric carbon atom bonded to four different groups. This asymmetry means the molecule is non-superimposable on its mirror image. These two non-superimposable mirror image forms are called enantiomers. One enantiomer rotates the plane of polarized light to the right (dextrorotatory, d- or (+)-lactic acid) and the other rotates it to the left (laevorotatory, l- or (–)-lactic acid). This ability to rotate plane-polarized light is called optical activity. \n\n**Energy Profile Diagram for Sₙ1 Reaction:** \nThis is a two-step reaction. The diagram is a plot of Potential Energy vs. Reaction Coordinate. \n1.  The diagram starts with the energy level of the reactants (R-X). \n2.  The curve rises to a first peak, representing the energy of the first transition state (TS1), where the C-X bond is breaking. The energy required to reach this peak is the activation energy ($E_{a1}$). \n3.  The curve then drops to a valley, which represents the stable carbocation intermediate ($R^+$). This is a minimum on the energy profile. \n4.  From the intermediate, the curve rises again to a second, lower peak, representing the second transition state (TS2), where the nucleophile is attacking the carbocation. The activation energy for this step ($E_{a2}$) is small. \n5.  Finally, the curve drops to the final energy level of the products (R-Nu), which is typically lower than the reactants for a spontaneous reaction. \nThe diagram shows two transition states and one intermediate.",
    "marks": 4
  },
  {
    "type": "short",
    "text": "Discuss the optical activity of lactic acid. (March 2014)",
    "answer": "Lactic acid ($CH_3CH(OH)COOH$) is optically active because its molecule contains a chiral (asymmetric) carbon atom. This is the central carbon atom which is attached to four different groups: a hydrogen atom (-H), a hydroxyl group (-OH), a methyl group ($-CH_3$), and a carboxylic acid group (-COOH). Due to this chirality, the molecule is non-superimposable on its mirror image. These two mirror-image forms are called enantiomers. One enantiomer, (+)-lactic acid, rotates plane-polarized light to the right (dextrorotatory), while the other, (–)-lactic acid, rotates it to the left (laevorotatory).",
    "marks": 2
  },
  {
    "type": "short",
    "text": "Distinguish between Sₙ1 and Sₙ2 mechanisms. (March 2014)",
    "answer": "| Feature | $S_N1$ Mechanism | $S_N2$ Mechanism |\n|---|---|---|\n| **Number of Steps** | Two-step mechanism. | Single-step (concerted) mechanism. |\n| **Intermediate** | A carbocation intermediate is formed. | No intermediate is formed; proceeds via a transition state. |\n| **Molecularity** | Unimolecular (rate depends only on alkyl halide concentration). | Bimolecular (rate depends on both alkyl halide and nucleophile concentrations). |\n| **Rate Law** | Rate = $k$[Alkyl Halide] | Rate = $k$[Alkyl Halide][Nucleophile] |\n| **Stereochemistry** | Results in racemization (formation of both enantiomers). | Results in complete inversion of configuration (Walden inversion). |\n| **Substrate Reactivity** | $3° > 2° > 1° > CH_3X$ (favors stable carbocations). | $CH_3X > 1° > 2° > 3°$ (favors less sterically hindered substrates). |",
    "marks": 2
  },
  {
    "type": "short",
    "text": "Write the structures of: (a) 3-Chloro-4-ethylhex-1-ene (b) 1-Iodo-2, 3-dimethylbutane (c) 1, 3, 5-Tribromobenzene. (Oct. 2014)",
    "answer": "(a) **3-Chloro-4-ethylhex-1-ene:** $CH_2=CH-CH(Cl)-CH(CH_2CH_3)-CH_2-CH_3$ \n(b) **1-Iodo-2, 3-dimethylbutane:** $ICH_2-CH(CH_3)-CH(CH_3)-CH_3$ \n(c) **1, 3, 5-Tribromobenzene:** A benzene ring with bromine atoms attached to carbons 1, 3, and 5.",
    "marks": 3
  },
  {
    "type": "short",
    "text": "Draw structure of DDT. Write its environmental effects. (March 2015)",
    "answer": "**Structure of DDT (Dichlorodiphenyltrichloroethane):** \nIt consists of a central carbon atom bonded to a trichloromethyl group ($-CCl_3$) and a hydrogen atom. This central carbon is also bonded to two p-chlorophenyl groups. \n\n**Environmental Effects:** \n1.  **Persistence and Biomagnification:** DDT is a persistent organic pollutant. It is not easily biodegradable and accumulates in the fatty tissues of organisms. Its concentration increases up the food chain (biomagnification), causing harm to top predators like birds of prey, where it interferes with calcium metabolism, leading to thin eggshells. \n2.  **Toxicity:** It is toxic to a wide range of organisms, including fish, and can have adverse effects on human health.",
    "marks": 2
  },
  {
    "type": "short",
    "text": "Identify 'A' and 'B' in the following reaction: $CH_3-CH=CH_2 \\xrightarrow{HBr} 'A' \\xrightarrow{alc. KOH} 'B'$ (Oct. 2015)",
    "answer": "1.  **Step 1:** The addition of HBr to propene follows Markovnikov's rule, where the negative part of the reagent (Br⁻) adds to the carbon atom with fewer hydrogen atoms. \n    $CH_3-CH=CH_2 + HBr \\rightarrow CH_3-CH(Br)-CH_3$ \n    So, **A is 2-bromopropane**. \n\n2.  **Step 2:** The reaction of 2-bromopropane with alcoholic KOH is a dehydrohalogenation (elimination) reaction, which follows Saytzeff's rule to form the more substituted alkene. \n    $CH_3-CH(Br)-CH_3 + alc. KOH \\rightarrow CH_3-CH=CH_2 + KBr + H_2O$ \n    So, **B is propene**.",
    "marks": 2
  },
  {
    "type": "short",
    "text": "Discuss the mechanism of alkaline hydrolysis of bromomethane. (Oct. 2015)",
    "answer": "The alkaline hydrolysis of bromomethane ($CH_3Br$) with an aqueous alkali like NaOH or KOH proceeds via the **$S_N2$ (bimolecular nucleophilic substitution) mechanism**. \n\n**Mechanism:** \n-   It is a single-step, concerted reaction. \n-   The nucleophile, hydroxide ion ($OH^-$), attacks the carbon atom of the C-Br bond from the side opposite to the leaving group (bromine). This is called a backside attack. \n-   As the C-OH bond begins to form, the C-Br bond simultaneously begins to break. \n-   The reaction passes through a high-energy, unstable **pentavalent transition state** where the carbon atom is partially bonded to both the incoming $OH^-$ group and the outgoing $Br^-$ group. \n-   Finally, the C-Br bond breaks completely, and the bromide ion ($Br^-$) leaves. The C-OH bond is fully formed, yielding methanol ($CH_3OH$). \n-   This mechanism results in the **inversion of configuration** (Walden inversion), though it is not observable for bromomethane as it is achiral.",
    "marks": 4
  },
  {
    "type": "short",
    "text": "How is chlorobenzene prepared from aniline? How is chlorobenzene converted into diphenyl? (March 2016)",
    "answer": "**Preparation of Chlorobenzene from Aniline:** This is a two-step process known as the Sandmeyer reaction. \n1.  **Diazotization:** Aniline is treated with nitrous acid ($NaNO_2 + HCl$) at a low temperature (0-5°C) to form benzene diazonium chloride. \n    $C_6H_5NH_2 + NaNO_2 + 2HCl \\xrightarrow{273-278K} C_6H_5N_2^+Cl^- + NaCl + 2H_2O$ \n2.  **Sandmeyer Reaction:** The diazonium salt solution is then warmed with cuprous chloride ($Cu_2Cl_2$) dissolved in HCl. \n    $C_6H_5N_2^+Cl^- \\xrightarrow{Cu_2Cl_2/HCl} C_6H_5Cl + N_2$ \n\n**Conversion of Chlorobenzene into Diphenyl:** This is achieved by the Fittig reaction. Two molecules of chlorobenzene are heated with sodium metal in the presence of dry ether. \n$2C_6H_5Cl + 2Na \\xrightarrow{Dry Ether} C_6H_5-C_6H_5 + 2NaCl$",
    "marks": 4
  },
  {
    "type": "short",
    "text": "Explain the term - Optical activity. (March 2016)",
    "answer": "Optical activity is the property of certain substances to rotate the plane of plane-polarized light when it is passed through them. \n-   A substance that rotates the plane of light is called **optically active**. \n-   The rotation to the right is called **dextrorotation** (indicated by d or +). \n-   The rotation to the left is called **laevorotation** (indicated by l or –). \nThis property is exhibited by chiral molecules, which are non-superimposable on their mirror images.",
    "marks": 1
  },
  {
    "type": "short",
    "text": "How is propene converted into 1-bromopropane and 2-bromopropane? (March 2016)",
    "answer": "**Conversion to 1-bromopropane (Anti-Markovnikov Addition):** \nPropene is treated with hydrogen bromide (HBr) in the presence of a peroxide (like benzoyl peroxide). This follows the anti-Markovnikov rule, where the bromine atom adds to the carbon with more hydrogen atoms. \n$CH_3-CH=CH_2 + HBr \\xrightarrow{Peroxide} CH_3-CH_2-CH_2Br$ \n\n**Conversion to 2-bromopropane (Markovnikov Addition):** \nPropene is treated with hydrogen bromide (HBr) in the absence of peroxide. This follows Markovnikov's rule, where the bromine atom adds to the more substituted carbon (the one with fewer hydrogen atoms). \n$CH_3-CH=CH_2 + HBr \\rightarrow CH_3-CH(Br)-CH_3$",
    "marks": 2
  },
  {
    "type": "short",
    "text": "Write a note on Sandmeyer's reaction. (July 2016, 2018)",
    "answer": "The Sandmeyer reaction is a chemical reaction used to synthesize aryl halides from aryl diazonium salts. The reaction involves two main steps: \n1.  **Diazotization:** A primary aromatic amine (e.g., aniline) is treated with a cold (0-5°C) solution of sodium nitrite and a hydrohalic acid (e.g., HCl, HBr) to form a diazonium salt. \n2.  **Substitution:** The resulting diazonium salt is then treated with the corresponding cuprous halide ($Cu_2Cl_2$, $Cu_2Br_2$) or cuprous cyanide ($Cu_2(CN)_2$) to replace the diazonium group ($-N_2^+$) with a halogen ($-Cl$, $-Br$) or a cyano group ($-CN$), respectively. Nitrogen gas is liberated as a byproduct. \n**Example:** $C_6H_5N_2^+Cl^- \\xrightarrow{Cu_2Cl_2/HCl} C_6H_5Cl + N_2$",
    "marks": 2
  },
  {
    "type": "short",
    "text": "Identify 'A' and 'B' and rewrite the reactions. (a) Aniline -> A -> B (b) Ethane -> A -> B (July 2016)",
    "answer": "(a) $C_6H_5-NH_2 \\xrightarrow{NaNO_2, HBr, 273K} (A) \\xrightarrow{Cu_2Br_2} (B) + N_2$ \n-   **Step 1:** This is the diazotization of aniline with nitrous acid in HBr. Product A is benzene diazonium bromide. \n-   **Step 2:** This is the Sandmeyer reaction. Product B is bromobenzene. \n-   **A is $C_6H_5N_2^+Br^-$** (Benzene diazonium bromide). \n-   **B is $C_6H_5Br$** (Bromobenzene). \n\n(b) $H_3C-CH_2-CH_2-CH_2-Br \\xrightarrow{Alcoholic KOH, \\Delta} (A) + (B) + 2KBr + 2H_2O$ \n-   This question appears to have a typo in the starting material. Based on the products (2KBr), the starting material should be a dibromobutane. If we assume 1,2-dibromobutane: \n    $BrCH_2-CH(Br)-CH_2-CH_3 \\xrightarrow{alc. KOH} But-1-yne$. \n-   If we assume 2,3-dibromobutane: \n    $CH_3-CH(Br)-CH(Br)-CH_3 \\xrightarrow{alc. KOH} But-2-yne$. \n-   If we assume the question meant a mixture of products from a single starting material like 2-bromobutane, then Saytzeff elimination gives two products: \n    $CH_3-CH_2-CH(Br)-CH_3 \\xrightarrow{alc. KOH} CH_3-CH=CH-CH_3 \\text{ (But-2-ene, major)} + CH_3-CH_2-CH=CH_2 \\text{ (But-1-ene, minor)}$. \n    In this case, **A is But-2-ene** and **B is But-1-ene** (or vice versa).",
    "marks": 2
  },
  {
    "type": "short",
    "text": "Define racemic mixture. (March 2017)",
    "answer": "A racemic mixture (or racemate) is an equimolar mixture of two enantiomers (a pair of non-superimposable mirror-image stereoisomers). A racemic mixture is always optically inactive because the rotation of plane-polarized light caused by one enantiomer is exactly cancelled by the equal and opposite rotation caused by the other enantiomer.",
    "marks": 1
  },
  {
    "type": "long",
    "text": "Explain the mechanism of alkaline hydrolysis of tert-butyl bromide with energy profile diagram. (March 2017)",
    "answer": "The alkaline hydrolysis of tert-butyl bromide (($CH_3)_3C-Br$) proceeds via the **$S_N1$ (unimolecular nucleophilic substitution) mechanism**. \n\n**Mechanism:** \n-   **Step 1 (Formation of Carbocation):** This is the slow, rate-determining step. The C-Br bond undergoes heterolytic cleavage to form a stable tertiary carbocation and a bromide ion. \n    $(CH_3)_3C-Br \\xrightarrow{Slow} (CH_3)_3C^+ + Br^-$ \n-   **Step 2 (Nucleophilic Attack):** This is the fast step. The nucleophile ($OH^-$) attacks the planar tertiary carbocation. The attack can occur from either the top or bottom face with equal probability. \n    $(CH_3)_3C^+ + OH^- \\xrightarrow{Fast} (CH_3)_3C-OH$ \n-   This leads to the formation of tert-butyl alcohol. If the starting material were chiral, this mechanism would result in a racemic mixture. \n\n**Energy Profile Diagram:** \nThe diagram plots Potential Energy vs. Reaction Coordinate and shows two peaks (transition states) and one valley (intermediate). \n1.  The curve starts at the energy level of the reactants, $(CH_3)_3C-Br$. \n2.  It rises to a high peak (TS1), representing the transition state for the C-Br bond breaking. This represents the activation energy of the rate-determining step. \n3.  The curve drops to a valley, representing the stable tertiary carbocation intermediate, $(CH_3)_3C^+$. \n4.  From the intermediate, the curve rises to a second, much lower peak (TS2), for the attack of the nucleophile. \n5.  Finally, the curve drops to the energy level of the product, $(CH_3)_3C-OH$.",
    "marks": 3
  },
  {
    "type": "short",
    "text": "Define optical activity. Explain optical activity of lactic acid. (July 2017)",
    "answer": "**Optical Activity:** The property of a substance to rotate the plane of plane-polarized light when it is passed through its solution. Substances that exhibit this property are called optically active. \n\n**Optical Activity of Lactic Acid:** Lactic acid ($CH_3-CH(OH)-COOH$) is optically active because its molecule contains a chiral carbon atom. A chiral carbon is one that is bonded to four different groups. In lactic acid, the central carbon is attached to -H, $-OH$, $-CH_3$, and -COOH. This asymmetry results in two non-superimposable mirror image forms called enantiomers. One enantiomer (+)-lactic acid rotates plane-polarized light clockwise, and the other enantiomer (–)-lactic acid rotates it counter-clockwise.",
    "marks": 4
  },
  {
    "type": "short",
    "text": "Identify A and B in the following reaction: $CH_3-Br + Mg \\xrightarrow{dry ether} A \\xrightarrow{CO_2, H⁺/H_2O} B + Mg(Br)OH$ (July 2017)",
    "answer": "1.  **Step 1:** Methyl bromide reacts with magnesium metal in the presence of dry ether to form a Grignard reagent. \n    $CH_3-Br + Mg \\xrightarrow{dry ether} CH_3MgBr$ \n    So, **A is methylmagnesium bromide**. \n\n2.  **Step 2:** The Grignard reagent reacts with carbon dioxide ($CO_2$) followed by acidic hydrolysis to form a carboxylic acid. \n    $CH_3MgBr + CO_2 \\rightarrow CH_3COOMgBr \\xrightarrow{H⁺/H_2O} CH_3COOH + Mg(Br)OH$ \n    So, **B is acetic acid (ethanoic acid)**.",
    "marks": 2
  },
  {
    "type": "short",
    "text": "Explain only reaction mechanism for alkaline hydrolysis of tert-butylbromide. (March 2018)",
    "answer": "The alkaline hydrolysis of tert-butyl bromide (($CH_3)_3C-Br$) follows the **$S_N1$ mechanism**. \n-   **Step 1: Formation of a stable carbocation (slow step).** This is the rate-determining step. The polar C-Br bond breaks heterolytically, with the bromide ion leaving, to form a stable tertiary carbocation. \n    $(CH_3)_3C-Br \\xrightarrow{Slow} (CH_3)_3C^+ + Br^-$ \n-   **Step 2: Nucleophilic attack on the carbocation (fast step).** The nucleophile, hydroxide ion ($OH^-$), rapidly attacks the planar carbocation from either face to form the product, tert-butyl alcohol. \n    $(CH_3)_3C^+ + OH^- \\xrightarrow{Fast} (CH_3)_3C-OH$",
    "marks": 2
  },
  {
    "type": "long",
    "text": "Identify 'A' and 'B' in the following reaction and rewrite the complete reaction: $CH_3-CH_2-Br + AgCN \\xrightarrow{\\Delta} A \\xrightarrow{H₂O/H⁺} B$ (March 2018)",
    "answer": "The starting material is ethyl bromide. \n1.  **Step 1:** Ethyl bromide reacts with silver cyanide (AgCN). AgCN is a predominantly covalent compound, so the attack occurs through the nitrogen lone pair, forming an isocyanide. \n    $CH_3-CH_2-Br + AgCN \\xrightarrow{\\Delta} CH_3-CH_2-NC + AgBr$ \n    So, **A is Ethyl isocyanide (Ethane isonitrile)**. \n\n2.  **Step 2:** Acidic hydrolysis of an isocyanide yields a primary amine and formic acid. \n    $CH_3-CH_2-NC + 2H_2O \\xrightarrow{H⁺} CH_3-CH_2-NH_2 + HCOOH$ \n    So, **B is Ethylamine**. \n\n**Complete Reaction:** \n$CH_3-CH_2-Br \\xrightarrow{AgCN} CH_3-CH_2-NC \\xrightarrow{H_2O/H^+} CH_3-CH_2-NH_2 + HCOOH$",
    "marks": 2
  },
  {
    "type": "long",
    "text": "Identify A and B from the following reaction and rewrite the reaction complete: Chlorocyclohexane + Mg -> A -> B + MgCl(OH) (July 2018)",
    "answer": "The question is missing the reagent for the second step. It's likely the hydrolysis of the Grignard reagent formed in the first step. \n1.  **Step 1:** Chlorocyclohexane reacts with magnesium metal in dry ether to form a Grignard reagent. \n    $C_6H_{11}Cl + Mg \\xrightarrow{dry ether} C_6H_{11}MgCl$ \n    So, **A is Cyclohexylmagnesium chloride**. \n\n2.  **Step 2:** The product MgCl(OH) indicates hydrolysis with water. The Grignard reagent is a strong base and reacts with water to form an alkane. \n    $C_6H_{11}MgCl + H_2O \\rightarrow C_6H_{12} + MgCl(OH)$ \n    So, **B is Cyclohexane**. \n\n**Complete Reaction:** \n$C_6H_{11}Cl \\xrightarrow{Mg, dry ether} C_6H_{11}MgCl \\xrightarrow{H_2O} C_6H_{12} + MgCl(OH)$",
    "marks": 2
  },
  {
    "type": "short",
    "text": "Complete and rewrite the following chemical reaction: 1-Chloro-2,4-dinitrobenzene -> ? (July 2018)",
    "answer": "The question is incomplete as it's missing a reagent. A common reaction for this substrate is nucleophilic aromatic substitution with an aqueous alkali. \nAssuming the reagent is aqueous alkali (e.g., NaOH) and heat: \n1-Chloro-2,4-dinitrobenzene has two strong electron-withdrawing nitro groups ortho and para to the chlorine. This makes it highly reactive towards nucleophilic substitution. \n\n**Reaction:** \n$C_6H_3(Cl)(NO_2)_2 + 2NaOH_{(aq)} \\xrightarrow{368 K} C_6H_3(OH)(NO_2)_2 + NaCl + H_2O$ \n\n**Product (?):** 2,4-Dinitrophenol.",
    "marks": 1
  },
  {
    "type": "short",
    "text": "What is the action of the following on ethyl bromide: (i) Alcoholic solution of potassium hydroxide (ii) Moist silver oxide (iii) Silver acetate? (March 2019)",
    "answer": "(i) **Alcoholic solution of potassium hydroxide (alc. KOH):** This reagent causes dehydrohalogenation (elimination) to form an alkene. \n   $CH_3CH_2Br + alc. KOH \\xrightarrow{\\Delta} CH_2=CH_2 + KBr + H_2O$ \n\n(ii) **Moist silver oxide (Ag₂O + H₂O, which is effectively AgOH):** This reagent causes nucleophilic substitution ($S_N2$) to form an alcohol. \n   $CH_3CH_2Br + AgOH \\rightarrow CH_3CH_2OH + AgBr$ \n\n(iii) **Silver acetate ($CH_3COOAg$):** This causes nucleophilic substitution to form an ester. \n   $CH_3CH_2Br + CH_3COOAg \\rightarrow CH_3COOCH_2CH_3 + AgBr$",
    "marks": 3
  },
  {
    "type": "short",
    "text": "Define Enantiomers. (March 2019)",
    "answer": "Enantiomers are stereoisomers that are non-superimposable mirror images of each other. They have identical physical properties (like melting point, boiling point, solubility) and chemical properties, except for their interaction with plane-polarized light (they rotate it in equal but opposite directions) and their reactions with other chiral molecules.",
    "marks": 1
  },
  {
    "type": "short",
    "text": "What is Grignard reagent? (March 2019)",
    "answer": "A Grignard reagent is an organometallic compound with the general chemical formula R-Mg-X, where R is an alkyl, aryl, vinyl, or allyl group, and X is a halogen (Cl, Br, or I). It is prepared by reacting an alkyl or aryl halide with magnesium metal in the presence of an anhydrous ether solvent. Grignard reagents are highly reactive and are valuable in organic synthesis for forming new carbon-carbon bonds.",
    "marks": 1
  },
  {
    "type": "short",
    "text": "Explain the role of iodic acid in the preparation of ethyl iodide from ethane. Dilactic acid is optically inactive. Why? (July 2019)",
    "answer": "The first part of the question has a typo; ethyl iodide is prepared from ethanol or ethene, not ethane directly. Assuming it means preparation from ethanol: $C_2H_5OH + HI \\rightarrow C_2H_5I + H_2O$. This reaction is reversible. Iodic acid ($HIO_3$) is a strong oxidizing agent. Its role is to oxidize the byproduct hydrogen iodide (HI) back to iodine ($I_2$), preventing the reverse reaction and thus shifting the equilibrium forward to increase the yield of ethyl iodide. $5HI + HIO_3 \\rightarrow 3I_2 + 3H_2O$. \n\n**Why 'Dilactic acid' is optically inactive:** This is likely a typo for **meso-tartaric acid** or referring to a **racemic mixture** of lactic acid. \n-   A racemic mixture of lactic acid (an equimolar mixture of d- and l-lactic acid) is optically inactive due to external compensation; the rotation caused by one enantiomer is cancelled by the opposite rotation of the other. \n-   If 'dilactic acid' refers to a dimer, its optical activity would depend on its specific stereochemistry.",
    "marks": 3
  },
  {
    "type": "short",
    "text": "Write the reaction for preparation of Grignard's reagent. (July 2019)",
    "answer": "Grignard's reagent (alkyl magnesium halide) is prepared by reacting an alkyl halide with magnesium metal turnings in the presence of a dry ether solvent (like diethyl ether or THF). The ether solvent is crucial as it stabilizes the Grignard reagent by coordination. \n\n**General Reaction:** \n$R-X + Mg \\xrightarrow{Dry Ether} R-Mg-X$ \n(where R = alkyl or aryl group; X = Cl, Br, I)",
    "marks": 1
  },
  {
    "type": "long",
    "text": "Write conversion of 2-bromobutane into unsaturated hydrocarbon by using alcoholic KOH. (July 2019)",
    "answer": "The reaction of 2-bromobutane with alcoholic potassium hydroxide (KOH) is a dehydrohalogenation (elimination) reaction. This reaction follows Saytzeff's (Zaitsev's) rule, which states that in an elimination reaction, the more substituted (more stable) alkene is the major product. \n\n$CH_3-CH_2-CH(Br)-CH_3 \\xrightarrow{alc. KOH, \\Delta} CH_3-CH=CH-CH_3 \\text{ (But-2-ene, Major product)} + CH_3-CH_2-CH=CH_2 \\text{ (But-1-ene, Minor product)} + KBr + H_2O$ \n\nThe principal unsaturated hydrocarbon formed is **But-2-ene**.",
    "marks": 1
  },
  {
    "type": "short",
    "text": "Define optical activity. How many optical isomers are possible for glucose? (March 2020)",
    "answer": "**Optical Activity:** The ability of a chiral substance to rotate the plane of plane-polarized light. \n\n**Optical Isomers of Glucose:** The open-chain structure of glucose ($CHO-(CHOH)_4-CH_2OH$) has **four chiral carbon atoms** (C-2, C-3, C-4, and C-5). The number of possible optical isomers for a molecule with 'n' chiral centers is given by the formula $2^n$. \nFor glucose, n = 4. \nNumber of isomers = $2^4 = 16$. \nTherefore, 16 optical isomers (8 pairs of enantiomers) are possible for glucose.",
    "marks": 2
  },
  {
    "type": "short",
    "text": "Write the chemical reactions of chlorobenzene with respect to: (a) Sulphonation (b) Acetylation (c) Nitration. (March 2020)",
    "answer": "Chlorobenzene undergoes electrophilic substitution. The chlorine atom is deactivating but ortho, para-directing. \n(a) **Sulphonation:** Reaction with fuming sulfuric acid ($H_2SO_4 + SO_3$). \n   $C_6H_5Cl + H_2SO_{4(conc)} \\xrightarrow{\\Delta} p-Cl-C_6H_4-SO_3H + o-Cl-C_6H_4-SO_3H + H_2O$ \n   (Major product: 4-chlorobenzenesulphonic acid) \n\n(b) **Acetylation (Friedel-Crafts):** Reaction with acetyl chloride ($CH_3COCl$) in the presence of anhydrous aluminium chloride ($AlCl_3$). \n   $C_6H_5Cl + CH_3COCl \\xrightarrow{Anhyd. AlCl_3} p-Cl-C_6H_4-COCH_3 + o-Cl-C_6H_4-COCH_3 + HCl$ \n   (Major product: 4-chloroacetophenone) \n\n(c) **Nitration:** Reaction with a mixture of concentrated nitric acid and concentrated sulfuric acid (nitrating mixture). \n   $C_6H_5Cl + HNO_{3(conc)} + H_2SO_{4(conc)} \\xrightarrow{\\Delta} p-Cl-C_6H_4-NO_2 + o-Cl-C_6H_4-NO_2 + H_2O$ \n   (Major product: 1-chloro-4-nitrobenzene)",
    "marks": 3
  },
  {
    "type": "long",
    "text": "What is the action of the following on chlorobenzene? (i) Methyl chloride in presence of anhydrous AlCl₃ (ii) Fuming H₂SO₄. (Sept. 2021)",
    "answer": "(i) **Methyl chloride in presence of anhydrous AlCl₃ (Friedel-Crafts Alkylation):** \nChlorobenzene reacts with methyl chloride in the presence of the Lewis acid catalyst anhydrous $AlCl_3$. An electrophilic substitution occurs, attaching the methyl group primarily at the ortho and para positions relative to the chlorine atom. The para isomer is the major product due to less steric hindrance. \n$C_6H_5Cl + CH_3Cl \\xrightarrow{Anhyd. AlCl_3} C_6H_4(Cl)(CH_3) \\text{ (o- and p-chlorotoluene)} + HCl$ \n\n(ii) **Fuming H₂SO₄ (Sulphonation):** \nChlorobenzene reacts with fuming sulphuric acid (a mixture of $H_2SO_4$ and $SO_3$) upon heating. The electrophile ($SO_3$) attacks the ring, leading to the formation of ortho- and para-chlorobenzenesulphonic acids. The para isomer is the major product. \n$C_6H_5Cl + H_2SO_{4(fuming)} \\xrightarrow{\\Delta} C_6H_4(Cl)(SO_3H) \\text{ (o- and p-isomers)} + H_2O$",
    "marks": 2
  },
  {
    "type": "long",
    "text": "Explain SN² reaction mechanism for alkaline hydrolysis of bromomethane. (Sept. 2021)",
    "answer": "The alkaline hydrolysis of bromomethane ($CH_3Br$) with aqueous alkali (e.g., NaOH) follows the $S_N2$ (bimolecular nucleophilic substitution) mechanism. \n**Mechanism:** \nIt is a single-step, concerted process. \n1.  **Backside Attack:** The strong nucleophile, hydroxide ion ($OH^-$), attacks the electron-deficient carbon atom of the C-Br bond from the side directly opposite to the leaving bromine atom. \n2.  **Transition State:** As the nucleophile approaches, a C-OH bond starts to form while the C-Br bond simultaneously starts to break. This occurs via a high-energy, unstable pentavalent transition state in which the carbon atom is partially bonded to both the incoming $OH^-$ group and the outgoing $Br^-$ group. \n3.  **Product Formation:** The C-Br bond breaks completely, and the bromide ion ($Br^-$) departs as the leaving group. The C-OH bond is fully formed, yielding methanol ($CH_3OH$). This process is accompanied by an inversion of the molecule's configuration (Walden inversion).",
    "marks": 2
  },
  {
    "type": "short",
    "text": "Write the product formed when alkyl halide reacts with silver nitrite. (March 2022)",
    "answer": "When an alkyl halide (R-X) reacts with silver nitrite ($AgNO_2$), the major product formed is a **nitroalkane ($R-NO_2$)**. \nThis is because silver nitrite is a predominantly covalent compound, and the nucleophilic attack occurs through the lone pair of electrons on the nitrogen atom. \n$R-X + AgNO_2 \\rightarrow R-NO_2 + AgX$",
    "marks": 1
  },
  {
    "type": "short",
    "text": "What is the action of the following on ethyl bromide? (i) Na in dry ether (ii) Mg in dry ether. (March 2022)",
    "answer": "(i) **Sodium (Na) in dry ether (Wurtz Reaction):** Ethyl bromide reacts with sodium metal in dry ether to form butane. Two alkyl groups couple together. \n   $2CH_3CH_2Br + 2Na \\xrightarrow{Dry Ether} CH_3CH_2CH_2CH_3 + 2NaBr$ \n\n(ii) **Magnesium (Mg) in dry ether (Grignard Reagent Formation):** Ethyl bromide reacts with magnesium metal in dry ether to form ethylmagnesium bromide, a Grignard reagent. \n   $CH_3CH_2Br + Mg \\xrightarrow{Dry Ether} CH_3CH_2MgBr$",
    "marks": 2
  },
  {
    "type": "long",
    "text": "Write chemical reactions for the following conversions: (i) Ethyl bromide to ethyl methyl ether (ii) Ethyl bromide to ethene (iii) Bromobenzene to toluene. (iv) Chlorobenzene to biphenyl. (March 2022)",
    "answer": "(i) **Ethyl bromide to ethyl methyl ether (Williamson Synthesis):** \n   $CH_3CH_2Br + NaOCH_3 \\rightarrow CH_3CH_2OCH_3 + NaBr$ \n(ii) **Ethyl bromide to ethene (Dehydrohalogenation):** \n   $CH_3CH_2Br + alc. KOH \\xrightarrow{\\Delta} CH_2=CH_2 + KBr + H_2O$ \n(iii) **Bromobenzene to toluene (Wurtz-Fittig Reaction):** \n   $C_6H_5Br + CH_3Br + 2Na \\xrightarrow{Dry Ether} C_6H_5CH_3 + 2NaBr$ \n(iv) **Chlorobenzene to biphenyl (Fittig Reaction):** \n   $2C_6H_5Cl + 2Na \\xrightarrow{Dry Ether} C_6H_5-C_6H_5 + 2NaCl$",
    "marks": 4
  },
  {
    "type": "short",
    "text": "Convert ethyl bromide to: (i) Ethyl iodide (ii) Ethyl fluoride. (July 2022)",
    "answer": "(i) **Ethyl bromide to Ethyl iodide (Finkelstein Reaction):** This is a halogen exchange reaction. Ethyl bromide is heated with a solution of sodium iodide in dry acetone. \n   $CH_3CH_2Br + NaI \\xrightarrow{Acetone, \\Delta} CH_3CH_2I + NaBr_{(s)}$ \n\n(ii) **Ethyl bromide to Ethyl fluoride (Swarts Reaction):** This halogen exchange reaction uses a metallic fluoride like silver fluoride ($AgF$) or mercurous fluoride ($Hg_2F_2$). \n   $CH_3CH_2Br + AgF \\xrightarrow{\\Delta} CH_3CH_2F + AgBr$",
    "marks": 2
  },
  {
    "type": "short",
    "text": "Write four salient features of Sₙ1 mechanism. (July 2022)",
    "answer": "Four salient features of the $S_N1$ mechanism are: \n1.  **Two-Step Process:** It is a two-step reaction involving the formation of a carbocation intermediate. \n2.  **Rate Law:** The reaction follows first-order kinetics. The rate depends only on the concentration of the alkyl halide: Rate = k[Alkyl Halide]. \n3.  **Carbocation Intermediate:** The slow, rate-determining step is the formation of a carbocation. The stability of this intermediate determines the reactivity order ($3° > 2° > 1°$). \n4.  **Stereochemistry:** The nucleophile can attack the planar carbocation from either face, leading to racemization if the starting material is chiral.",
    "marks": 2
  },
  {
    "type": "short",
    "text": "Write the structure of the product formed when chlorobenzene is treated with sodium metal in the presence of dry ether. (March 2023)",
    "answer": "This reaction is the **Fittig reaction**. Two molecules of chlorobenzene react with sodium metal in dry ether to form biphenyl by coupling the two phenyl rings. \n\n**Reaction:** \n$2C_6H_5Cl + 2Na \\xrightarrow{Dry Ether} C_6H_5-C_6H_5 + 2NaCl$ \n\n**Structure of the product (Biphenyl):** \nTwo benzene rings are joined together by a single covalent bond.",
    "marks": 1
  },
  {
    "type": "short",
    "text": "Write the chemical reactions for the following: (a) Chlorobenzene is heated with fuming H₂SO₄ (b) Ethyl bromide is heated with silver acetate. (March 2023)",
    "answer": "(a) **Chlorobenzene is heated with fuming H₂SO₄ (Sulphonation):** \nThis is an electrophilic substitution reaction. It yields a mixture of ortho and para isomers, with the para isomer being the major product. \n$C_6H_5Cl + H_2SO_{4(fuming)} \\xrightarrow{\\Delta} p-Cl-C_6H_4-SO_3H + o-Cl-C_6H_4-SO_3H + H_2O$ \n\n(b) **Ethyl bromide is heated with silver acetate:** \nThis is a nucleophilic substitution reaction that forms an ester. \n$CH_3CH_2Br + CH_3COOAg \\xrightarrow{\\Delta} CH_3COOCH_2CH_3 + AgBr$",
    "marks": 2
  },
  {
    "type": "long",
    "text": "Explain dehydrohalogenation reaction of 2-chlorobutane. Write use and environmental effect of CFC. (March 2023)",
    "answer": "**Dehydrohalogenation of 2-chlorobutane:** \nWhen 2-chlorobutane is heated with a strong base in an alcoholic solution (e.g., alcoholic KOH), it undergoes an elimination reaction to form alkenes. This reaction follows **Saytzeff's rule**, which states that the major product will be the more highly substituted (more stable) alkene. \nThere are two possible products: \n1.  **But-2-ene (Major Product):** Formed by removing a hydrogen from C-3. \n    $CH_3-CH_2-CH(Cl)-CH_3 \\xrightarrow{alc. KOH} CH_3-CH=CH-CH_3$ \n2.  **But-1-ene (Minor Product):** Formed by removing a hydrogen from C-1. \n    $CH_3-CH_2-CH(Cl)-CH_3 \\xrightarrow{alc. KOH} CH_2=CH-CH_2-CH_3$ \n\n**Use of CFC (Chlorofluorocarbon):** \nCFCs were widely used as refrigerants in refrigerators and air conditioners, as propellants in aerosol cans, and as blowing agents for making foams and packing materials. \n\n**Environmental Effect of CFC:** \nThe primary environmental effect of CFCs is the **depletion of the stratospheric ozone layer**. When CFCs reach the stratosphere, they are broken down by UV radiation to release highly reactive chlorine free radicals. These radicals catalytically destroy ozone molecules in a chain reaction, leading to the formation of the 'ozone hole' and allowing harmful UV radiation to reach the Earth's surface.",
    "marks": 3
  },
  {
    "type": "short",
    "text": "What is Grignard reagent? How is it prepared? (July 2023)",
    "answer": "**Grignard Reagent:** An organometallic compound with the general formula R-Mg-X, where R is an alkyl or aryl group and X is a halogen (Cl, Br, I). \n\n**Preparation:** It is prepared by reacting an alkyl or aryl halide with magnesium metal turnings in the presence of an anhydrous ether solvent (like diethyl ether, $C_2H_5OC_2H_5$). \n**General Equation:** \n$R-X + Mg \\xrightarrow{Dry Ether} R-Mg-X$",
    "marks": 2
  },
  {
    "type": "short",
    "text": "Explain optical activity of 2-chlorobutane. (July 2023)",
    "answer": "2-Chlorobutane ($CH_3-CHCl-CH_2-CH_3$) is optically active because it contains a chiral carbon atom. The second carbon atom in the chain is bonded to four different groups: a hydrogen atom (-H), a chlorine atom (-Cl), a methyl group ($-CH_3$), and an ethyl group ($-CH_2CH_3$). \nThis chirality means the molecule is non-superimposable on its mirror image. These two mirror-image forms are called enantiomers. One enantiomer rotates the plane of polarized light to the right (dextrorotatory), and the other rotates it to the left (laevorotatory). This ability to rotate plane-polarized light makes 2-chlorobutane an optically active compound.",
    "marks": 2
  },
  {
    "type": "short",
    "text": "Write the use and environmental effect of methylene chloride. (July 2023)",
    "answer": "**Use of Methylene Chloride ($CH_2Cl_2$):** \nMethylene chloride (dichloromethane) is widely used as an industrial solvent. Its primary applications are as a paint stripper and a degreaser. It is also used as a solvent in the manufacture of pharmaceuticals and as a blowing agent for polyurethane foams. \n\n**Environmental Effect:** \nMethylene chloride is a volatile organic compound (VOC). It can contribute to the formation of ground-level ozone (smog). While not as destructive as CFCs, if it reaches the stratosphere, it can be a source of chlorine that contributes to ozone depletion. It is also a suspected carcinogen and can have adverse health effects on humans with prolonged exposure.",
    "marks": 2
  },
  {
    "type": "long",
    "text": "Complete the reaction $CH_3CH_2Cl \\xrightarrow{AgCN, alc. \\Delta} ?$ (March 2024)",
    "answer": "When ethyl chloride ($CH_3CH_2Cl$) is heated with alcoholic silver cyanide (AgCN), a nucleophilic substitution reaction occurs. Since AgCN is a predominantly covalent compound, the nucleophilic attack occurs through the lone pair of electrons on the nitrogen atom. This results in the formation of an isocyanide (or isonitrile) as the major product. \n\n**Reaction:** \n$CH_3CH_2Cl + AgCN \\xrightarrow{alc., \\Delta} CH_3CH_2-NC + AgCl_{(s)}$ \n\nThe product is **Ethyl isocyanide** (or Ethane isonitrile).",
    "marks": 1
  },
  {
    "type": "short",
    "text": "What is the action of the following on ethyl bromide? (a) silver nitrite (b) Mg in dry ether (c) alcoholic sodium hydroxide. (March 2024)",
    "answer": "(a) **Silver nitrite ($AgNO_2$):** Reacts to form nitroethane as the major product. \n   $CH_3CH_2Br + AgNO_2 \\rightarrow CH_3CH_2NO_2 + AgBr$ \n\n(b) **Mg in dry ether:** Forms a Grignard reagent, ethylmagnesium bromide. \n   $CH_3CH_2Br + Mg \\xrightarrow{Dry Ether} CH_3CH_2MgBr$ \n\n(c) **Alcoholic sodium hydroxide (alc. NaOH):** Causes dehydrohalogenation (elimination) to form ethene. \n   $CH_3CH_2Br + alc. NaOH \\xrightarrow{\\Delta} CH_2=CH_2 + NaBr + H_2O$",
    "marks": 3
  }
]