[
  {
    "type": "short",
    "text": "Write the name of nanostructural material used in tyres to increase their life. (Sept. 2021)",
    "answer": "The nanostructural material used in tires to increase their life and reinforce the rubber is **Carbon Black**.",
    "marks": 1
  },
  {
    "type": "short",
    "text": "Explain three principles of green chemistry. (Sept. 2021)",
    "answer": "Three principles of green chemistry are: \n1.  **Prevention:** It is better to prevent the formation of waste than to treat or clean up waste after it has been created. This is the foundational principle of green chemistry. \n2.  **Atom Economy:** Synthetic methods should be designed to maximize the incorporation of all materials used in the process into the final product. This minimizes the production of by-products. \n3.  **Use of Safer Solvents and Auxiliaries:** The use of auxiliary substances (e.g., solvents, separation agents) should be made unnecessary wherever possible and innocuous when used. Green solvents like water or supercritical CO₂ are preferred over volatile organic solvents.",
    "marks": 2
  },
  {
    "type": "short",
    "text": "Define green chemistry. Write two disadvantages of nanotechnology. (March 2022)",
    "answer": "**Green Chemistry:** Green chemistry is the design of chemical products and processes that reduce or eliminate the use and generation of hazardous substances. It aims to make chemistry more environmentally friendly and sustainable. \n\n**Two Disadvantages of Nanotechnology:** \n1.  **Potential Health Risks:** Nanoparticles are small enough to enter the human body through inhalation or skin contact, and their long-term effects on human health are not yet fully understood, with concerns about toxicity and inflammation. \n2.  **Environmental Impact:** The release of engineered nanoparticles into the environment could have unforeseen negative consequences for ecosystems, as they may accumulate in the food chain or have toxic effects on certain organisms.",
    "marks": 2
  },
  {
    "type": "short",
    "text": "Define: Nanochemistry. (July 2022)",
    "answer": "Nanochemistry is the branch of chemistry concerned with the synthesis, characterization, and application of materials and structures at the nanoscale (typically 1-100 nanometers). It involves the study of the unique properties that materials exhibit at this size and the design of novel materials with specific functionalities.",
    "marks": 1
  },
  {
    "type": "short",
    "text": "Define: Nanotechnology. (July 2022)",
    "answer": "Nanotechnology is the design, characterization, production, and application of structures, devices, and systems by controlling shape and size at the nanometer scale (1-100 nm). It is an interdisciplinary field that involves manipulating matter on an atomic and molecular scale.",
    "marks": 1
  },
  {
    "type": "short",
    "text": "Define: Green chemistry. (July 2022)",
    "answer": "Green chemistry, also known as sustainable chemistry, is an area of chemistry and chemical engineering focused on the designing of products and processes that minimize or eliminate the use and generation of hazardous substances.",
    "marks": 1
  },
  {
    "type": "short",
    "text": "Write the name of the technique used to know geometry of nanoparticles. (March 2023)",
    "answer": "The techniques used to determine the geometry and morphology of nanoparticles include **Scanning Electron Microscopy (SEM)** and **Transmission Electron Microscopy (TEM)**.",
    "marks": 1
  },
  {
    "type": "short",
    "text": "Define: Green chemistry. Write two advantages of nanoparticle and nanotechnology. (March 2023)",
    "answer": "**Green Chemistry:** Green chemistry is the design of chemical products and processes that reduce or eliminate the generation of substances hazardous to human health and the environment. \n\n**Two Advantages of Nanoparticles and Nanotechnology:** \n1.  **Enhanced Material Properties:** Materials at the nanoscale can exhibit unique and superior properties (e.g., higher strength, lighter weight, greater chemical reactivity) compared to their bulk counterparts, leading to the development of advanced materials. \n2.  **Medical Applications:** Nanotechnology offers revolutionary applications in medicine, such as targeted drug delivery systems that can deliver drugs directly to cancer cells, and nanoparticles for improved medical imaging and diagnostics.",
    "marks": 2
  },
  {
    "type": "short",
    "text": "Write the name of nano structured material used in car tyres to increase the life of tyres. (March 2023)",
    "answer": "The nano-structured material used in car tires to increase their life, durability, and grip is **Carbon Black**.",
    "marks": 1
  },
  {
    "type": "short",
    "text": "Name the γ-isomer of BHC (July 2023)",
    "answer": "The γ-isomer of BHC (Benzene Hexachloride) is commonly known as **Gammexane** or **Lindane**.",
    "marks": 1
  },
  {
    "type": "short",
    "text": "Write any three advantages and disadvantages of nanoparticles and nanotechnology. (July 2023)",
    "answer": "**Three Advantages:** \n1.  **Medicine:** Development of targeted drug delivery systems and advanced diagnostic tools. \n2.  **Electronics:** Creation of smaller, faster, and more powerful computer chips and electronic components. \n3.  **Materials Science:** Manufacturing of materials that are stronger, lighter, and more durable (e.g., in aerospace and construction). \n\n**Three Disadvantages:** \n1.  **Health Risks:** The potential toxicity of nanoparticles to human cells and organs is not fully understood. \n2.  **Environmental Pollution:** The release of non-biodegradable nanoparticles into the environment may lead to unknown ecological damage. \n3.  **Economic Disruption:** The development of new products through nanotechnology could disrupt existing markets and lead to job displacement in traditional industries.",
    "marks": 2
  },
  {
    "type": "short",
    "text": "Write the name of metal nanoparticle used to remove E.coli bacteria from water. (March 2024)",
    "answer": "The metal nanoparticle used to remove E.coli bacteria from water due to its strong antimicrobial properties is **Silver (Ag) nanoparticle**.",
    "marks": 1
  },
  {
    "type": "long",
    "text": "What is nano material? Write the reaction involved in sol-gel process during hydrolysis. (March 2024)",
    "answer": "**Nanomaterial:** A material having at least one dimension in the nanoscale, which is typically defined as the size range of 1 to 100 nanometers. Due to their small size, nanomaterials exhibit unique physical and chemical properties compared to their bulk counterparts. \n\n**Reaction in Sol-Gel Process (Hydrolysis Step):** \nThe sol-gel process often starts with the hydrolysis of a metal alkoxide precursor. For example, the hydrolysis of tetraethyl orthosilicate (TEOS) to form silica ($SiO_2$). \n$Si(OC_2H_5)_4 \\text{ (TEOS)} + 4H_2O \\rightarrow Si(OH)_4 \\text{ (Silicic acid)} + 4C_2H_5OH \\text{ (Ethanol)}$ \nThis is followed by a condensation step where the silicic acid molecules link together to form the silica gel network.",
    "marks": 2
  },
  {
    "type": "short",
    "text": "Define: Nanoscience. (March 2024)",
    "answer": "Nanoscience is the study of phenomena and the manipulation of materials at the atomic, molecular, and macromolecular scales, where properties differ significantly from those at a larger scale. It is the fundamental science behind nanotechnology.",
    "marks": 1
  }
]