[
  {
    "type": "long",
    "text": "<b>Read the following passage and answer the questions that follow.</b><br><br><i>I was still a thief when I met Anil. And though only 15, I was an experienced and fairly successful hand. Anil was watching a wrestling match when I approached him. He was about 25 — a tall, lean fellow — and he looked easy-going, kind and simple enough for my purpose. I hadn’t had much luck of late and thought I might be able to get into the young man’s confidence.<br><br>“You look a bit of a wrestler yourself,” I said. A little flattery helps in making friends.<br><br>“So do you,” he replied, which put me off for a moment because at that time I was rather thin.<br><br>“Well,” I said modestly, “I do wrestle a bit.”<br><br>“What’s your name?”<br><br>“Hari Singh,” I lied. I took a new name every month. That kept me ahead of the police and my former employers.</i><br><br><b>A1. Simple Factual (2 marks)</b><br>Where did the narrator meet Anil and what was Anil doing?<br><br><b>A2. Complex Factual (2 marks)</b><br>Why did the narrator think Anil would be a good person to rob?<br><br><b>A3. Vocabulary (2 marks)</b><br>Find words from the passage that mean: (i) Praise to please someone (ii) Thin<br><br><b>A4. Grammar (2 marks)</b><br>Do as directed:<br>(i) I was still a thief. (Identify the tense)<br>(ii) A little flattery helps in making friends. (Add a question tag)<br><br><b>A5. Personal Response (2 marks)</b><br>Do you think it is right to lie to make friends? Why?",
    "answer": "<b>A1.</b> The narrator, Hari Singh, met Anil while Anil was watching a wrestling match.<br><br><b>A2.</b> The narrator thought Anil would be a good person to rob because he looked easy-going, kind, and simple enough to be easily tricked and won over.<br><br><b>A3.</b> (i) Flattery, (ii) Lean / Thin<br><br><b>A4.</b> (i) Past Continuous Tense. (ii) A little flattery helps in making friends, doesn't it?<br><br><b>A5.</b> No, I do not think it is right to lie to make friends. Friendship should be based on trust and honesty. Starting a friendship with a lie means the foundation is weak, and the truth will eventually come out, which can hurt the other person and destroy the relationship.",
    "marks": 10
  },
  {
    "type": "long",
    "text": "<b>Read the following passage and answer the questions that follow.</b><br><br><i>Anil made money by fits and starts. He would borrow one week, lend the next. He kept worrying about his next cheque, but as soon as it arrived he would go out and celebrate. It seems he wrote for a magazine — a queer way to make a living!<br><br>One evening he came home with a small bundle of notes, saying he had just sold a book to a publisher. At night, I saw him tuck the money under the mattress.<br><br>I had been working for Anil for almost a month and, apart from cheating on the shopping, had not done anything in my line of work. I had every opportunity for doing so. Anil had given me a key to the door, and I could come and go as I pleased. He was the most trusting person I had ever met.<br><br>And that is why it was so difficult to rob him. It’s easy to rob a greedy man, because he can afford to be robbed; but it’s difficult to rob a careless man — sometimes he doesn’t even notice he’s been robbed, and that takes all the pleasure out of the work.</i><br><br><b>A1. Simple Factual (2 marks)</b><br>How did Anil make a living?<br><br><b>A2. Complex Factual (2 marks)</b><br>Why was it difficult for Hari Singh to rob Anil?<br><br><b>A3. Vocabulary (2 marks)</b><br>Find antonyms for the following from the passage: (i) Spend (ii) Distrustful<br><br><b>A4. Grammar (2 marks)</b><br>Do as directed:<br>(i) He was the most trusting person. (Change to positive degree)<br>(ii) I saw him tuck the money under the mattress. (Rewrite using 'when')<br><br><b>A5. Personal Response (2 marks)</b><br>What qualities of Anil do you admire the most?",
    "answer": "<b>A1.</b> Anil made a living by writing for a magazine.<br><br><b>A2.</b> It was difficult for Hari Singh to rob Anil because Anil was a very trusting and careless person. Robbing someone so trusting took all the pleasure out of the work for Hari Singh.<br><br><b>A3.</b> (i) Borrow (ii) Trusting<br><br><b>A4.</b> (i) No other person was as trusting as he was. (ii) I saw him when he tucked the money under the mattress.<br><br><b>A5.</b> I admire Anil's trusting and forgiving nature. He was kind enough to teach Hari Singh how to read and write, and even after being robbed, he did not hand him over to the police. His kindness helped in transforming Hari Singh.",
    "marks": 10
  },
  {
    "type": "long",
    "text": "<b>Language Study (Grammar)</b><br><br><b>Do as directed:</b><br><br>1. He was the most trusting person I had ever met. (Make it negative without changing the meaning)<br><br>2. Anil made money by fits and starts. (Frame a 'Wh'-question to get the underlined part as an answer)<br><br>3. I took a new name every month. (Rewrite in the Past Perfect Continuous Tense)<br><br>4. A little flattery helps in making friends. (Identify the subject and predicate)",
    "answer": "1. I had never met a more trusting person than him.<br><br>2. How did Anil make money?<br><br>3. I had been taking a new name every month.<br><br>4. <b>Subject:</b> A little flattery<br><b>Predicate:</b> helps in making friends",
    "marks": 4
  },
  {
    "type": "short",
    "text": "Write a character sketch of Anil.",
    "answer": "Anil is portrayed as a kind, simple, and easy-going young man of about 25. He is a struggling writer who makes money 'by fits and starts'. His most important quality is his trusting nature; he trusts Hari Singh completely, giving him the key to his room. He is also compassionate and forgiving. Even after realizing that Hari had robbed him, he does not expose him. Instead, he continues to teach him, which ultimately leads to Hari's transformation. Anil is a good-hearted person who believes in the inherent goodness of others.",
    "marks": 2
  }
]

