[
  {
    "type": "long",
    "text": "<b>Read the following passage and answer the questions that follow.</b><br><br><i>Arjan Singh was an icon of India’s military history. He had successfully led a young IAF during the 1965 Indo-Pak war. The then Defence Minister Y.B. Chavan had praised him saying, “Air Marshal Arjan Singh is a jewel of a person, quiet and efficient but a firm leader.”<br><br>Singh was born on 15 April 1919, in Lyallpur (now Faisalabad, Pakistan). His father, grandfather and great-grandfather had all served in the cavalry. He completed his education at Montgomery (now Sahiwal, Pakistan). In 1938, at the age of 19 he was selected for the pilot training at RAF Cranwell. He was commissioned as a pilot officer in 1939 and joined the No.1 RIAF Squadron at Ambala.<br><br>He was a fearless and exceptional pilot. In 1944, he led the squadron against the Japanese during the Arakan Campaign. For his role in successfully leading the squadron in combat, he received the Distinguished Flying Cross (DFC) on the spot, the first Indian pilot to receive it.</i><br><br><b>A1. Simple Factual (2 marks)</b><br>Complete the following sentences:<br>(i) Arjan Singh was born on _______.<br>(ii) He received the _______ award in 1944.<br><br><b>A2. Complex Factual (2 marks)</b><br>What were the words of praise for Arjan Singh from the then Defence Minister?<br><br><b>A3. Vocabulary (2 marks)</b><br>Write the noun forms of the following words: (i) successful (ii) educated<br><br><b>A4. Grammar (2 marks)</b><br>Do as directed:<br>(i) He was a fearless and exceptional pilot. (Rewrite as an exclamatory sentence)<br>(ii) He led the squadron against the Japanese. (Change the voice)<br><br><b>A5. Personal Response (2 marks)</b><br>What qualities do you think are needed to be a good leader?",
    "answer": "<b>A1.</b><br>(i) Arjan Singh was born on 15 April 1919.<br>(ii) He received the Distinguished Flying Cross (DFC) award in 1944.<br><br><b>A2.</b> The then Defence Minister, Y.B. Chavan, praised him by saying, “Air Marshal Arjan Singh is a jewel of a person, quiet and efficient but a firm leader.”<br><br><b>A3.</b> (i) success (ii) education<br><br><b>A4.</b><br>(i) What a fearless and exceptional pilot he was!<br>(ii) The squadron was led by him against the Japanese.<br><br><b>A5.</b> I think to be a good leader, a person needs qualities like courage, firmness, integrity, and the ability to inspire others. A good leader should also be a good listener and should lead by example, just like Arjan Singh.",
    "marks": 10
  },
  {
    "type": "long",
    "text": "<b>Read the following passage and answer the questions that follow.</b><br><br><i>After his promotion to the rank of Wing Commander, he attended the Royal Staff College at the U.K. Immediately after Indian independence, he commanded Ambala in the rank of Group Captain. In 1949, he took over as the Air Officer Commanding (AOC) of an operational command, which later came to be known as Western Air Command.<br><br>Singh had the distinction of having the longest tenure as AOC of an operational base, initially from 1949-1952 and then again from 1957-1961. After his stint as the AOC, he was appointed as the Vice Chief of Air Staff. He had a key role to play in transforming the IAF into a modern and world-renowned force.<br><br>In 1964, Arjan Singh took over as the Chief of Air Staff (CAS). When he was the CAS, the IAF was embroiled in the 1965 war with Pakistan. He led the IAF from the front with courage, determination and professional skill. He inspired the IAF to victory, despite the constraints imposed on the full-scale use of Air Force combat power.</i><br><br><b>A1. Web (2 marks)</b><br>Complete the web chart with Arjan Singh's appointments.<br><br><br><b>A2. Complex Factual (2 marks)</b><br>What key role did Arjan Singh play in transforming the IAF?<br><br><b>A3. Vocabulary (2 marks)</b><br>Find words from the passage which mean: (i) A period of time spent working somewhere (ii) Involved in a difficult situation<br><br><b>A4. Grammar (2 marks)</b><br>Do as directed:<br>(i) He inspired the IAF to victory. (Rewrite in the passive voice)<br>(ii) Arjan Singh took over as the Chief of Air Staff. (Frame a 'Wh'-question to get the underlined part as the answer)<br><br><b>A5. Personal Response (2 marks)</b><br>Do you think it is important for a country to have a strong Air Force? Why?",
    "answer": "<b>A1.</b> Arjan Singh's appointments:<br>1. Air Officer Commanding (AOC)<br>2. Vice Chief of Air Staff<br>3. Chief of Air Staff (CAS)<br>4. Wing Commander<br><br><b>A2.</b> Arjan Singh had a key role to play in transforming the IAF into a modern and world-renowned force.<br><br><b>A3.</b> (i) stint (ii) embroiled<br><br><b>A4.</b><br>(i) The IAF was inspired to victory by him.<br>(ii) What did Arjan Singh take over as?<br><br><b>A5.</b> Yes, I think it is extremely important for a country to have a strong Air Force. A strong Air Force is crucial for national security as it protects the country's airspace from external threats. It also plays a vital role in providing air support during wars and in carrying out rescue operations during natural disasters.",
    "marks": 10
  },
  {
    "type": "long",
    "text": "<b>Language Study (Grammar)</b><br><br><b>Do as directed:</b><br><br>1. He was a fearless and exceptional pilot. (Use 'not only... but also')<br><br>2. He inspired the IAF to victory. (Identify the verb and state its tense)<br><br>3. He had successfully led a young IAF. (Rewrite using the future perfect tense)<br><br>4. Singh is a jewel of a person. (Identify the articles)",
    "answer": "1. He was not only a fearless but also an exceptional pilot.<br><br>2. <b>Verb:</b> inspired; <b>Tense:</b> Simple Past Tense<br><br>3. He will have successfully led a young IAF.<br><br>4. <b>a</b> - indefinite article; <b>a</b> - indefinite article",
    "marks": 4
  },
  {
    "type": "short",
    "text": "Write a short summary of Arjan Singh's career achievements.",
    "answer": "Air Marshal Arjan Singh was an iconic figure in India's military. He was an exceptional and fearless pilot who, in 1944, became the first Indian pilot to receive the Distinguished Flying Cross for his bravery. After independence, he held several important positions, including Air Officer Commanding (AOC) and Vice Chief of Air Staff. As the Chief of Air Staff in 1965, he skillfully led the Indian Air Force to victory in the Indo-Pak war. He was instrumental in transforming the IAF into a modern force. In recognition of his immense contribution, he was promoted to the five-star rank of Marshal of the Indian Air Force, the first and only officer to achieve this rank.",
    "marks": 2
  }
]

