[
  {
    "type": "long",
    "text": "<b>Read the following extract and answer the questions that follow.</b><br><br><i>All the world’s a stage,<br>And all the men and women merely players;<br>They have their exits and their entrances,<br>And one man in his time plays many parts,<br>His acts being seven ages. At first, the infant,<br>Mewling and puking in the nurse’s arms.<br>Then the whining schoolboy, with his satchel<br>And shining morning face, creeping like snail<br>Unwillingly to school.</i><br><br><b>A1. Simple Factual (2 marks)</b><br>Match the following stages with their descriptions.<br><b>Column A (Stage)</b><br>(i) Infant<br>(ii) Schoolboy<br><b>Column B (Description)</b><br>(a) Whining and creeping like a snail<br>(b) Crying and vomiting in the nurse's arms<br><br><b>A2. Complex Factual (2 marks)</b><br>What does the poet mean by 'exits and entrances' in the context of the poem?<br><br><b>A3. Poetic Device (1 mark)</b><br>Identify and explain the figure of speech in the line: 'creeping like snail'.",
    "answer": "<b>A1.</b><br>(i) Infant - (b) Crying and vomiting in the nurse's arms<br>(ii) Schoolboy - (a) Whining and creeping like a snail<br><br><b>A2.</b> In the context of the poem, where the world is compared to a stage, 'entrances' refers to a person's birth, and 'exits' refers to a person's death. Just like actors enter and leave the stage, human beings take birth and eventually die.<br><br><b>A3.</b> The figure of speech is <b>Simile</b>. There is a direct comparison between the schoolboy's movement ('creeping') and that of a 'snail', using the word 'like'.",
    "marks": 5
  },
  {
    "type": "long",
    "text": "<b>Read the following extract and answer the questions that follow.</b><br><br><i>The sixth age shifts<br>Into the lean and slippered pantaloon,<br>With spectacles on nose and pouch on side;<br>His youthful hose, well saved, a world too wide<br>For his shrunk shank, and his big manly voice,<br>Turning again toward childish treble, pipes<br>And whistles in his sound. Last scene of all,<br>That ends this strange eventful history,<br>Is second childishness and mere oblivion,<br>Sans teeth, sans eyes, sans taste, sans everything.</i><br><br><b>A1. Simple Factual (2 marks)</b><br>Describe the appearance of the man in the sixth stage of life.<br><br><b>A2. Interpretation (2 marks)</b><br>What does the poet mean by 'second childishness and mere oblivion' in the last stage?<br><br><b>A3. Poetic Device (1 mark)</b><br>Identify the figure of speech in the line 'That ends this strange eventful history'.",
    "answer": "<b>A1.</b> In the sixth stage, the man is old, thin ('lean'), and wears slippers ('slippered pantaloon'). He has spectacles on his nose and a pouch on his side. His clothes from his youth are now too loose for his shrunken body.<br><br><b>A2.</b> By 'second childishness', the poet means that in extreme old age, a person becomes helpless and dependent on others, much like an infant. 'Mere oblivion' refers to the state of forgetfulness and loss of all senses ('sans teeth, sans eyes, sans taste'), indicating the end of life's journey.<br><br><b>A3.</b> The figure of speech is <b>Metaphor</b>. Life is implicitly compared to a 'strange eventful history' (a play or story).",
    "marks": 5
  },
  {
    "type": "long",
    "text": "<b>Write the appreciation of the poem 'All the World's a Stage'. You can use the following points:</b><br><ul><li>About the poem/poet and the title</li><li>The theme</li><li>Poetic style, language, poetic devices</li><li>Special features/message</li><li>Your opinion about the poem</li></ul>",
    "answer": "<b>Appreciation of the Poem</b><br><br><b>About the Poem/Poet:</b> The poem 'All the World's a Stage' is a monologue from William Shakespeare's famous play 'As You Like It'. The title itself introduces the central metaphor of the poem.<br><br><b>Theme:</b> The theme of the poem is the cycle of human life. Shakespeare compares life to a play and divides a person's life into seven distinct stages, from infancy to extreme old age, describing the characteristics of each stage.<br><br><b>Poetic Style and Devices:</b> The poem is written in blank verse (unrhymed iambic pentameter). The most prominent figure of speech is <b>Metaphor</b>, as seen in the line 'All the world's a stage'. Shakespeare also uses <b>Simile</b> (e.g., 'creeping like snail', 'sighing like furnace'), <b>Alliteration</b> (e.g., 'quick in quarrel'), and <b>Repetition</b> (e.g., 'sans teeth, sans eyes...').<br><br><b>Special Features/Message:</b> The poem's special feature is its brilliant and vivid depiction of the different phases of human life, which is universally relatable. The message is that every person is a player on the stage of life, and must play their many parts before making their final exit.<br><br><b>My Opinion:</b> I find this poem to be a profound and beautifully written summary of human life. It makes one reflect on the transient nature of life and the different roles we play. The descriptions are so vivid that one can easily picture each stage.",
    "marks": 5
  },
  {
    "type": "short",
    "text": "Describe the third and fourth stages of a man's life as described by the poet.",
    "answer": "<b>Third Stage (The Lover):</b> In this stage, a man is a passionate lover. He is depicted as sighing like a furnace and writing sad poems or ballads for his beloved.<br><br><b>Fourth Stage (The Soldier):</b> In this stage, the man becomes a soldier. He is full of strange oaths, aggressive, 'jealous in honor', and quick to quarrel. He is willing to risk his life for a temporary and fleeting reputation.",
    "marks": 2
  }
]

