[
  {
    "type": "long",
    "text": "<b>Read the following passage and answer the questions that follow.</b><br><br><i>To see a world in a grain of sand<br>And a heaven in a wild flower,<br>Hold infinity in the palm of your hand<br>And eternity in an hour.<br> - William Blake<br><br>Something, as tiny as a grain of sand, can spark off an idea or imagination of a huge significance to the world. One can witness and experience the beauty of Heaven in something as small as a wild flower and derive joy forever. Only one should have the eyes and time to see it. Infinity is endless space; but your small palm can hold the destiny of earth through your efforts. Eternity is endless time; but just an hour in your life can make a difference to the world forever.</i><br><br><b>A1. Simple Factual (2 marks)</b><br>What can one see in a grain of sand and a wild flower according to the poet?<br><br><b>A2. Complex Factual (2 marks)</b><br>What can a small palm and a single hour achieve according to the author?<br><br><b>A3. Vocabulary (2 marks)</b><br>Find words from the passage which mean: (i) Importance (ii) Limitless time<br><br><b>A4. Grammar (2 marks)</b><br>Do as directed:<br>(i) Your small palm can hold the destiny of earth. (Rewrite using a modal auxiliary showing advice)<br>(ii) One can witness the beauty of Heaven. (Change the voice)<br><br><b>A5. Personal Response (2 marks)</b><br>Do you agree that small things in nature can teach us a lot? Give an example.",
    "answer": "<b>A1.</b> According to the poet, one can see a world in a grain of sand and a heaven in a wild flower.<br><br><b>A2.</b> According to the author, a small palm can hold the destiny of the earth through one's efforts, and a single hour in one's life can make a difference to the world forever.<br><br><b>A3.</b> (i) significance (ii) eternity<br><br><b>A4.</b><br>(i) Your small palm should hold the destiny of earth.<br>(ii) The beauty of Heaven can be witnessed by one.<br><br><b>A5.</b> Yes, I completely agree that small things in nature can teach us a lot. For example, watching a tiny ant carry a load much heavier than itself teaches us about perseverance and hard work. It shows that with determination, we can overcome huge obstacles.",
    "marks": 10
  },
  {
    "type": "long",
    "text": "<b>Read the following passage and answer the questions that follow.</b><br><br><i>We saw small bits of grass peeping through the small cracks in a concrete pavement. It left us thinking: however impossible things may look, there is always an opening...<br><br>We saw a tree bare of all leaves in the cold winter months. We thought its chapter was over. But three months passed, spring set in and the tree was back to its green majesty once again, full of leaves, flowers, birds and life. What if we too had the conviction that, however difficult things are right now, it will not remain so for ever. Remember this too shall pass.<br><br>We saw an army of ants lugging a fly which was at least ten times the ant’s size. The ants organized themselves around the fly, lifted it on frail feelers and carried it to a quiet distance. Their teamwork and perseverance were amazing. What if we too are consistent, organized, focused...</i><br><br><b>A1. Web (2 marks)</b><br>Complete the web chart showing what the author learned from the ants.<br><br><br><b>A2. Complex Factual (2 marks)</b><br>What lesson did the bare tree in winter teach the author?<br><br><b>A3. Vocabulary (2 marks)</b><br>Write the adjective forms for the following words: (i) majesty (ii) life<br><br><b>A4. Grammar (2 marks)</b><br>Do as directed:<br>(i) We saw a tree bare of all leaves. (Rewrite as a complex sentence)<br>(ii) Their teamwork and perseverance were amazing. (Make it exclamatory)<br><br><b>A5. Personal Response (2 marks)</b><br>Describe a time when you felt that a difficult situation was temporary and it passed.",
    "answer": "<b>A1.</b> Lessons from the ants:<br>1. Teamwork<br>2. Perseverance<br>3. Organization<br>4. Focus<br><br><b>A2.</b> The bare tree taught the author that difficult times do not last forever. Just as the tree, which looked lifeless in winter, came back to its full glory in spring, we should also have the conviction that our difficult phases will pass.<br><br><b>A3.</b> (i) majestic (ii) lively/living<br><br><b>A4.</b><br>(i) We saw a tree which was bare of all leaves.<br>(ii) How amazing their teamwork and perseverance were!<br><br><b>A5.</b> During my last exam, I found one subject very difficult and I was worried I might fail. However, I remembered that this was just a temporary phase. I worked hard, got help from my teacher, and managed to score well. It taught me that difficult times can be overcome with effort and a positive attitude.",
    "marks": 10
  },
  {
    "type": "long",
    "text": "<b>Language Study (Grammar)</b><br><br><b>Do as directed:</b><br><br>1. It will not remain so for ever. (Make it affirmative)<br><br>2. We saw an army of ants. (Identify the type of noun for the underlined word)<br><br>3. We thought its chapter was over. (Add a question tag)<br><br>4. However impossible things may look, there is always an opening. (Identify the clause)",
    "answer": "1. It will change someday.<br><br>2. <b>army</b> - Collective Noun<br><br>3. We thought its chapter was over, didn't we?<br><br>4. 'However impossible things may look' - Subordinate Adverb Clause of Concession.",
    "marks": 4
  },
  {
    "type": "short",
    "text": "What is the central idea or the 'alchemy of nature' that the author is trying to convey?",
    "answer": "The central idea is that nature is the greatest teacher. The author explains that even the smallest and seemingly insignificant elements of nature—like a blade of grass, a bare tree, or a team of ants—can teach us profound life lessons. This ability of nature to inspire, motivate, and transform our thinking is its 'alchemy' or magical power. It teaches us about hope, perseverance, teamwork, and the fact that difficult times are always temporary.",
    "marks": 2
  }
]

