[
  {
    "type": "long",
    "text": "<b>Read the following extract and answer the questions that follow.</b><br><br><i>I think I could turn and live with animals, they are<br>so placid and self-contain’d,<br>I stand and look at them long and long.<br><br>They do not sweat and whine about their condition,<br>They do not lie awake in the dark and weep for their sins,<br>They do not make me sick discussing their duty to God,<br>Not one is dissatisfied, not one is demented with<br>the mania of owning things,<br>Not one kneels to another, nor to his kind that<br>lived thousands of years ago,<br>Not one is respectable or unhappy over the whole earth.</i><br><br><b>A1. Web (2 marks)</b><br>Complete the web chart with what the animals do NOT do.<br><br><br><b>A2. Complex Factual (2 marks)</b><br>What is the poet's attitude towards the animals? Why does he feel that way?<br><br><b>A3. Poetic Device (1 mark)</b><br>Identify and explain the figure of speech in the line: 'I stand and look at them long and long.'",
    "answer": "<b>A1.</b> What Animals Don't Do:<br>1. Sweat and whine about their condition.<br>2. Weep for their sins.<br>3. Discuss their duty to God.<br>4. Kneel to another.<br><br><b>A2.</b> The poet's attitude towards the animals is one of admiration and longing. He wishes he could live with them because he finds them to be calm, self-sufficient, and content. He feels this way because they do not possess the complexities and vices like greed, guilt, and hypocrisy that are common in human beings.<br><br><b>A3.</b> The figure of speech is <b>Repetition</b>. The word 'long' is repeated to emphasize the great length of time the poet spends looking at the animals, showing his deep admiration.",
    "marks": 5
  },
  {
    "type": "long",
    "text": "<b>Write the appreciation of the poem 'Animals'. You can use the following points:</b><br><ul><li>About the poem/poet and the title</li><li>The theme</li><li>Poetic style, language, poetic devices</li><li>Special features/message</li><li>Your opinion about the poem</li></ul>",
    "answer": "<b>Appreciation of the Poem</b><br><br><b>About the Poem/Poet:</b> The poem 'Animals' is written by the famous American poet Walt Whitman. It is taken from his major work, 'Song of Myself' in 'Leaves of Grass'. The title is simple and direct, indicating the subject of the poem.<br><br><b>Theme:</b> The central theme is the poet's praise for the life of animals, which he considers superior to that of human beings. He contrasts the calm, simple, and honest nature of animals with the complicated, greedy, and hypocritical nature of humans.<br><br><b>Poetic Style and Devices:</b> The poem is written in free verse, which is a characteristic style of Walt Whitman. It does not have a regular rhyme scheme or meter. The poet uses several figures of speech, including <b>Repetition</b> ('long and long'), <b>Alliteration</b> ('sweat and whine'), and <b>Tautology</b> ('placid and self-contain'd'). The rhetorical question at the end, 'Did I pass that way huge times ago and negligently drop them?', is also a key feature.<br><br><b>Special Features/Message:</b> The poem's special feature is its direct and powerful comparison between animal and human virtues. The message is a critique of human society and a call to return to the simple, honest virtues ('tokens') that animals seem to possess, but which humans have lost.<br><br><b>My Opinion:</b> I find this poem very thought-provoking. It makes us reflect on the negative traits that have become common in human society. The poet's admiration for the simple and content life of animals is a powerful reminder of the values we have forgotten.",
    "marks": 5
  },
  {
    "type": "short",
    "text": "What are the 'tokens' that the poet says he may have dropped long ago?",
    "answer": "The 'tokens' refer to the innate qualities of innocence, simplicity, contentment, and honesty. The poet believes that human beings once possessed these virtues but have negligently lost them over time in their pursuit of material possessions and social status. He sees these same 'tokens' being plainly displayed by the animals.",
    "marks": 2
  },
  {
    "type": "short",
    "text": "Match the words in Column A with their meanings in Column B.<br><br><b>Column A</b><br>(1) Placid<br>(2) Whine<br>(3) Demented<br>(4) Tokens<br><br><b>Column B</b><br>(a) Mad or insane<br>(b) Virtues or qualities<br>(c) Complain in a crying tone<br>(d) Calm and peaceful",
    "answer": "(1) - (d) Calm and peaceful<br>(2) - (c) Complain in a crying tone<br>(3) - (a) Mad or insane<br>(4) - (b) Virtues or qualities",
    "marks": 2
  }
]

