[
  {
    "type": "long",
    "text": "<b>Read the following passage and answer the questions that follow.</b><br><br><i>It once occurred to a certain king, that if he always knew the right time to begin everything; if he knew who were the right people to listen to, and whom to avoid; and, above all, if he always knew what was the most important thing to do, he would never fail in anything he might undertake.<br><br>And this thought having occurred to him, he had it proclaimed throughout his kingdom that he would give a great reward to anyone who would teach him what was the right time for every action, who were the most necessary people, and how he might know what was the most important thing to do.<br><br>Learned men came to the King, but they all answered his questions differently. In reply to the first question, some said that to know the right time for every action, one must draw up in advance, a table of days, months and years, and must live strictly according to it. Others declared that it was impossible to decide beforehand the right time for every action; but that, not letting oneself be absorbed in idle pastimes, one should always attend to all that was going on, and then do what was most needful.</i><br><br><b>A1. Simple Factual (2 marks)</b><br>What were the three questions that the king wanted answers to?<br><br><b>A2. Complex Factual (2 marks)</b><br>Why did the king want the answers to his three questions?<br><br><b>A3. Vocabulary (2 marks)</b><br>Find words from the passage that mean: (i) Announced officially (ii) Unimportant or lazy<br><br><b>A4. Grammar (2 marks)</b><br>Do as directed:<br>(i) He would never fail in anything. (Make it affirmative)<br>(ii) Learned men came to the King. (Add a question tag)<br><br><b>A5. Personal Response (2 marks)</b><br>If you could ask a wise person three questions about life, what would they be?",
    "answer": "<b>A1.</b> The three questions the king wanted answers to were:<br>1. What is the right time to begin everything?<br>2. Who are the right people to listen to?<br>3. What is the most important thing to do?<br><br><b>A2.</b> The king wanted the answers to these three questions because he believed that if he knew them, he would never fail in anything he might undertake.<br><br><b>A3.</b> (i) proclaimed (ii) idle<br><br><b>A4.</b><br>(i) He would always succeed in everything.<br>(ii) Learned men came to the King, didn't they?<br><br><b>A5.</b> If I could ask a wise person three questions, I would ask:<br>1. What is the true purpose of life?<br>2. How can one find lasting happiness?<br>3. What is the best way to deal with failure?",
    "marks": 10
  },
  {
    "type": "long",
    "text": "<b>Read the following passage and answer the questions that follow.</b><br><br><i>The King went on digging. The sun began to sink behind the trees, and the King at last stuck the spade into the ground, and said: “I came to you, wise man, for an answer to my questions. If you can give me none, tell me so, and I will return home.”<br><br>“Here comes someone running,” said the hermit, “let us see who it is.”<br><br>The King turned round, and saw a bearded man come running out of the wood. The man held his hands pressed against his stomach, and blood was flowing from under them. When he reached the King, he fainted and fell to the ground, moaning feebly. The King and the hermit unfastened the man’s clothing. There was a large wound in his stomach. The King washed it as best he could, and bandaged it with his handkerchief and with a towel the hermit had. But the blood would not stop flowing, and the King again and again removed the bandage soaked with warm blood and washed and rebandaged the wound.</i><br><br><b>A1. Simple Factual (2 marks)</b><br>Describe the condition of the man who came running from the wood.<br><br><b>A2. Complex Factual (2 marks)</b><br>What did the king do to help the wounded man?<br><br><b>A3. Vocabulary (2 marks)</b><br>Give the verb forms of the following words: (i) answer (ii) clothing<br><br><b>A4. Grammar (2 marks)</b><br>Do as directed:<br>(i) The sun began to sink behind the trees. (Rewrite in the Present Perfect Tense)<br>(ii) The King washed it as best he could. (Change to positive degree)<br><br><b>A5. Personal Response (2 marks)</b><br>What does the King's action of helping the wounded man tell you about his character?",
    "answer": "<b>A1.</b> The man who came running from the wood was bearded. He had his hands pressed against his stomach, from where blood was flowing. He was moaning feebly and fainted when he reached the king.<br><br><b>A2.</b> The king first unfastened the man's clothing to see the large wound in his stomach. He then washed the wound as best as he could and bandaged it with his handkerchief and the hermit's towel. He repeatedly cleaned and rebandaged the wound until the bleeding stopped.<br><br><b>A3.</b> (i) answer (ii) clothe<br><br><b>A4.</b><br>(i) The sun has begun to sink behind the trees.<br>(ii) No one else could have washed it as well as the King.<br><br><b>A5.</b> The King's action shows that he was a very kind, compassionate, and humble person. Despite being a king, he did not hesitate to perform the humble task of nursing a wounded commoner. It shows that he valued human life above his royal status.",
    "marks": 10
  },
  {
    "type": "long",
    "text": "<b>Language Study (Grammar)</b><br><br><b>Do as directed:</b><br><br>1. They all answered his questions differently. (Identify the part of speech of the underlined word)<br><br>2. The hermit was digging the ground. (Change the voice)<br><br>3. When he reached the King, he fainted. (Rewrite as a simple sentence)<br><br>4. The King was very glad. (Make it exclamatory)",
    "answer": "1. <b>differently</b> - Adverb<br><br>2. The ground was being dug by the hermit.<br><br>3. On reaching the King, he fainted.<br><br>4. How glad the King was!",
    "marks": 4
  },
  {
    "type": "short",
    "text": "What were the hermit's answers to the three questions? Explain them briefly.",
    "answer": "The hermit answered the questions through the king's actions:<br>1. <b>The most important time:</b> The hermit explained that the most important time is 'Now' (the present), because it is the only time we have any power to act.<br>2. <b>The most necessary person:</b> The most necessary person is the one you are with at a particular moment, because no one knows if they will have dealings with anyone else in the future.<br>3. <b>The most important thing to do:</b> The most important thing is to do good for that person. This is the main purpose of life.",
    "marks": 2
  }
]

