[
  {
    "type": "long",
    "text": "<b>Read the following passage and answer the questions that follow.</b><br><br><i>My first story is about connecting the dots.<br><br>I dropped out of Reed College after the first 6 months, but then stayed around as a drop-in for another 18 months or so before I really quit. So why did I drop out?<br><br>It started before I was born. My biological mother was a young, unwed college graduate student, and she decided to put me up for adoption. She felt very strongly that I should be adopted by college graduates... So my parents, who were on a waiting list, got a call in the middle of the night asking: ‘We have an unexpected baby boy; do you want him?’ They said: ‘Of course.’ My biological mother later found out that my mother had never graduated from college and that my father had never graduated from high school. She refused to sign the final adoption papers. She only relented a few months later when my parents promised that I would someday go to college.</i><br><br><b>A1. Simple Factual (2 marks)</b><br>Complete the following sentences:<br>(i) Steve Jobs dropped out of Reed College after _______.<br>(ii) The biological mother wanted her baby to be adopted by _______.<br><br><b>A2. Complex Factual (2 marks)</b><br>Why did Steve Jobs' biological mother initially refuse to sign the adoption papers?<br><br><b>A3. Vocabulary (2 marks)</b><br>Find words from the passage which mean: (i) Gave in or yielded (ii) Not married<br><br><b>A4. Grammar (2 marks)</b><br>Do as directed:<br>(i) I dropped out of Reed College. (Frame a 'Wh'-question to get the underlined part as the answer)<br>(ii) She refused to sign the final adoption papers. (Make it negative without changing the meaning)<br><br><b>A5. Personal Response (2 marks)</b><br>Do you think the promise made by Steve's adoptive parents was important? Why?",
    "answer": "<b>A1.</b><br>(i) Steve Jobs dropped out of Reed College after <b>the first 6 months</b>.<br>(ii) The biological mother wanted her baby to be adopted by <b>college graduates</b>.<br><br><b>A2.</b> Steve Jobs' biological mother initially refused to sign the adoption papers because she found out that his adoptive mother had never graduated from college and his adoptive father had never graduated from high school, which was against her strong wish for her child.<br><br><b>A3.</b> (i) relented (ii) unwed<br><br><b>A4.</b><br>(i) Which college did you drop out of?<br>(ii) She was unwilling to sign the final adoption papers.<br><br><b>A5.</b> Yes, I think the promise was very important. It was a promise that fulfilled the deepest wish of the biological mother and it was the reason she finally agreed to the adoption. It shows the adoptive parents' commitment to providing the best future for their child, which is the foundation of a loving family.",
    "marks": 10
  },
  {
    "type": "long",
    "text": "<b>Read the following passage and answer the questions that follow.</b><br><br><i>None of this had even a hope of any practical application in my life. But ten years later, when we were designing the first Macintosh computer, it all came back to me. And we designed it all into the Mac. It was the first computer with beautiful typography.<br><br>If I had never dropped in on that single course in college, the Mac would have never had multiple typefaces or proportionally spaced fonts. And since Windows just copied the Mac, it’s likely no personal computer would have them.<br><br>Of course it was impossible to connect the dots looking forward when I was in college. But it was very, very clear looking backward ten years later.<br><br>Again, you can’t connect the dots looking forward; you can only connect them looking backward. So you have to trust that the dots will somehow connect in your future. You have to trust in something — your gut, destiny, life, karma, whatever. This approach has never let me down, and it has made all the difference in my life.</i><br><br><b>A1. Simple Factual (2 marks)</b><br>What was the first computer with beautiful typography?<br><br><b>A2. Complex Factual (2 marks)</b><br>What does Steve Jobs say about connecting the dots?<br><br><b>A3. Vocabulary (2 marks)</b><br>Find words from the passage which mean: (i) Relating to the art of printing (ii) The feeling that something is true or real<br><br><b>A4. Grammar (2 marks)</b><br>Do as directed:<br>(i) It was the first computer with beautiful typography. (Rewrite as a negative sentence)<br>(ii) You have to trust in something. (Add a question tag)<br><br><b>A5. Personal Response (2 marks)</b><br>Describe an experience in your life where something you learned unexpectedly became useful later.",
    "answer": "<b>A1.</b> The first computer with beautiful typography was the Macintosh computer (the Mac).<br><br><b>A2.</b> Steve Jobs says that it is impossible to connect the dots looking forward into the future. One can only connect them when looking back at the past. Therefore, he advises that we must trust that the dots will somehow connect in our future.<br><br><b>A3.</b> (i) typography (ii) trust<br><br><b>A4.</b><br>(i) No other computer before it had beautiful typography.<br>(ii) You have to trust in something, don't you?<br><br><b>A5.</b> When I was younger, my grandmother taught me some basic sewing and stitching. At that time, I thought it was a useless skill. However, last month, a button came off my school shirt just before an important event. Because of the skill I had learned, I was able to quickly stitch it back on myself without any panic. It made me realize that no knowledge ever goes to waste.",
    "marks": 10
  },
  {
    "type": "long",
    "text": "<b>Language Study (Grammar)</b><br><br><b>Do as directed:</b><br><br>1. My biological mother was a young, unwed college graduate student. (Identify the adjectives)<br><br>2. She felt very strongly that I should be adopted by college graduates. (Rewrite using 'strong' as a noun)<br><br>3. This approach has never let me down. (Change the voice)<br><br>4. You can only connect them looking backward. (Use 'able to')",
    "answer": "1. The adjectives are: biological, young, unwed, college, graduate.<br><br>2. She had a very strong feeling that I should be adopted by college graduates.<br><br>3. I have never been let down by this approach.<br><br>4. You are only able to connect them looking backward.",
    "marks": 4
  },
  {
    "type": "short",
    "text": "What is the central message of Steve Jobs' first story, 'connecting the dots'?",
    "answer": "The central message is that we cannot predict how the different experiences of our present will shape our future. Seemingly random or useless events and decisions (the 'dots') can turn out to be incredibly valuable later in life. Therefore, we must trust our curiosity, intuition, and heart, and have faith that these dots will eventually connect in a meaningful way when we look back at our life's journey.",
    "marks": 2
  }
]

