[
  {
    "type": "long",
    "text": "<b>Read the following extract and answer the questions that follow.</b><br><br><i>When God at first made man,<br>Having a glass of blessings standing by;<br>“Let us,” said he, “pour on him all we can:<br>Let the world’s riches, which dispersèd lie,<br>Contract into a span.”<br><br>So strength first made a way;<br>Then beauty flowed, then wisdom, honour, pleasure.<br>When almost all was out, God made a stay,<br>Perceiving that alone of all his treasure<br>Rest in the bottom lay.</i><br><br><b>A1. Simple Factual (2 marks)</b><br>What were the blessings God poured on man?<br><br><b>A2. Complex Factual (2 marks)</b><br>Why did God 'make a stay' or pause while giving blessings?<br><br><b>A3. Poetic Device (1 mark)</b><br>Identify and explain the figure of speech in the line: 'Having a glass of blessings standing by'.",
    "answer": "<b>A1.</b> The blessings God poured on man were strength, beauty, wisdom, honour, and pleasure.<br><br><b>A2.</b> God paused while giving blessings because He perceived that only 'Rest' (contentment/peace) remained at the bottom of his glass of treasures, and He was contemplating whether to give this last blessing to man.<br><br><b>A3.</b> The figure of speech is <b>Metaphor</b>. The blessings are implicitly compared to a liquid that can be contained in a glass.",
    "marks": 5
  },
  {
    "type": "long",
    "text": "<b>Write the appreciation of the poem 'The Pulley'. You can use the following points:</b><br><ul><li>About the poem/poet and the title</li><li>The theme</li><li>Poetic style, language, poetic devices</li><li>Special features/message</li><li>Your opinion about the poem</li></ul>",
    "answer": "<b>Appreciation of the Poem</b><br><br><b>About the Poem/Poet:</b> The poem 'The Pulley' is a beautiful metaphysical poem written by the 17th-century English poet, George Herbert. The title is based on the central metaphor of a pulley, which God uses to draw mankind towards Himself.<br><br><b>Theme:</b> The central theme is the unique relationship between God and man. It explains why God withholds the blessing of 'rest' or 'contentment' from humans. God bestows all other blessings but keeps man restless so that this dissatisfaction will ultimately lead him back to God, his creator.<br><br><b>Poetic Style and Devices:</b> The poem is a short lyric of four stanzas with a consistent ABABA rhyme scheme. The language is simple yet profound. The most important poetic device is the central <b>Metaphor</b> of the 'pulley'. The poem also contains a <b>Pun</b> on the word 'Rest', which means both 'repose/peace' and 'the remainder'.<br><br><b>Special Features/Message:</b> The poem's special feature is its clever and unusual argument about the nature of divinity and human restlessness. The message is that our constant dissatisfaction and weariness are God's way of ensuring that we do not forget Him and are eventually pulled towards Him for true rest and peace.<br><br><b>My Opinion:</b> I find this poem to be very insightful and beautifully crafted. The idea that even our restlessness can be a divine gift is a unique and comforting thought. The metaphor of the pulley is very effective in explaining a complex spiritual idea.",
    "marks": 5
  },
  {
    "type": "short",
    "text": "What would happen if God had given man the gift of 'Rest'?",
    "answer": "According to the poem, if God had given man the gift of 'Rest' (contentment), man would 'adore my gifts instead of me'. He would be so satisfied with the worldly blessings (like strength, beauty, pleasure) that he would forget God, the giver of those gifts.",
    "marks": 2
  },
  {
    "type": "short",
    "text": "Explain the metaphor of the 'pulley' as used in the poem.",
    "answer": "In the poem, the 'pulley' is a metaphor for the state of restlessness and dissatisfaction that God purposefully leaves in human beings. Just as a physical pulley uses the force of weight to lift an object upwards, God uses man's weariness and constant searching for 'rest' as a force to lift his soul upwards, towards God Himself.",
    "marks": 2
  }
]

