[
  {
    "type": "long",
    "text": "<b>Read the following passage and answer the questions that follow.</b><br><br><i>My dear children of the world... Your Majesties, Your Royal Highnesses, Excellencies, distinguished members of the Norwegian Nobel Committee, dear brother Tom Harkin, brothers and sisters, and my dear daughter Malala.<br><br>From this podium of peace and humanity, I am deeply honoured to recite a mantra from the ancient texts of wisdom, Vedas. This mantra carries a prayer, an aspiration and a resolve that has the potential to liberate humanity from all man-made crises.<br><br>Let's walk together. In the pursuit of global progress, not a single person should be left out or left behind in any corner of the world, from East to West, from South to North.<br><br>Let's speak together, let our minds come together! Learning from the experiences of our ancestors, let us together create knowledge for all that benefits all.</i><br><br><b>A1. Simple Factual (2 marks)</b><br>To whom does Kailash Satyarthi address his speech?<br><br><b>A2. Complex Factual (2 marks)</b><br>What is the 'mantra' that the speaker recites from the Vedas? What is its potential?<br><br><b>A3. Vocabulary (2 marks)</b><br>Find words from the passage that mean: (i) An ambition or hope (ii) Firm decision<br><br><b>A4. Grammar (2 marks)</b><br>Do as directed:<br>(i) I am deeply honoured to recite a mantra. (Change the voice)<br>(ii) Let's walk together. (Add a question tag)<br><br><b>A5. Personal Response (2 marks)</b><br>What does the phrase 'Let's walk together' mean to you in the context of solving world problems?",
    "answer": "<b>A1.</b> Kailash Satyarthi addresses his speech to the children of the world, Majesties, Royal Highnesses, Excellencies, members of the Nobel Committee, and his brothers and sisters, including his 'dear daughter Malala'.<br><br><b>A2.</b> The mantra is 'Let's walk together'. Its potential, according to the speaker, is to liberate humanity from all man-made crises.<br><br><b>A3.</b> (i) aspiration (ii) resolve<br><br><b>A4.</b><br>(i) To recite a mantra is a deep honour for me. / A mantra is recited by me with deep honour.<br>(ii) Let's walk together, shall we?<br><br><b>A5.</b> To me, the phrase 'Let's walk together' means that we should face global problems like poverty, injustice, and illiteracy with unity and collective effort. It suggests that no single person or country can solve these issues alone. We need cooperation, compassion, and a shared responsibility to create a better world for everyone.",
    "marks": 10
  },
  {
    "type": "long",
    "text": "<b>Read the following passage and answer the questions that follow.</b><br><br><i>I refuse to accept that all the temples and mosques and churches and prayer houses have no place for the dreams of our children. I refuse to accept that the world is so poor, when just one week of global military expenditure can bring all the children to classrooms.<br><br>I refuse to accept that all the laws and constitutions, police and judges are unable to protect our children. I refuse to accept that the shackles of slavery can ever be stronger than the quest for freedom. I REFUSE TO ACCEPT.<br><br>My only aim in life is that every child is free to be a child, free to grow and develop, free to eat, sleep, and see daylight, free to laugh and cry, free to play and learn, free to go to school, and above all, free to dream.</i><br><br><b>A1. Simple Factual (2 marks)</b><br>What are the two things that the speaker refuses to accept about the world's resources and laws?<br><br><b>A2. Complex Factual (2 marks)</b><br>What is Kailash Satyarthi's only aim in life?<br><br><b>A3. Vocabulary (2 marks)</b><br>Find words from the passage that mean: (i) Money spent (ii) Chains<br><br><b>A4. Grammar (2 marks)</b><br>Do as directed:<br>(i) The world is so poor. (Make it exclamatory)<br>(ii) Every child is free to be a child. (Rewrite using an infinitive)<br><br><b>A5. Personal Response (2 marks)</b><br>The speaker says one week of military spending can bring all children to classrooms. What does this statement suggest?",
    "answer": "<b>A1.</b> The speaker refuses to accept that the world is so poor that it cannot educate its children, and he refuses to accept that all the laws and judges are unable to protect children.<br><br><b>A2.</b> Kailash Satyarthi's only aim in life is that every child should be free to be a child—free to grow, develop, eat, sleep, laugh, cry, play, learn, go to school, and dream.<br><br><b>A3.</b> (i) expenditure (ii) shackles<br><br><b>A4.</b><br>(i) How poor the world is!<br>(ii) To be a child is every child's freedom.<br><br><b>A5.</b> This statement suggests that our world's priorities are wrong. We spend enormous amounts of money on weapons and warfare, while millions of children are deprived of their basic right to education. It highlights that the problem is not a lack of resources, but a lack of will and compassion to use those resources for the welfare of humanity.",
    "marks": 10
  },
  {
    "type": "long",
    "text": "<b>Language Study (Grammar)</b><br><br><b>Do as directed:</b><br><br>1. Learning from the experiences of our ancestors, let us together create knowledge. (Identify the phrase)<br><br>2. I refuse to accept that the world is so poor. (Underline the subordinate clause)<br><br>3. This mantra carries a prayer. (Change the voice)<br><br>4. Let's speak together. (Identify the type of sentence)",
    "answer": "1. 'Learning from the experiences of our ancestors' - Participle Phrase.<br><br>2. I refuse to accept <u>that the world is so poor</u>. (Subordinate Noun Clause)<br><br>3. A prayer is carried by this mantra.<br><br>4. Imperative Sentence.",
    "marks": 4
  },
  {
    "type": "short",
    "text": "What is the central message of Kailash Satyarthi's speech 'Let's March'?",
    "answer": "The central message of the speech is a powerful call for global unity and immediate action to end all forms of child slavery and exploitation. Satyarthi urges everyone—governments, organizations, and individuals—to 'march' together from darkness to light, from exploitation to education, and from poverty to shared prosperity. He emphasizes that the lack of compassion and a fragmented world are the biggest crises, and that we must come together to ensure that every child is free to have a childhood.",
    "marks": 2
  }
]

