[
  {
    "type": "long",
    "text": "<b>Read the following passage and answer the questions that follow.</b><br><br><i>Science and spirituality are two different streams of human thought. The domain of science is the physical world, while spirituality is the realm of the spirit or the soul. Science deals with the objective reality, while spirituality is a subjective experience. While science is based on evidence and proof, spirituality is based on faith and belief.<br><br>However, many great scientists have felt that the two are not contradictory, but complementary. Albert Einstein said, “Science without religion is lame, religion without science is blind.” This suggests that both are needed for a complete human experience. Science can provide the tools for a better life, but spirituality gives meaning and purpose to that life. Science helps us understand the ‘how’ of the universe, while spirituality helps us explore the ‘why’.</i><br><br><b>A1. Simple Factual (2 marks)</b><br>According to the passage, what are the domains of science and spirituality?<br><br><b>A2. Complex Factual (2 marks)</b><br>What was Albert Einstein's view on the relationship between science and religion?<br><br><b>A3. Vocabulary (2 marks)</b><br>Find words from the passage that mean: (i) An area of knowledge or activity (ii) Supporting each other<br><br><b>A4. Grammar (2 marks)</b><br>Do as directed:<br>(i) Science is based on evidence and proof. (Use 'not only... but also')<br>(ii) Spirituality is a subjective experience. (Add a question tag)<br><br><b>A5. Personal Response (2 marks)</b><br>Do you think science and spirituality can go hand-in-hand? Why?",
    "answer": "<b>A1.</b> According to the passage, the domain of science is the physical world, while the domain of spirituality is the realm of the spirit or the soul.<br><br><b>A2.</b> Albert Einstein believed that science and religion (spirituality) are not contradictory but complementary. He famously said, “Science without religion is lame, religion without science is blind,” meaning both are necessary for a complete understanding and experience of life.<br><br><b>A3.</b> (i) domain (ii) complementary<br><br><b>A4.</b><br>(i) Science is based not only on evidence but also on proof.<br>(ii) Spirituality is a subjective experience, isn't it?<br><br><b>A5.</b> Yes, I believe science and spirituality can go hand-in-hand. Science can explain the physical laws of the universe, but it cannot answer questions about the purpose of life or morality. Spirituality can provide a moral and ethical framework to guide the use of scientific knowledge for the good of humanity, preventing its misuse.",
    "marks": 10
  },
  {
    "type": "long",
    "text": "<b>Read the following passage and answer the questions that follow.</b><br><br><i>Dr. A.P.J. Abdul Kalam, a great scientist and a deeply spiritual person, was a perfect example of this harmony. He was a pioneer of India’s space and missile programmes, but he also had a deep understanding of Indian philosophy and holy books. He often spoke about the power of prayer and the importance of having faith.<br><br>He believed that for a nation to be truly developed, it needs not just economic prosperity and technological advancement, but also a strong value system. He saw science and spirituality as two wings of a bird. Just as a bird needs two wings to fly high, humanity needs both the power of science and the values of spirituality to achieve its full potential and to create a peaceful, prosperous, and happy society. His life is a message that a person can be a top-class scientist and at the same time be deeply spiritual.</i><br><br><b>A1. Simple Factual (2 marks)</b><br>What did Dr. A.P.J. Abdul Kalam believe a nation needs to be truly developed?<br><br><b>A2. Complex Factual (2 marks)</b><br>Explain the analogy of the 'two wings of a bird' used by Dr. Kalam.<br><br><b>A3. Vocabulary (2 marks)</b><br>Find antonyms for the following from the passage: (i) failure (ii) weak<br><br><b>A4. Grammar (2 marks)</b><br>Do as directed:<br>(i) He was a great scientist and a deeply spiritual person. (Rewrite as a simple sentence)<br>(ii) His life is a message. (Identify the verb and state its tense)<br><br><b>A5. Personal Response (2 marks)</b><br>What inspires you the most about the life of Dr. A.P.J. Abdul Kalam?",
    "answer": "<b>A1.</b> Dr. Kalam believed that for a nation to be truly developed, it needs not only economic prosperity and technological advancement, but also a strong value system.<br><br><b>A2.</b> Dr. Kalam used the analogy of a bird needing two wings to fly to explain the relationship between science and spirituality. He meant that for humanity to progress and reach its highest potential, it needs both the power and knowledge provided by science, and the ethical guidance and values provided by spirituality.<br><br><b>A3.</b> (i) success (implied, not direct) (ii) strong<br><br><b>A4.</b><br>(i) Besides being a great scientist, he was a deeply spiritual person.<br>(ii) <b>Verb:</b> is; <b>Tense:</b> Simple Present Tense.<br><br><b>A5.</b> The most inspiring thing about Dr. A.P.J. Abdul Kalam's life is his incredible humility and his ability to balance scientific excellence with deep spiritual faith. He came from a very simple background and rose to become the President of India and a top scientist, yet he remained grounded and dedicated to serving the nation, especially its youth.",
    "marks": 10
  },
  {
    "type": "long",
    "text": "<b>Language Study (Grammar)</b><br><br><b>Do as directed:</b><br><br>1. He was a pioneer of India’s space and missile programmes. (Frame a 'Wh'-question to get the underlined part as the answer)<br><br>2. Science can provide the tools for a better life. (Rewrite using 'is able to')<br><br>3. They are two different streams of human thought. (Identify the adjectives)<br><br>4. He often spoke about the power of prayer. (Identify the part of speech of the underlined word)",
    "answer": "1. What was he a pioneer of?<br><br>2. Science is able to provide the tools for a better life.<br><br>3. The adjectives are: two, different, human.<br><br>4. <b>often</b> - Adverb (of frequency)",
    "marks": 4
  },
  {
    "type": "short",
    "text": "What is the central message of the lesson 'Science and Spirituality'?",
    "answer": "The central message of the lesson is that science and spirituality are not opposing forces but are, in fact, complementary and essential for the complete progress of humanity. While science provides us with the tools for material and technological advancement, spirituality provides the moral compass, values, and purpose to use that advancement wisely and ethically. The lesson suggests that a harmonious blend of both is necessary to create a truly developed, peaceful, and happy society, as exemplified by the life of Dr. A.P.J. Abdul Kalam.",
    "marks": 2
  }
]

