[
  {
    "type": "long",
    "text": "<b>Read the following passage and answer the questions that follow.</b><br><br><i>When I was a very young man, I was invited to dine at the house of a philanthropist. After a wonderful dinner, our hostess took us to a large drawing room. I was a very young singer and I was asked to sing. I was nervous. My accompanist was a young woman, and as we were about to begin, she asked me a strange question. ‘Do you know Einstein?’ she asked.<br><br>I was surprised. ‘The great scientist?’ I asked. ‘Yes’, she replied. ‘He is here. He has come to this dinner.’ I was so nervous I could barely sing. I felt my throat was dry and my voice was shaking. Still, I sang. After I had finished, a man with a shock of white hair and a pipe in his mouth came up to me.<br><br>‘You sing well,’ he said.<br><br>I was so overwhelmed with joy that I couldn’t say a thing.</i><br><br><b>A1. Simple Factual (2 marks)</b><br>Complete the following sentences:<br>(i) The narrator was invited to dine at the house of a _______.<br>(ii) The man who praised the singer had a shock of _______ hair.<br><br><b>A2. Complex Factual (2 marks)</b><br>Why was the narrator nervous before his performance?<br><br><b>A3. Vocabulary (2 marks)</b><br>Find words from the passage that mean: (i) Someone who helps a singer with music (ii) Very great or surprised<br><br><b>A4. Grammar (2 marks)</b><br>Do as directed:<br>(i) I was asked to sing. (Change the voice)<br>(ii) He has come to this dinner. (Identify the tense)<br><br><b>A5. Personal Response (2 marks)</b><br>Have you ever felt nervous before a performance? How did you overcome it?",
    "answer": "<b>A1.</b><br>(i) The narrator was invited to dine at the house of a <b>philanthropist</b>.<br>(ii) The man who praised the singer had a shock of <b>white</b> hair.<br><br><b>A2.</b> The narrator was already a young singer and felt nervous. His nervousness increased when his accompanist told him that the great scientist Albert Einstein was present at the dinner and would be listening to him sing.<br><br><b>A3.</b> (i) accompanist (ii) overwhelmed<br><br><b>A4.</b><br>(i) They/Someone asked me to sing.<br>(ii) Present Perfect Tense.<br><br><b>A5.</b> Yes, I have felt very nervous before giving a speech in my school assembly. To overcome it, I took a few deep breaths, focused on my notes, and remembered the encouraging words of my teacher. Once I started speaking, the nervousness slowly went away.",
    "marks": 10
  },
  {
    "type": "long",
    "text": "<b>Read the following passage and answer the questions that follow.</b><br><br><i>‘What kind of music do you like, Mr. Einstein?’ I asked.<br><br>‘Well,’ he answered, and his voice was gentle and friendly, ‘I like Bach.’ He then asked me if I had ever heard any Bach. I said I had not, and he asked me if I would like to.<br><br>He took me to his study, which had a gramophone. ‘What would you like to hear?’ he asked. He was a very kind and friendly man. I told him I didn’t know anything about Bach and would he please choose for me?<br><br>He smiled, and chose a record. ‘This is one of the best pieces of music ever written,’ he said. Then he sat down, and told me about the music and the composer. I listened and learned. It was a wonderful evening. I have never forgotten it. When I opened my eyes, I saw tears in Mr. Einstein’s eyes. ‘What do you feel when you hear this music, my boy?’ he asked me.</i><br><br><b>A1. Simple Factual (2 marks)</b><br>Where did Einstein take the narrator? What was present there?<br><br><b>A2. Complex Factual (2 marks)</b><br>How did Einstein introduce the narrator to the music of Bach?<br><br><b>A3. Vocabulary (2 marks)</b><br>Give the noun forms for the following words: (i) friendly (ii) choose<br><br><b>A4. Grammar (2 marks)</b><br>Do as directed:<br>(i) It was a wonderful evening. (Make it exclamatory)<br>(ii) I have never forgotten it. (Make it affirmative)<br><br><b>A5. Personal Response (2 marks)</b><br>The narrator says 'I listened and learned'. What does this tell you about his character?",
    "answer": "<b>A1.</b> Einstein took the narrator to his study. A gramophone was present there.<br><br><b>A2.</b> Einstein first chose a record he considered to be one of the best pieces of music. Then, as the music played, he sat down and explained to the narrator all about the music and its composer, Bach.<br><br><b>A3.</b> (i) friendliness / friend (ii) choice<br><br><b>A4.</b><br>(i) What a wonderful evening it was!<br>(ii) I have always remembered it.<br><br><b>A5.</b> The statement 'I listened and learned' shows that the narrator was humble, curious, and had a great respect for knowledge. He was not ashamed to admit his ignorance about Bach's music. He was open-minded and willing to learn from the great scientist, which is a very admirable quality.",
    "marks": 10
  },
  {
    "type": "long",
    "text": "<b>Language Study (Grammar)</b><br><br><b>Do as directed:</b><br><br>1. I was a very young singer. (Identify the part of speech of the underlined word)<br><br>2. She asked me a strange question. (Change the voice)<br><br>3. When I opened my eyes, I saw tears. (Rewrite as a simple sentence)<br><br>4. He was a very kind and friendly man. (Use 'as well as')",
    "answer": "1. <b>very</b> - Adverb (of degree)<br><br>2. A strange question was asked to me by her. / I was asked a strange question by her.<br><br>3. On opening my eyes, I saw tears.<br><br>4. He was a very kind as well as a friendly man.",
    "marks": 4
  },
  {
    "type": "short",
    "text": "What was Einstein's advice to the young singer about solving problems?",
    "answer": "Einstein advised the young singer that when he found himself stuck on a difficult problem, he should listen to music. He explained that music, especially Bach, helps in opening up the mind and thinking in new ways. He believed that this 'opening up' of the mind through music was the key to solving problems in all fields, including science.",
    "marks": 2
  }
]

