[
  {
    "type": "long",
    "text": "<b>Read the following passage and answer the questions that follow.</b><br><br><i>Stephen Hawking was one of the greatest scientists of our time. He was born in Oxford, England on January 8, 1942. At the age of 17, he began his university education at University College, Oxford. Hawking wanted to study mathematics, but as it was not available at University College, he pursued physics instead.<br><br>At the age of 21, just before his marriage, Hawking was diagnosed with a rare disease - amyotrophic lateral sclerosis (ALS). Doctors gave him a life expectancy of only two years. It was a devastating blow for the brilliant young man. Despite the prognosis, Hawking did not give up. He decided to continue his research and married his sweetheart, Jane Wilde. He said that Jane’s engagement gave him ‘something to live for’.</i><br><br><b>A1. Simple Factual (2 marks)</b><br>Complete the following sentences:<br>(i) Stephen Hawking was born in _______.<br>(ii) At the age of 21, he was diagnosed with _______.<br><br><b>A2. Complex Factual (2 marks)</b><br>What was the devastating news Hawking received at the age of 21?<br><br><b>A3. Vocabulary (2 marks)</b><br>Find words from the passage that mean: (i) Forecast of a disease (ii) destructive<br><br><b>A4. Grammar (2 marks)</b><br>Do as directed:<br>(i) He wanted to study mathematics. (Rewrite using the gerund form of the underlined word)<br>(ii) Doctors gave him a life expectancy of only two years. (Change the voice)<br><br><b>A5. Personal Response (2 marks)</b><br>What does Hawking's decision to continue his research after his diagnosis tell you about his character?",
    "answer": "<b>A1.</b><br>(i) Stephen Hawking was born in <b>Oxford, England</b>.<br>(ii) At the age of 21, he was diagnosed with <b>amyotrophic lateral sclerosis (ALS)</b>.<br><br><b>A2.</b> At the age of 21, Hawking received the devastating news that he was suffering from a rare disease called ALS and that doctors had given him a life expectancy of only two years.<br><br><b>A3.</b> (i) prognosis (ii) devastating<br><br><b>A4.</b><br>(i) His want was studying mathematics.<br>(ii) A life expectancy of only two years was given to him by the doctors.<br><br><b>A5.</b> Hawking's decision to continue his research shows his incredible courage, determination, and optimism. Despite receiving such a grim prognosis, he did not surrender to despair. It shows his immense love for science and his will to make the most of the time he had. His character is a true example of the triumph of the human spirit over adversity.",
    "marks": 10
  },
  {
    "type": "long",
    "text": "<b>Read the following passage and answer the questions that follow.</b><br><br><i>Though he was confined to a wheelchair and dependent on a computerised voice system for communication, Hawking continued his groundbreaking research. He is best known for his work on black holes and the origins of the universe. His book, ‘A Brief History of Time’, became an international bestseller and made complex scientific ideas accessible to the common person.<br><br>Hawking believed that people with disabilities should concentrate on what they are good at and not regret the things that their illness prevents them from doing. He was a great example of his own advice. Despite his physical limitations, his mind was free to roam the universe. He was an inspiration to millions, not just for his scientific genius but for his indomitable spirit. He proved that no matter how difficult life may seem, there is always something you can do and succeed at.</i><br><br><b>A1. Simple Factual (2 marks)</b><br>What is the title of the famous book written by Stephen Hawking?<br><br><b>A2. Complex Factual (2 marks)</b><br>What was Hawking's advice to people with disabilities?<br><br><b>A3. Vocabulary (2 marks)</b><br>Find words from the passage which mean: (i) Unable to be defeated (ii) Available to everyone<br><br><b>A4. Grammar (2 marks)</b><br>Do as directed:<br>(i) He was an inspiration to millions. (Frame a 'Wh'-question to get the underlined part as the answer)<br>(ii) He was confined to a wheelchair. (Rewrite using 'not only... but also')<br><br><b>A5. Personal Response (2 marks)</b><br>What is the most important lesson you learn from the life of Stephen Hawking?",
    "answer": "<b>A1.</b> The title of the famous book written by Stephen Hawking is ‘A Brief History of Time’.<br><br><b>A2.</b> Hawking's advice to people with disabilities was that they should focus on what they are good at and can do, rather than regretting the things they are prevented from doing because of their illness.<br><br><b>A3.</b> (i) indomitable (ii) accessible<br><br><b>A4.</b><br>(i) To whom was he an inspiration?<br>(ii) He was not only confined to a wheelchair but also dependent on a computerised voice system.<br><br><b>A5.</b> The most important lesson I learn from the life of Stephen Hawking is that physical limitations cannot confine the power of the human mind and spirit. He taught us that no matter what challenges life throws at us, we should never give up on our dreams and should always focus on what we can achieve.",
    "marks": 10
  },
  {
    "type": "long",
    "text": "<b>Language Study (Grammar)</b><br><br><b>Do as directed:</b><br><br>1. He was one of the greatest scientists of our time. (Change to positive and comparative degrees)<br><br>2. His mind was free to roam the universe. (Rewrite using the infinitive)<br><br>3. Hawking continued his groundbreaking research. (Identify the part of speech of the underlined word)<br><br>4. No matter how difficult life may seem, there is always something you can do. (Identify the main and subordinate clause)",
    "answer": "1. <b>Positive:</b> Very few scientists of our time were as great as he was.<br><b>Comparative:</b> He was greater than most other scientists of our time.<br><br>2. To roam the universe was the freedom his mind had.<br><br>3. <b>groundbreaking</b> - Adjective<br><br>4. <b>Main Clause:</b> there is always something you can do.<br><b>Subordinate Clause:</b> No matter how difficult life may seem.",
    "marks": 4
  },
  {
    "type": "short",
    "text": "Write a short summary of Stephen Hawking's legacy.",
    "answer": "Stephen Hawking's legacy is twofold. Scientifically, he revolutionized our understanding of the universe with his groundbreaking work on black holes and cosmology, making complex subjects accessible to the public through his book 'A Brief History of Time'. Personally, he became a global icon of courage and human potential. Despite being almost completely paralyzed by ALS, his indomitable spirit and brilliant mind continued to explore the cosmos. He proved to the world that physical disabilities cannot limit human achievement, and his life remains an enduring inspiration for millions.",
    "marks": 2
  }
]

