[
  {
    "type": "long",
    "text": "<b>Read the following extract and answer the questions that follow.</b><br><br><i>If you want a thing bad enough<br>To go out and fight for it,<br>Work day and night for it,<br>Give up your time and your peace and your sleep for it<br>If all that you dream and scheme is about it,<br>and life seems useless and empty without it<br>And if you gladly sweat for it<br>And fret for it and plan for it<br>And lose all your terror of the opposition for it...</i><br><br><b>A1. Simple Factual (2 marks)</b><br>According to the poet, what are the four things one must do to get what one wants?<br><br><b>A2. Complex Factual (2 marks)</b><br>What does the poet mean by the line, 'life seems useless and empty without it'?<br><br><b>A3. Poetic Device (1 mark)</b><br>Identify and explain the figure of speech in the line: 'And fret for it and plan for it'.",
    "answer": "<b>A1.</b> According to the poet, to get what one wants, one must:<br>1. Go out and fight for it.<br>2. Work day and night for it.<br>3. Give up time, peace, and sleep for it.<br>4. Gladly sweat, fret, and plan for it.<br><br><b>A2.</b> This line means that the desire for the goal is so intense and all-consuming that it becomes the central purpose of one's life. Without the pursuit of that goal, life itself feels meaningless and without any value.<br><br><b>A3.</b> The figure of speech is <b>Repetition</b>. The words 'for it' are repeated at the end of the lines to create a rhythmic effect and to emphasize the singular focus on the goal.",
    "marks": 5
  },
  {
    "type": "long",
    "text": "<b>Write the appreciation of the poem 'The Will to Win'. You can use the following points:</b><br><ul><li>About the poem/poet and the title</li><li>The theme</li><li>Poetic style, language, poetic devices</li><li>Special features/message</li><li>Your opinion about the poem</li></ul>",
    "answer": "<b>Appreciation of the Poem</b><br><br><b>About the Poem/Poet:</b> The poem 'The Will to Win' is a highly motivational poem written by the American poet Berton Braley. The title itself clearly states the central idea of the poem, which is the importance of having a strong determination to succeed.<br><br><b>Theme:</b> The central theme of the poem is that an unwavering will, backed by relentless hard work and dedication, is the key to achieving any goal in life. The poet emphasizes that mere desire is not enough; it must be coupled with a fierce determination to overcome all obstacles.<br><br><b>Poetic Style and Devices:</b> The poem is written in a simple and direct style, using free verse. The language is forceful and easy to understand. The most prominent poetic device used is <b>Repetition</b> (e.g., 'for it'), which creates a powerful, chant-like rhythm and reinforces the message of single-minded focus. The poet also uses <b>Alliteration</b> (e.g., 'poverty, grim, gaunt').<br><br><b>Special Features/Message:</b> The poem's special feature is its list-like structure, where the poet enumerates all the sacrifices and efforts required for success. The powerful and inspiring message is that if you have an unbreakable 'will to win', nothing can stop you from achieving your dream.<br><br><b>My Opinion:</b> I think this is a very powerful and inspiring poem. It serves as a great reminder that success does not come easily but requires immense hard work, sacrifice, and a never-say-die attitude. It can motivate anyone who is feeling discouraged.",
    "marks": 5
  },
  {
    "type": "short",
    "text": "What are the obstacles one must be willing to face to achieve a goal, according to the poem?",
    "answer": "According to the poem, one must be willing to face several obstacles:<br>1. <b>Physical Hardship:</b> One must be ready to face poverty, hunger, and physical pain ('sore and grim').<br>2. <b>Mental Hardship:</b> One must give up peace and sleep, and be ready to face failure without getting disheartened.<br>3. <b>Opposition:</b> One must lose all fear of the opposition and be ready to fight for the goal.",
    "marks": 2
  },
  {
    "type": "short",
    "text": "What role does self-confidence play in achieving success, as suggested in the poem?",
    "answer": "The poem suggests that self-confidence is a crucial element for achieving success. The entire poem is built on the idea that if you have the inner belief and the 'will to win', you can overcome any external obstacle. The poet implies that all the hard work and sacrifice will only be effective if it is backed by a strong and unwavering belief in oneself and one's ability to achieve the goal.",
    "marks": 2
  }
]

