[
  {
    "type": "long",
    "text": "<b>Read the following passage and answer the questions that follow.</b><br><br><i>There was an urge in me to do something different, something unique. Boxing was a very unlikely sport for women in India, and that is what I chose. I was drawn to boxing because of my inspiration, Dingko Singh, an Indian boxer who won a gold medal at the Asian Games in 1998. He was a local hero and I wanted to be like him.<br><br>My father was a keen wrestler in his younger age. He was concerned about my choice of sport. He worried about what people would say. The biggest problem, however, was financial. I came from a poor family and I needed a lot of money for my diet, equipment, and travel. But I was determined. I told my father that if I was not allowed to pursue boxing, I would not marry. That finally convinced him to support me.</i><br><br><b>A1. Simple Factual (2 marks)</b><br>Complete the following sentences:<br>(i) Mary Kom was inspired by the boxer _______.<br>(ii) The biggest problem Mary Kom faced was _______.<br><br><b>A2. Complex Factual (2 marks)</b><br>Why was Mary Kom's father initially concerned about her choice of sport?<br><br><b>A3. Vocabulary (2 marks)</b><br>Find words from the passage which mean: (i) Eager and enthusiastic (ii) To follow or chase something<br><br><b>A4. Grammar (2 marks)</b><br>Do as directed:<br>(i) He was concerned about my choice of sport. (Frame a 'Wh'-question to get the underlined part as the answer)<br>(ii) I came from a poor family. (Identify the tense)<br><br><b>A5. Personal Response (2 marks)</b><br>Mary Kom chose an 'unlikely sport for women'. Do you think there should be such distinctions in sports?",
    "answer": "<b>A1.</b><br>(i) Mary Kom was inspired by the boxer <b>Dingko Singh</b>.<br>(ii) The biggest problem Mary Kom faced was <b>financial</b>.<br><br><b>A2.</b> Mary Kom's father was initially concerned because boxing was not considered a suitable sport for women in India. He was a wrestler himself but worried about what society would say about his daughter choosing such a profession.<br><br><b>A3.</b> (i) keen (ii) pursue<br><br><b>A4.</b><br>(i) What was he concerned about?<br>(ii) Simple Past Tense.<br><br><b>A5.</b> No, I do not think there should be any distinction in sports based on gender. Sports are about skill, strength, and determination, which are qualities that both men and women possess. Everyone should have the freedom to choose and excel in any sport they are passionate about, without facing any stereotypes or restrictions.",
    "marks": 10
  },
  {
    "type": "long",
    "text": "<b>Read the following passage and answer the questions that follow.</b><br><br><i>I am a mother of three boys. After my marriage, my priority was my family. After winning the World Championship twice, I took a break from boxing. Many people thought my career was over. But I was determined to make a comeback.<br><br>My husband was my biggest support. He took care of the children and the house, which allowed me to train. It was very difficult to get my body back into shape after childbirth. But I trained hard and my hard work paid off. I won a gold medal at the Asian Games and a bronze medal at the London Olympics.<br><br>People call me ‘Super Mom’. I feel that if I can do it, any woman can do it. The key is to have the support of your family and an unbreakable will to succeed. I am happy that I have been able to create a name for myself and for my country.</i><br><br><b>A1. True or False (2 marks)</b><br>(i) Mary Kom took a break from boxing before her marriage.<br>(ii) Mary Kom won a silver medal at the London Olympics.<br><br><b>A2. Complex Factual (2 marks)</b><br>What were the two main challenges Mary Kom faced while making her comeback?<br><br><b>A3. Vocabulary (2 marks)</b><br>Give the verb forms for the following words: (i) support (ii) success<br><br><b>A4. Grammar (2 marks)</b><br>Do as directed:<br>(i) My husband was my biggest support. (Change to positive and comparative degrees)<br>(ii) My hard work paid off. (Add a question tag)<br><br><b>A5. Personal Response (2 marks)</b><br>What, according to you, is the importance of family support in achieving one's goals?",
    "answer": "<b>A1.</b><br>(i) False<br>(ii) False<br><br><b>A2.</b> The two main challenges Mary Kom faced were:<br>1. Managing her family responsibilities as a mother of three boys.<br>2. The physical difficulty of getting her body back into competitive shape after childbirth.<br><br><b>A3.</b> (i) support (ii) succeed<br><br><b>A4.</b><br>(i) <b>Positive:</b> No other support of mine was as big as my husband. <b>Comparative:</b> My husband was bigger support than any other support of mine.<br>(ii) My hard work paid off, didn't it?<br><br><b>A5.</b> Family support is extremely important for achieving one's goals. When we have the emotional and practical support of our family, it gives us the confidence and strength to face challenges. As seen in Mary Kom's life, her husband's support in taking care of the children was crucial for her to be able to train and make a successful comeback.",
    "marks": 10
  },
  {
    "type": "long",
    "text": "<b>Language Study (Grammar)</b><br><br><b>Do as directed:</b><br><br>1. He was a keen wrestler in his younger age. (Identify the adjectives)<br><br>2. I have been able to create a name for myself. (Rewrite using 'can')<br><br>3. I won a gold medal at the Asian Games. (Change the voice)<br><br>4. Many people thought my career was over. (Underline the subordinate clause)",
    "answer": "1. The adjectives are: keen, younger.<br><br>2. I can create a name for myself.<br><br>3. A gold medal was won by me at the Asian Games.<br><br>4. Many people thought <u>that my career was over</u>. (Subordinate Noun Clause)",
    "marks": 4
  },
  {
    "type": "short",
    "text": "Explain why Mary Kom is called an 'Unbeatable Super Mom'.",
    "answer": "Mary Kom is called an 'Unbeatable Super Mom' because she has successfully managed the dual responsibilities of being a world-class athlete and a mother. She took a break from her glorious boxing career to start a family, a point where many people thought her career would end. However, with immense determination and family support, she made a powerful comeback, winning major international medals like an Olympic bronze. Her ability to excel in the demanding sport of boxing while also being a dedicated mother to her three sons makes her a true inspiration and a 'Super Mom'.",
    "marks": 2
  }
]

