[
  {
    "type": "long",
    "text": "<b>Read the following passage and answer the questions that follow.</b><br><br><i>A small crowd had gathered in the park to hear them. Then a boy of about sixteen, who was suffering from cancer, had his lifelong wish. He wanted to hear and see Pandit Ravi Shankar play. When his sister, Smita, read the news, she told him, but he was very ill and was not in a condition to go to the concert. Smita felt very bad, but she could not leave her brother alone.<br><br>Their family had come to Bombay from their native town Gaganpur with great hopes in the miracles of modern science. They were told that the boy could be cured. They had been in Bombay for four months with their Aunt Sushila. Smita and her brother had been to the concert the previous year. He was then healthy and had been learning to play the sitar.</i><br><br><b>A1. Simple Factual (2 marks)</b><br>Complete the following sentences:<br>(i) The boy was suffering from _______.<br>(ii) The family had come to Bombay from _______.<br><br><b>A2. Complex Factual (2 marks)</b><br>Why had the family come to Bombay with great hopes?<br><br><b>A3. Vocabulary (2 marks)</b><br>Find words from the passage that mean: (i) Wonderful or amazing events (ii) Native<br><br><b>A4. Grammar (2 marks)</b><br>Do as directed:<br>(i) He was suffering from cancer. (Identify the tense)<br>(ii) Smita felt very bad. (Make it exclamatory)<br><br><b>A5. Personal Response (2 marks)</b><br>What does Smita's decision not to go to the concert tell you about her?",
    "answer": "<b>A1.</b><br>(i) The boy was suffering from <b>cancer</b>.<br>(ii) The family had come to Bombay from <b>their native town Gaganpur</b>.<br><br><b>A2.</b> The family had come to Bombay with great hopes because they believed in the miracles of modern science and were told that the boy could be cured of his cancer there.<br><br><b>A3.</b> (i) miracles (ii) native<br><br><b>A4.</b><br>(i) Past Continuous Tense.<br>(ii) How bad Smita felt!<br><br><b>A5.</b> Smita's decision not to go to the concert, even though she wanted to, shows that she was a very loving and responsible sister. Her brother's well-being was her top priority. It shows her selflessness and the deep bond she shared with her brother, Anant.",
    "marks": 10
  },
  {
    "type": "long",
    "text": "<b>Read the following passage and answer the questions that follow.</b><br><br><i>She went up the steps that led to the wings, her heart beating loudly. In the wings a small crowd had gathered to talk about the evening concert, to help carry bouquets and tea. She worked her way through the crowd till she came to the man with the long moustache. She went up and stood before them, her hands folded. ‘Oh, sir,’ she burst out.<br><br>‘Yes?’ he asked.<br><br>‘My brother is very ill. He is suffering from cancer and he longs to hear you and the ustad play.’<br><br>The great maestro Ustad Allah Rakha’s mouth opened in a big yawn. ‘Panditji is a busy man. You must not bother him with such requests,’ he said.<br><br>But Pandit Ravi Shankar smiled and said to him, ‘What is the matter? It is not a bother. I will surely help you.’</i><br><br><b>A1. Simple Factual (2 marks)</b><br>What was the scene in the wings after the concert?<br><br><b>A2. Complex Factual (2 marks)</b><br>Compare the reactions of Ustad Allah Rakha and Pandit Ravi Shankar to Smita's request.<br><br><b>A3. Vocabulary (2 marks)</b><br>Give the adjective forms for the following words: (i) talk (ii) help<br><br><b>A4. Grammar (2 marks)</b><br>Do as directed:<br>(i) Her heart was beating loudly. (Frame a 'Wh'-question to get the underlined part as the answer)<br>(ii) You must not bother him with such requests. (Rewrite using 'should')<br><br><b>A5. Personal Response (2 marks)</b><br>If you were Pandit Ravi Shankar, what would you have done?",
    "answer": "<b>A1.</b> In the wings, a small crowd had gathered. They were talking about the evening concert and helping to carry bouquets and tea.<br><br><b>A2.</b> Ustad Allah Rakha was dismissive of Smita's request. He yawned and told her that Panditji was a busy man and should not be bothered. In contrast, Pandit Ravi Shankar was kind and compassionate. He smiled, reassured her that it was not a bother, and immediately agreed to help.<br><br><b>A3.</b> (i) talkative (ii) helpful<br><br><b>A4.</b><br>(i) How was her heart beating?<br>(ii) You should not bother him with such requests.<br><br><b>A5.</b> If I were Pandit Ravi Shankar, I would have been deeply moved by Smita's love for her brother. I would have done exactly what he did. Fulfilling the wish of a dying boy is a far greater achievement than any award. I would have felt privileged to use my talent to bring some joy to him in his final days.",
    "marks": 10
  },
  {
    "type": "long",
    "text": "<b>Language Study (Grammar)</b><br><br><b>Do as directed:</b><br><br>1. He was then healthy. (Identify the part of speech of the underlined word)<br><br>2. She told him the news. (Change the voice)<br><br>3. As soon as she reached the man, she stood before them. (Rewrite using 'No sooner... than')<br><br>4. Panditji is a busy man. (Identify the articles)",
    "answer": "1. <b>healthy</b> - Adjective<br><br>2. The news was told to him by her. / He was told the news by her.<br><br>3. No sooner did she reach the man than she stood before them.<br><br>4. <b>a</b> - indefinite article",
    "marks": 4
  },
  {
    "type": "short",
    "text": "Explain the significance of the title, 'The Concert'.",
    "answer": "The title 'The Concert' is highly significant. On one level, it refers to the public concert by Pandit Ravi Shankar which Anant is unable to attend. On a deeper level, it refers to the private, exclusive 'concert' that the great musicians perform at Anant's home. This private concert is an extraordinary act of kindness and compassion. It fulfills the dying boy's last wish and becomes a concert of humanity, proving that art and empathy can create miracles. Thus, the title represents both the musical event and the profound human event that lies at the heart of the story.",
    "marks": 2
  }
]

