[
  {
    "type": "long",
    "text": "<b>Read the following passage and answer the questions that follow.</b><br><br><i>I caught sight of her at the play and in answer to her beckoning, I went over during the interval and sat down beside her. It was long since I had last seen her and if someone had not mentioned her name I hardly think I would have recognised her. She addressed me brightly.<br><br>‘Well,’ she said, ‘it’s many years since we first met. How time does fly! We’re none of us getting any younger. Do you remember the first time I saw you? You asked me to luncheon.’<br><br>Did I remember?<br><br>It was twenty years ago and I was living in Paris. I had a tiny apartment and I was earning barely enough money to keep body and soul together. She had read a book of mine and had written to me about it. I answered, thanking her, and presently I received from her another letter saying that she was passing through Paris and would like to have a chat with me.</i><br><br><b>A1. Simple Factual (2 marks)</b><br>Complete the following sentences:<br>(i) The narrator was living in _______ twenty years ago.<br>(ii) The woman had written a letter to the narrator after reading his _______.<br><br><b>A2. Complex Factual (2 marks)</b><br>Why does the narrator say he would have hardly recognised the woman?<br><br><b>A3. Vocabulary (2 marks)</b><br>Find words from the passage that mean: (i) Signalling with a hand gesture (ii) Only just; scarcely<br><br><b>A4. Grammar (2 marks)</b><br>Do as directed:<br>(i) She addressed me brightly. (Frame a 'Wh'-question to get the underlined part as the answer)<br>(ii) It was twenty years ago. (Make it exclamatory)<br><br><b>A5. Personal Response (2 marks)</b><br>Have you ever been in a situation where you had to spend more money than you could afford? What did you do?",
    "answer": "<b>A1.</b><br>(i) The narrator was living in <b>Paris</b> twenty years ago.<br>(ii) The woman had written a letter to the narrator after reading his <b>book</b>.<br><br><b>A2.</b> The narrator says he would have hardly recognised the woman because it had been a very long time (twenty years) since they had last met, and her appearance must have changed significantly over the years.<br><br><b>A3.</b> (i) beckoning (ii) barely<br><br><b>A4.</b><br>(i) How did she address me?<br>(ii) How long ago it was!<br><br><b>A5.</b> Yes, once I went to a fair with my friends and got tempted to buy a video game that was very expensive. I realized I didn't have enough money. Instead of borrowing from friends, I decided not to buy it and save my pocket money for a few months. It taught me the importance of budgeting and controlling my impulses.",
    "marks": 10
  },
  {
    "type": "long",
    "text": "<b>Read the following passage and answer the questions that follow.</b><br><br><i>‘I never eat anything for luncheon,’ she said.<br>‘Oh, don’t say that!’ I answered generously.<br>‘I never eat more than one thing. I think people eat far too much nowadays. A little fish, perhaps. I wonder if they have any salmon.’<br><br>Well, it was early in the year for salmon and it was not on the bill of fare, but I asked the waiter if there was any. Yes, a beautiful salmon had just come in, it was the first they had had. I ordered it for my guest. The waiter asked her if she would have something while it was being cooked.<br><br>‘No,’ she answered, ‘I never eat more than one thing. Unless you have a little caviare. I never mind caviare.’<br><br>My heart sank a little. I knew I could not afford caviare, but I could not very well tell her that.</i><br><br><b>A1. Simple Factual (2 marks)</b><br>What did the woman say she never eats for luncheon?<br><br><b>A2. Complex Factual (2 marks)</b><br>Why did the narrator's heart sink a little?<br><br><b>A3. Vocabulary (2 marks)</b><br>Find words from the passage that mean: (i) In a giving or kind way (ii) A menu<br><br><b>A4. Grammar (2 marks)</b><br>Do as directed:<br>(i) I could not afford caviare. (Rewrite using 'unable to')<br>(ii) A beautiful salmon had just come in. (Identify the tense)<br><br><b>A5. Personal Response (2 marks)</b><br>The woman said, 'I never eat more than one thing,' but then ordered expensive items. What does this tell you about her character?",
    "answer": "<b>A1.</b> The woman said that she never eats anything for luncheon, and never more than one thing.<br><br><b>A2.</b> The narrator's heart sank a little because the woman asked for caviare, which is a very expensive dish, and he knew that he could not afford it.<br><br><b>A3.</b> (i) generously (ii) bill of fare<br><br><b>A4.</b><br>(i) I was unable to afford caviare.<br>(ii) Past Perfect Tense.<br><br><b>A5.</b> This shows that the woman was hypocritical and inconsiderate. She pretended to be a person of modest appetite by saying she eats only one thing, but her actions showed that she was greedy and had a taste for the most expensive food, without any concern for her host's financial situation.",
    "marks": 10
  },
  {
    "type": "long",
    "text": "<b>Language Study (Grammar)</b><br><br><b>Do as directed:</b><br><br>1. It was long since I had last seen her. (Rewrite as a negative sentence)<br><br>2. She had read a book of mine. (Change the voice)<br><br>3. I received another letter from her. (Identify the part of speech of the underlined word)<br><br>4. How time does fly! (Rewrite as an assertive sentence)",
    "answer": "1. It was not a short time since I had last seen her.<br><br>2. A book of mine had been read by her.<br><br>3. <b>another</b> - Adjective (of number/quantity)<br><br>4. Time flies very fast.",
    "marks": 4
  },
  {
    "type": "short",
    "text": "What is the 'revenge' the narrator finally gets in the end?",
    "answer": "The narrator's 'revenge' is a form of ironic justice that he observes twenty years later. The woman, who had eaten a very expensive and heavy lunch at his expense while claiming she ate very little, is now extremely overweight. When he meets her again, she weighs twenty-one stone (133 kg). The narrator feels that he has finally had his revenge, not by any action of his own, but through the natural consequences of her own greed and habits.",
    "marks": 2
  }
]

