[
  {
    "type": "long",
    "text": "<b>Read the following extract and answer the questions that follow.</b><br><br><i>I wrote some lines once on a time<br>In wondrous merry mood,<br>And thought, as usual, men would say<br>They were exceeding good.<br><br>They were so queer, so very queer,<br>I laughed as I would die;<br>Albeit, in the general way,<br>A sober man am I.<br><br>I called my servant, and he came;<br>How kind it was of him<br>To mind a slender man like me,<br>He of the mighty limb.</i><br><br><b>A1. Simple Factual (2 marks)</b><br>Complete the following sentences:<br>(i) The poet wrote some lines when he was in a _______ mood.<br>(ii) The poet describes himself as a _______ man.<br><br><b>A2. Complex Factual (2 marks)</b><br>What was the poet's initial thought about the lines he had written? Why did he laugh?<br><br><b>A3. Poetic Device (1 mark)</b><br>Identify and explain the rhyme scheme of the first stanza.",
    "answer": "<b>A1.</b><br>(i) The poet wrote some lines when he was in a <b>wondrous merry</b> mood.<br>(ii) The poet describes himself as a <b>sober</b> man.<br><br><b>A2.</b> The poet's initial thought was that people would, as usual, say that his lines were exceedingly good. He laughed because he himself found the lines to be extremely strange and funny ('so queer, so very queer').<br><br><b>A3.</b> The rhyme scheme of the first stanza is <b>ABAB</b>. The word 'time' in the first line rhymes with 'rhyme' (implied, but 'time' stands alone), however, looking at the pattern, 'time' and 'say' don't rhyme, but 'mood' and 'good' do. The actual scheme is ABCB. 'time' (A), 'mood' (B), 'say' (C), 'good' (B).",
    "marks": 5
  },
  {
    "type": "long",
    "text": "<b>Write the appreciation of the poem 'The Height of the Ridiculous'. You can use the following points:</b><br><ul><li>About the poem/poet and the title</li><li>The theme</li><li>Poetic style, language, poetic devices</li><li>Special features/message</li><li>Your opinion about the poem</li></ul>",
    "answer": "<b>Appreciation of the Poem</b><br><br><b>About the Poem/Poet:</b> 'The Height of the Ridiculous' is a humorous poem written by the American poet Oliver Wendell Holmes. The title itself suggests that the poem is about something that is extremely absurd or funny.<br><br><b>Theme:</b> The central theme of the poem is the overwhelming power of humour. The poet describes a situation where a poem he writes is so funny that it causes an extreme, almost fatal, physical reaction in the person who reads it, highlighting the physical effects of uncontrollable laughter.<br><br><b>Poetic Style and Devices:</b> The poem is a narrative ballad, written in short, four-line stanzas (quatrains) with a simple ABCB rhyme scheme. The language is light and humorous. The main poetic device is <b>Hyperbole</b> (exaggeration), which is used throughout the poem to describe the servant's reaction (e.g., 'A dreadful grin,/ That spread from ear to ear'). The poet also uses <b>Alliteration</b> (e.g., 'merry mood').<br><br><b>Special Features/Message:</b> The poem's special feature is its comical and exaggerated storytelling, which creates a very light-hearted and entertaining tone. The underlying message is a warning about the unintended consequences of one's creative work. The poet humorously resolves never to be as funny as he can be, for the sake of public safety.<br><br><b>My Opinion:</b> I think this is a very funny and enjoyable poem. The idea of a poem being so humorous that it causes physical harm is brilliantly absurd. It's a creative way to explore the power of laughter.",
    "marks": 5
  },
  {
    "type": "short",
    "text": "Describe the effect of the funny poem on the poet's servant.",
    "answer": "The poem had a dramatic and comical effect on the servant. As he started reading, a grin appeared on his face, which spread from ear to ear. He let out a roar of laughter, and then a loud chuckle. His laughter became so intense that his waistcoat buttons burst off, and the strap of his pants broke. He laughed uncontrollably for ten days and nights, and by the end of it, he was reduced to a wreck, becoming extremely thin.",
    "marks": 2
  },
  {
    "type": "short",
    "text": "What resolution does the poet make at the end of the poem and why?",
    "answer": "At the end of the poem, the poet makes a resolution that from that day on, he will never write such a funny poem again. He makes this decision because he does not want to be responsible for the kind of extreme and harmful reaction his servant experienced. He decides to be sad and serious in his writing to avoid any further comical disasters.",
    "marks": 2
  }
]

