[
  {
    "type": "long",
    "text": "<b>Read the following passage and answer the questions that follow.</b><br><br><i>He was an old man who fished alone in a skiff in the Gulf Stream and he had gone eighty-four days now without taking a fish. In the first forty days a boy had been with him. But after forty days without a fish the boy’s parents had told him that the old man was now definitely and finally ‘salao’, which is the worst form of unlucky, and the boy had gone at their orders in another boat which caught three good fish the first week.<br><br>The boy was sad to see the old man come in each day with his skiff empty and he always went down to help him carry either the coiled lines or the gaff and harpoon and the sail that was furled around the mast. The sail was patched with flour sacks and, furled, it looked like the flag of permanent defeat.</i><br><br><b>A1. Simple Factual (2 marks)</b><br>Complete the following sentences:<br>(i) The old man had gone _______ days without catching a fish.<br>(ii) The boy's parents called the old man _______, which means unlucky.<br><br><b>A2. Complex Factual (2 marks)</b><br>Why did the boy, Manolin, stop fishing with the old man, Santiago?<br><br><b>A3. Vocabulary (2 marks)</b><br>Find words from the passage which mean: (i) A small boat (ii) Rolled and tied up<br><br><b>A4. Grammar (2 marks)</b><br>Do as directed:<br>(i) The boy was sad. (Make it exclamatory)<br>(ii) He had gone eighty-four days now without taking a fish. (Identify the tense)<br><br><b>A5. Personal Response (2 marks)</b><br>The boy helped the old man even though he wasn't fishing with him. What does this tell you about their relationship?",
    "answer": "<b>A1.</b><br>(i) The old man had gone <b>eighty-four</b> days without catching a fish.<br>(ii) The boy's parents called the old man <b>salao</b>, which means unlucky.<br><br><b>A2.</b> The boy stopped fishing with the old man because after forty days of catching no fish, the boy's parents told him that the old man was 'salao' (the worst form of unlucky) and ordered him to go in another, more successful boat.<br><br><b>A3.</b> (i) skiff (ii) furled<br><br><b>A4.</b><br>(i) How sad the boy was!<br>(ii) Past Perfect Tense.<br><br><b>A5.</b> This shows that their relationship was based on deep affection and respect, not just work. The boy, Manolin, truly cared for the old man, Santiago. He looked up to him as a mentor and friend, and his loyalty and love for Santiago did not diminish even when he was forced to fish in another boat.",
    "marks": 10
  },
  {
    "type": "long",
    "text": "<b>Read the following passage and answer the questions that follow.</b><br><br><i>He was a very big fish, silver and fresh and his sides were dark purple and in the sun the stripes on his sides showed wide and a light lavender. The old man dropped his lines and put his foot on the line that held the great fish. He had been pulled down tight on his bow and his face was in the cut slice of dolphin and he could not move.<br><br>“I wish the boy was here,” he said aloud.<br><br>He was fast to a very big fish and he could not see him. The fish was pulling the skiff steadily. The old man knew that the fish was not frightened. The old man could not raise the fish. It was the fish that was towing the boat.<br><br>“He has his plan and I have mine,” he said. He was a great fish and he must be worth a lot of money, he thought. But he did not think of the money. He thought of him with resolution and high dignity.</i><br><br><b>A1. Simple Factual (2 marks)</b><br>Describe the appearance of the great fish.<br><br><b>A2. Complex Factual (2 marks)</b><br>Why did the old man wish for the boy to be with him?<br><br><b>A3. Vocabulary (2 marks)</b><br>Find words from the passage that mean: (i) Constantly or without stopping (ii) A firm decision to do something<br><br><b>A4. Grammar (2 marks)</b><br>Do as directed:<br>(i) He was a great fish. (Add a question tag)<br>(ii) The fish was pulling the skiff steadily. (Change the voice)<br><br><b>A5. Personal Response (2 marks)</b><br>The old man respected the fish he was trying to catch. What does this show about him?",
    "answer": "<b>A1.</b> The fish was very big and silver. Its sides were dark purple with wide, light lavender stripes that showed in the sun.<br><br><b>A2.</b> The old man wished for the boy to be with him because he was alone and tied to a very large and powerful fish that was pulling his boat. He needed help and also missed the boy's companionship during this immense struggle.<br><br><b>A3.</b> (i) steadily (ii) resolution<br><br><b>A4.</b><br>(i) He was a great fish, wasn't he?<br>(ii) The skiff was being pulled steadily by the fish.<br><br><b>A5.</b> This shows that the old man was not just a fisherman, but a true sportsman with a deep connection to nature. He saw the fish not just as a prize, but as a noble and worthy adversary. His respect for the fish's strength and dignity reveals his own nobility and his profound understanding of the sea.",
    "marks": 10
  },
  {
    "type": "long",
    "text": "<b>Language Study (Grammar)</b><br><br><b>Do as directed:</b><br><br>1. The boy was sad to see the old man come in each day. (Identify the infinitive)<br><br>2. It looked like the flag of permanent defeat. (Identify the figure of speech)<br><br>3. The old man was now definitely and finally ‘salao’. (Identify the adverbs)<br><br>4. He had gone eighty-four days now without taking a fish. (Rewrite as a simple sentence)",
    "answer": "1. The infinitive is 'to see'.<br><br>2. <b>Simile:</b> The patched sail is directly compared to a 'flag of permanent defeat' using the word 'like'.<br><br>3. The adverbs are: now, definitely, finally.<br><br>4. Despite fishing for eighty-four days, he had not taken a fish.",
    "marks": 4
  },
  {
    "type": "short",
    "text": "Explain the theme of 'triumph and defeat' as seen in 'The Old Man and the Sea'.",
    "answer": "The theme of 'triumph and defeat' is central to the story. The old man, Santiago, achieves a great triumph by catching the giant marlin after a heroic struggle, proving his skill and endurance. However, this victory is followed by a crushing defeat when sharks devour the fish on his journey home, leaving him with only a skeleton. Yet, the story suggests that true victory lies not in the material prize but in the struggle itself. Though he is defeated by the sharks, Santiago is not destroyed in spirit. He has proven his strength to himself and earned the respect of the boy, which is a deeper, more meaningful triumph.",
    "marks": 2
  }
]

