[
  {
    "type": "long",
    "text": "<h3>Language Study - Grammar Practice Set</h3><br><b>Topic 1: Tenses (Do as directed)</b><br><br>1. She _______ (write) a letter to her friend every week.<br>2. They _______ (watch) a movie right now.<br>3. I _______ (finish) my homework just now.<br>4. He _______ (live) in this house since 2010.<br>5. The train _______ (leave) before we reached the station.<br>6. My father _______ (read) the newspaper when the phone rang.<br>7. Tomorrow, we _______ (visit) our grandparents.<br>8. By next year, she _______ (complete) her graduation.<br>9. The earth _______ (revolve) around the sun.<br>10. I _______ (take) a new name every month. (Rewrite in the Past Perfect Continuous Tense)<br>11. He was watching a wrestling match. (Rewrite in the Simple Future Tense)<br>12. She will be _______ (prepare) for her exams all night.",
    "answer": "<b>Topic 1: Tenses</b><br><br>1. She <b>writes</b> a letter to her friend every week.<br>2. They <b>are watching</b> a movie right now.<br>3. I <b>have finished</b> my homework just now.<br>4. He <b>has been living</b> in this house since 2010.<br>5. The train <b>had left</b> before we reached the station.<br>6. My father <b>was reading</b> the newspaper when the phone rang.<br>7. Tomorrow, we <b>will visit</b> our grandparents.<br>8. By next year, she <b>will have completed</b> her graduation.<br>9. The earth <b>revolves</b> around the sun.<br>10. I <b>had been taking</b> a new name every month.<br>11. He <b>will watch</b> a wrestling match.<br>12. She will be <b>preparing</b> for her exams all night.",
    "marks": 12
  },
  {
    "type": "long",
    "text": "<b>Topic 2: Change the Voice</b><br><br>1. The boy helps the old man.<br>2. She is singing a beautiful song.<br>3. They have completed the project.<br>4. The teacher had taught the lesson.<br>5. Someone stole my pen yesterday.<br>6. The police were catching the thief.<br>7. He will write a novel.<br>8. Can you solve this problem?<br>9. Please open the door.<br>10. I was asked to sing.<br>11. Doctors gave him a life expectancy of two years.<br>12. A prayer is carried by this mantra.",
    "answer": "<b>Topic 2: Change the Voice</b><br><br>1. The old man is helped by the boy.<br>2. A beautiful song is being sung by her.<br>3. The project has been completed by them.<br>4. The lesson had been taught by the teacher.<br>5. My pen was stolen yesterday.<br>6. The thief was being caught by the police.<br>7. A novel will be written by him.<br>8. Can this problem be solved by you?<br>9. You are requested to open the door.<br>10. They/Someone asked me to sing.<br>11. A life expectancy of two years was given to him by the doctors. / He was given a life expectancy of two years by the doctors.<br>12. This mantra carries a prayer.",
    "marks": 12
  },
  {
    "type": "long",
    "text": "<b>Topic 3: Clauses (Identify the subordinate clause and name it)</b><br><br>1. I know where he lives.<br>2. The man who is wearing a blue shirt is my brother.<br>3. He worked hard so that he could succeed.<br>4. Everyone thought that the Titanic could never sink.<br>5. If you work hard, you will pass.<br>6. Tell me what you want.<br>7. The house that I live in is very old.<br>8. She cried because she was in pain.<br>9. I refuse to accept that the world is so poor.<br>10. I remember the village where I was born.<br>11. He replied that he would come.<br>12. Although he is poor, he is honest.",
    "answer": "<b>Topic 3: Clauses</b><br><br>1. <u>where he lives</u> - Subordinate Noun Clause<br>2. <u>who is wearing a blue shirt</u> - Subordinate Adjective Clause<br>3. <u>so that he could succeed</u> - Subordinate Adverb Clause of Purpose<br>4. <u>that the Titanic could never sink</u> - Subordinate Noun Clause<br>5. <u>If you work hard</u> - Subordinate Adverb Clause of Condition<br>6. <u>what you want</u> - Subordinate Noun Clause<br>7. <u>that I live in</u> - Subordinate Adjective Clause<br>8. <u>because she was in pain</u> - Subordinate Adverb Clause of Reason<br>9. <u>that the world is so poor</u> - Subordinate Noun Clause<br>10. <u>where I was born</u> - Subordinate Adjective Clause<br>11. <u>that he would come</u> - Subordinate Noun Clause<br>12. <u>Although he is poor</u> - Subordinate Adverb Clause of Contrast",
    "marks": 12
  },
  {
    "type": "long",
    "text": "<b>Topic 4: Sentence Types (Simple, Complex, Compound)</b><br><br>1. Seeing the teacher, the boys became silent. (Make it Compound)<br>2. He is poor but he is honest. (Make it Simple)<br>3. He worked hard and he passed the exam. (Make it Complex)<br>4. On reaching the King, he fainted. (Make it Complex)<br>5. He must confess his fault to avoid punishment. (Make it Compound)<br>6. Walk fast or you will miss the train. (Make it Complex)<br>7. After finishing her cry, Della attended to her cheeks. (Make it Compound)<br>8. He was ill, so he could not attend the school. (Make it Simple)<br>9. I know the boy who stood first. (Make it Simple)<br>10. The sun rose and the fog disappeared.<br>11. When he returned to Calcutta, he began to conduct experiments. (Make it Simple)<br>12. Besides being a great scientist, he was a deeply spiritual person. (Make it Compound)",
    "answer": "<b>Topic 4: Sentence Types</b><br><br>1. The boys saw the teacher and they became silent.<br>2. In spite of being poor, he is honest.<br>3. As he worked hard, he passed the exam.<br>4. When he reached the King, he fainted.<br>5. He must confess his fault or he will not avoid punishment.<br>6. If you do not walk fast, you will miss the train.<br>7. Della finished her cry and she attended to her cheeks.<br>8. Due to his illness, he could not attend the school.<br>9. I know the first-standing boy.<br>10. Compound Sentence<br>11. On returning to Calcutta, he began to conduct experiments.<br>12. He was not only a great scientist but also a deeply spiritual person.",
    "marks": 12
  },
  {
    "type": "long",
    "text": "<b>Topic 5: Question Tags (Add a suitable question tag)</b><br><br>1. She is a brilliant student.<br>2. They are not coming today.<br>3. He plays cricket well.<br>4. You don't know the answer.<br>5. It was raining heavily.<br>6. The train had already left.<br>7. We will go to the party.<br>8. Let's start the game.<br>9. Please help me.<br>10. I am right.<br>11. My hard work paid off.<br>12. He was a great fish.",
    "answer": "<b>Topic 5: Question Tags</b><br><br>1. She is a brilliant student, <b>isn't she?</b><br>2. They are not coming today, <b>are they?</b><br>3. He plays cricket well, <b>doesn't he?</b><br>4. You don't know the answer, <b>do you?</b><br>5. It was raining heavily, <b>wasn't it?</b><br>6. The train had already left, <b>hadn't it?</b><br>7. We will go to the party, <b>won't we?</b><br>8. Let's start the game, <b>shall we?</b><br>9. Please help me, <b>will you?</b><br>10. I am right, <b>aren't I?</b><br>11. My hard work paid off, <b>didn't it?</b><br>12. He was a great fish, <b>wasn't he?</b>",
    "marks": 12
  },
  {
    "type": "long",
    "text": "<b>Topic 6: Degrees of Comparison (Change the degree as instructed)</b><br><br>1. He was one of the greatest scientists of his time. (Change to Positive)<br>2. Very few cities in India are as big as Mumbai. (Change to Superlative)<br>3. Gold is more precious than most other metals. (Change to Positive)<br>4. No other person was as trusting as he was. (Change to Superlative)<br>5. My husband was my biggest support. (Change to Comparative)<br>6. Iron is more useful than any other metal. (Change to Superlative)<br>7. Very few poets are as great as Kalidas. (Change to Comparative)<br>8. This is the tallest building in the city. (Change to Positive)<br>9. He is stronger than me. (Change to Positive)<br>10. It is one of the worst maritime disasters in history. (Change to Comparative)<br>11. Australia is the largest island in the world. (Change to Comparative)<br>12. He was greater than most other scientists of his time. (Change to Superlative)",
    "answer": "<b>Topic 6: Degrees of Comparison</b><br><br>1. Very few scientists of his time were as great as he was.<br>2. Mumbai is one of the biggest cities in India.<br>3. Very few other metals are as precious as gold.<br>4. He was the most trusting person.<br>5. My husband was bigger support than any other support of mine.<br>6. Iron is the most useful of all metals.<br>7. Kalidas is greater than most other poets.<br>8. No other building in the city is as tall as this.<br>9. I am not as strong as he is.<br>10. It is worse than most other maritime disasters in history.<br>11. Australia is larger than any other island in the world.<br>12. He was one of the greatest scientists of his time.",
    "marks": 12
  }
]
