[
  {
    "type": "long",
    "text": "<h3>Writing Skills - A Comprehensive Guide</h3><br><b>Topic 1: Letter Writing (Formal)</b><br><br><b>Format:</b><br>A formal letter is written for official or professional communication. The tone should be polite, concise, and formal. It includes letters of complaint, inquiry, placing orders, or applications.<br><br><b>Key Points:</b><br><ul><li>Sender's Address and Date at the top left.</li><li>Receiver's Address below it.</li><li>A clear 'Subject' line.</li><li>Formal salutation (e.g., 'Respected Sir/Madam,').</li><li>Body of the letter in 2-3 short paragraphs.</li><li>Formal closing (e.g., 'Yours faithfully,', 'Yours truly,').</li></ul><br><b>Practice Question:</b><br>Write a letter to the Municipal Commissioner of your city, complaining about the irregular water supply in your locality.",
    "answer": "<b>Solved Example: Formal Letter</b><br><br>S-5, Harmony Apartments,<br>Gandhi Nagar,<br>Pune - 411007.<br>8th September 2025<br><br>To,<br>The Municipal Commissioner,<br>Pune Municipal Corporation,<br>Pune - 411005.<br><br><b>Subject: Complaint regarding irregular water supply in Gandhi Nagar.</b><br><br>Respected Sir/Madam,<br><br>I am a resident of Gandhi Nagar, writing to you on behalf of the entire locality to bring to your notice the severe problem of irregular water supply that we have been facing for the past two months. The water supply is erratic, and the timing is highly unpredictable. Often, we receive water for only an hour a day, and sometimes there is no supply at all for days on end.<br><br>This situation has caused immense hardship to all the residents. Our daily routines are disrupted, and we are facing great difficulty in managing basic household chores. The quality of water, when supplied, is also poor and muddy, posing a health risk.<br><br>We have made several complaints to the local water supply office, but no effective action has been taken so far. I kindly request you to look into this matter urgently and take the necessary steps to ensure a regular and adequate supply of clean water to our locality.<br><br>Thanking you.<br><br>Yours faithfully,<br>Rohan Verma",
    "marks": 5
  },
  {
    "type": "long",
    "text": "<b>Letter Writing (Informal)</b><br><br><b>Format:</b><br>An informal letter is written to friends, family, or relatives. The tone is personal, friendly, and conversational.<br><br><b>Key Points:</b><br><ul><li>Sender's Address and Date at the top left.</li><li>Friendly salutation (e.g., 'My dear Rohan,', 'Dearest Father,').</li><li>Body of the letter can be longer and more descriptive.</li><li>Informal closing (e.g., 'Yours lovingly,', 'Your affectionate son,').</li></ul><br><b>Practice Question:</b><br>Write a letter to your friend, congratulating him/her on his/her success in the S.S.C. Board Examination.",
    "answer": "<b>Solved Example: Informal Letter</b><br><br>42, Green Valley,<br>Village Rampur,<br>District Satara.<br>8th September 2025<br><br>My dear Rohan,<br><br>I was absolutely thrilled when I saw your S.S.C. result yesterday! A whopping 95%! Heartiest congratulations on your brilliant success. I know how hard you worked for this, and you truly deserve every bit of it. My parents were also overjoyed to hear the news and have sent their best wishes.<br><br>Your dedication and perseverance have really paid off. This is just the beginning of a very bright future, and I am so proud to have a friend like you. I am eagerly waiting to meet you and celebrate this wonderful achievement together.<br><br>Do let me know when you are free. Once again, many congratulations to you and your proud parents.<br><br>Yours lovingly,<br>Sameer",
    "marks": 5
  },
  {
    "type": "long",
    "text": "<b> Speech Writing</b><br><br><b>Format:</b><br>A speech should be engaging and persuasive. It must begin with a proper salutation to the audience and end with a concluding remark.<br><br><b>Key Points:</b><br><ul><li>Catchy title.</li><li>Greeting/Salutation (e.g., 'Respected Principal, teachers, and my dear friends...').</li><li>Introduction to the topic.</li><li>Body with main points, examples, and rhetorical questions.</li><li>Conclusion summarizing the speech and giving a powerful message.</li><li>'Thank you' at the end.</li></ul><br><b>Practice Question:</b><br>Prepare a speech on the topic 'The Importance of Cleanliness'.",
    "answer": "<b>Solved Example: Speech Writing</b><br><br><b>The Importance of Cleanliness</b><br><br>Respected Principal, worthy teachers, and my dear friends,<br><br>A very good morning to you all. Today, I stand before you to speak on a topic that is fundamental to our health and well-being – ‘The Importance of Cleanliness’.<br><br>It is rightly said that ‘Cleanliness is next to Godliness’. But what does it really mean? It means that cleanliness is not just about keeping our bodies clean, but also our surroundings – our homes, our classrooms, our city, and our country. A clean environment is a healthy environment. Most of the diseases we see around us, like malaria, dengue, and cholera, are a direct result of unclean surroundings where germs and mosquitoes breed.<br><br>Friends, cleanliness is a habit. It must begin with us. Can we not take a simple pledge to not throw litter on the streets? Can we not spend just ten minutes a week cleaning our own locality? The 'Swachh Bharat Abhiyan' initiated by our government is a great step, but it cannot succeed without our active participation. Let us be the change we want to see. Let us work together to make our country a cleaner, healthier, and more beautiful place to live in.<br><br>Thank you!",
    "marks": 5
  },
  {
    "type": "long",
    "text": "<b>Dialogue Writing</b><br><br><b>Format:</b><br>A dialogue is a conversation between two people. It should be written in a natural, conversational style with appropriate greetings and closings.<br><br><b>Key Points:</b><br><ul><li>Should have at least 5-6 meaningful exchanges.</li><li>The language should be appropriate to the characters and the situation.</li><li>Proper punctuation must be used.</li></ul><br><b>Practice Question:</b><br>Write a dialogue between a student and a librarian about a lost library book.",
    "answer": "<b>Solved Example: Dialogue Writing</b><br><br><b>Student:</b> Excuse me, Madam.<br><b>Librarian:</b> Yes, how can I help you?<br><b>Student:</b> Madam, I am a student of Class X, Roll No. 25. I am here to report the loss of a library book.<br><b>Librarian:</b> Oh, that's serious. Which book was it?<br><b>Student:</b> It was 'The Adventures of Tom Sawyer'. I have searched everywhere, but I am unable to find it. I think I lost it during my bus journey yesterday. I am very sorry.<br><b>Librarian:</b> Losing a library book is a serious matter. You know the rules, don't you? You will have to either replace the book with a new copy or pay a fine equivalent to its cost.<br><b>Student:</b> Yes, Madam, I am aware of the rules. I will go to the market and buy a new copy of the same book and submit it tomorrow.<br><b>Librarian:</b> Alright. Please make sure you do that tomorrow. Be more careful with library books in the future.<br><b>Student:</b> I will, Madam. Thank you for your understanding.",
    "marks": 5
  },
  {
    "type": "long",
    "text": "<b> Information Transfer (Non-Verbal to Verbal)</b><br><br>This involves converting information from a non-verbal format (like a table, chart, or diagram) into a written paragraph.<br><br><b>Practice Question:</b><br>Observe the following table about Rohit's daily routine and write a short paragraph about it.<br><br><b>Rohit's Daily Routine</b><br><table border='1' style='width:100%; border-collapse: collapse;'><tr><th style='padding: 8px;'>Time</th><th style='padding: 8px;'>Activity</th></tr><tr><td style='padding: 8px;'>6:00 AM</td><td style='padding: 8px;'>Wake up</td></tr><tr><td style='padding: 8px;'>7:00 AM - 8:00 AM</td><td style='padding: 8px;'>Exercise and Breakfast</td></tr><tr><td style='padding: 8px;'>8:30 AM - 2:30 PM</td><td style='padding: 8px;'>School</td></tr><tr><td style='padding: 8px;'>4:00 PM - 6:00 PM</td><td style='padding: 8px;'>Homework and Studies</td></tr><tr><td style='padding: 8px;'>6:00 PM - 7:00 PM</td><td style='padding: 8px;'>Play outdoors</td></tr><tr><td style='padding: 8px;'>8:30 PM</td><td style='padding: 8px;'>Dinner with family</td></tr><tr><td style='padding: 8px;'>10:00 PM</td><td style='padding: 8px;'>Go to bed</td></tr></table>",
    "answer": "<b>Solved Example: Non-Verbal to Verbal</b><br><br><b>Rohit's Balanced Routine</b><br><br>The given table illustrates the well-structured and balanced daily routine of a student named Rohit. Rohit is an early riser, as he wakes up at 6:00 AM. The first hour of his morning, from 7:00 AM to 8:00 AM, is dedicated to his health, during which he exercises and has his breakfast. His school hours are from 8:30 AM to 2:30 PM. After returning from school, he dedicates a solid two-hour slot from 4:00 PM to 6:00 PM for his homework and studies. The routine also includes a one-hour period for recreation, as he plays outdoors from 6:00 PM to 7:00 PM. He values family time, having dinner with his family at 8:30 PM. Finally, he concludes his day by going to bed at 10:00 PM, ensuring he gets adequate sleep. Overall, Rohit's routine shows a healthy balance between studies, physical activity, and family time.",
    "marks": 5
  },
  {
    "type": "long",
    "text": "<b> View and Counterview</b><br><br>In this, you are given a topic and a set of points for the 'View'. You have to write points for the 'Counterview'.<br><br><b>Practice Question:</b><br><b>Topic:</b> 'Online learning is better than offline learning.'<br><b>View (For the topic):</b><br><ul><li>Flexible and convenient</li><li>Access to a wide range of courses</li><li>Saves travel time and cost</li><li>Promotes self-learning</li></ul><br><b>Task:</b> Write a paragraph for the Counterview.",
    "answer": "<b>Solved Example: Counterview</b><br><br><b>Counterview: 'Offline learning is better than online learning'</b><br><br>While online learning offers flexibility, it cannot replace the effectiveness and holistic experience of traditional offline learning. The biggest drawback of online education is the lack of direct, personal interaction with teachers, which is crucial for clearing doubts and getting individual attention. Moreover, practical subjects and hands-on experiments, which are vital for science students, cannot be conducted effectively in an online environment. Offline schooling also plays a very important role in developing social skills, discipline, and teamwork through interaction with peers and participation in extracurricular activities. The constant screen time in online learning can lead to health issues and a sense of isolation, which are not concerns in a physical classroom.",
    "marks": 5
  },
  {
    "type": "long",
    "text": "<b>Developing a Story / Narrating an Experience</b><br><br>You may be given a beginning or an ending of a story and asked to complete it, or asked to narrate a personal experience.<br><br><b>Practice Question (Story):</b><br>Develop a story with a suitable title that begins with the following line: 'It was a rainy Saturday afternoon. I was all alone at home when suddenly, the doorbell rang...'",
    "answer": "<b>Solved Example: Story Writing</b><br><br><b>The Unexpected Guest</b><br><br><u>It was a rainy Saturday afternoon. I was all alone at home when suddenly, the doorbell rang.</u> I was surprised, as I wasn't expecting anyone. I peeped through the keyhole and saw a small, drenched puppy shivering on the doorstep. My heart melted at the sight. I immediately opened the door and brought the poor creature inside.<br><br>I dried him with a warm towel and gave him a bowl of milk, which he lapped up gratefully. He had a small collar but no name tag. I decided to call him 'Stormy', as I had found him during a storm. We spent the rest of the afternoon playing, and I had never felt so happy. In just a few hours, we had formed a special bond.<br><br>The next day, I made posters and put them up in the neighbourhood, hoping to find his owner. A week passed, but no one came. By then, Stormy had become a part of our family. My parents, seeing how responsible I was in taking care of him, agreed to let me keep him. It turned out that the unexpected guest who came on a rainy day was the best gift I had ever received.",
    "marks": 5
  },
  {
    "type": "long",
    "text": "<b> Summary Writing</b><br><br>A summary is a brief statement of the main points of a passage. It should be about one-third of the original passage and written in your own words.<br><br><b>Practice Question:</b><br>Read the passage and write a summary. Suggest a suitable title.<br><br>Trees are our best friends. They are essential for our survival. They provide us with oxygen, which is necessary for breathing. They absorb the harmful carbon dioxide from the atmosphere and help in maintaining the ecological balance. Forests are home to a wide variety of wildlife. Trees give us valuable timber for furniture and construction, and firewood for fuel. They also provide us with fruits, flowers, and medicinal herbs like neem and tulsi. The roots of the trees hold the soil together and prevent soil erosion. They play a very important role in the water cycle by attracting clouds and bringing rain. Despite their immense importance, human beings are cutting down forests indiscriminately for agriculture and urbanization. This deforestation is a major cause of global warming and climate change. It is our utmost duty to protect our forests and plant more trees to save our planet.",
    "answer": "<b>Solved Example: Summary Writing</b><br><br><b>Title: The Importance of Trees</b><br><br>Trees are vital for life on Earth. They maintain the ecological balance by providing essential oxygen and absorbing carbon dioxide. Trees are a source of numerous valuable products like timber, fuel, fruits, and medicines, and they are also the habitat for wildlife. They prevent soil erosion and play a crucial role in bringing rain. However, widespread deforestation by humans is causing serious environmental problems like global warming. Therefore, it is our collective responsibility to conserve forests and plant more trees for the survival of our planet.",
    "marks": 5
  },
  {
    "type": "long",
    "text": "<h3>Writing Skills - A Comprehensive Guide (Set 2)</h3><br><b>Topic 1: Letter Writing (Formal)</b><br><br><b>Practice Question:</b><br>You are the school librarian of 'New Vision High School, Aundh, Pune'. Write a letter to 'Modern Book Depot, Mumbai', placing an order for some books for your school library.",
    "answer": "<b>Solved Example: Formal Letter (Placing an Order)</b><br><br>New Vision High School,<br>Aundh,<br>Pune - 411007.<br>8th September 2025<br><br>To,<br>The Manager,<br>Modern Book Depot,<br>Dadar,<br>Mumbai - 400014.<br><br><b>Subject: Order for books for the school library.</b><br><br>Respected Sir/Madam,<br><br>With reference to your latest catalogue, we would like to place an order for the following books for our school library. Kindly supply the books listed below at your earliest convenience.<br><br><table border='1' style='width:100%; border-collapse: collapse; text-align: left;'><tr><th style='padding: 8px;'>Sr. No.</th><th style='padding: 8px;'>Book Title</th><th style='padding: 8px;'>Author</th><th style='padding: 8px;'>Quantity</th></tr><tr><td style='padding: 8px;'>1.</td><td style='padding: 8px;'>Wings of Fire</td><td style='padding: 8px;'>A.P.J. Abdul Kalam</td><td style='padding: 8px;'>5 copies</td></tr><tr><td style='padding: 8px;'>2.</td><td style='padding: 8px;'>A Brief History of Time</td><td style='padding: 8px;'>Stephen Hawking</td><td style='padding: 8px;'>3 copies</td></tr><tr><td style='padding: 8px;'>3.</td><td style='padding: 8px;'>Oxford English Dictionary</td><td style='padding: 8px;'>-</td><td style='padding: 8px;'>10 copies</td></tr></table><br>We request you to provide the standard school library discount on the purchase. Please ensure that all books are in good condition and are properly packaged to avoid damage during transit. The payment will be made via bank transfer after the receipt of the books.<br><br>We look forward to a prompt delivery.<br><br>Thanking you.<br><br>Yours faithfully,<br>XYZ<br>(Librarian)",
    "marks": 5
  },
  {
    "type": "long",
    "text": "<b>Letter Writing (Informal)</b><br><br><b>Practice Question:</b><br>Write a letter to your father, who is in another city, asking for his permission to join a 5-day trekking trip organised by your school.",
    "answer": "<b>Solved Example: Informal Letter</b><br><br>Room No. 12, Boys' Hostel,<br>St. Joseph's School,<br>Nagpur - 440001.<br>8th September 2025<br><br>Dearest Father,<br><br>I received your letter yesterday and was happy to know that everyone at home is doing well. My studies are going on fine, and my first term exams are just around the corner.<br><br>I am writing this letter for a special reason. Our school is organising a 5-day trekking trip to the Sahyadri mountains during the Diwali vacation, from October 20th to 25th. Two of our teachers and a professional guide will be accompanying us. They will teach us about the local flora and fauna. I am very keen on joining this trip as I have always been interested in nature and adventure. The total cost for the trip is Rs. 3000, which includes travel, food, and stay.<br><br>Father, I kindly request your permission to join this trip. I promise to be very careful and responsible. It will be a great learning experience for me. I am sure you will not disappoint me.<br><br>Give my love to mother and little Riya. I am waiting for your permission.<br><br>Your affectionate son,<br>Amit",
    "marks": 5
  },
  {
    "type": "long",
    "text": "<b> Speech Writing</b><br><br><b>Practice Question:</b><br>Prepare a speech to be delivered in your school assembly on the topic 'Books are Our Best Friends'.",
    "answer": "<b>Solved Example: Speech Writing</b><br><br><b>Books are Our Best Friends</b><br><br>Respected Principal, worthy teachers, and my dear friends,<br><br>A very good morning to all of you. Today, I would like to share my thoughts on a very special topic: 'Books are Our Best Friends'.<br><br>Friends, in a world full of temporary connections, books are the only friends that stay with us forever. They are a treasure trove of knowledge, wisdom, and imagination. Just like a good friend, they guide us, inspire us, and entertain us without asking for anything in return. When we are sad, they comfort us with beautiful stories. When we are curious, they enlighten us with knowledge. When we feel lost, they show us the right path with the wisdom of great thinkers.<br><br>Unlike human friends, books never leave our side. They transport us to magical lands, introduce us to unforgettable characters, and teach us valuable life lessons. Reading a good book is like having a conversation with the greatest minds in history. So, my dear friends, let us cultivate the habit of reading. Let us make books our constant companions. Let us turn to them for knowledge, for solace, and for joy.<br><br>Thank you!",
    "marks": 5
  },
  {
    "type": "long",
    "text": "<b> Dialogue Writing</b><br><br><b>Practice Question:</b><br>Write a dialogue between a mother and her son about the excessive use of mobile phones.",
    "answer": "<b>Solved Example: Dialogue Writing</b><br><br><b>Mother:</b> Rohan, you have been on your phone for over two hours now. It's time to put it away.<br><b>Rohan:</b> Just five more minutes, Mom. I am chatting with my friends.<br><b>Mother:</b> You said that half an hour ago. Rohan, this excessive use of the mobile phone is not good for you. Your eyes will get strained, and it's affecting your studies.<br><b>Rohan:</b> But Mom, all my friends are online. It's how we stay connected.<br><b>Mother:</b> I understand that, but there should be a balance. You have not played outside for a week. Physical activity is just as important as staying connected with friends. Too much screen time can make you lazy and affect your health.<br><b>Rohan:</b> But what should I do? I get bored.<br><b>Mother:</b> You could read a book, help me in the garden, or go for a cycle ride with your friends instead of just chatting online. It's important to have a real life, not just a virtual one.<br><b>Rohan:</b> You are right, Mom. I am sorry. I will reduce my screen time from now on.<br><b>Mother:</b> That's my boy. Now go and get some fresh air.",
    "marks": 5
  },
  {
    "type": "long",
    "text": "<b> Information Transfer (Verbal to Non-Verbal)</b><br><br><b>Practice Question:</b><br>Read the following paragraph about preparing for board exams and present the information as a list of 'Do's and Don'ts'.<br><br>To succeed in board exams, a student must follow a well-planned strategy. It is essential to create a realistic timetable and stick to it. One should never neglect their health; getting adequate sleep and eating nutritious food is very important. Instead of trying to memorise everything, students should focus on understanding the concepts. It is also a good practice to solve previous years' question papers to understand the pattern. One must avoid wasting time on social media and video games. It is also not advisable to start a new topic at the last minute, as this can create confusion and anxiety. Lastly, staying calm and confident is the key to performing well.",
    "answer": "<b>Solved Example: Verbal to Non-Verbal</b><br><br><b>How to Prepare for Board Exams</b><br><br><table border='1' style='width:100%; border-collapse: collapse; text-align: left;'><tr><th style='padding: 8px;'>Do's</th><th style='padding: 8px;'>Don'ts</th></tr><tr><td style='padding: 8px;'>✓ Create and follow a realistic timetable.</td><td style='padding: 8px;'>✗ Don't neglect your health.</td></tr><tr><td style='padding: 8px;'>✓ Get adequate sleep and eat healthy food.</td><td style='padding: 8px;'>✗ Don't try to memorise everything without understanding.</td></tr><tr><td style='padding: 8px;'>✓ Focus on understanding concepts.</td><td style='padding: 8px;'>✗ Don't waste time on social media and video games.</td></tr><tr><td style='padding: 8px;'>✓ Solve previous years' question papers.</td><td style='padding: 8px;'>✗ Don't start a new topic at the last minute.</td></tr><tr><td style='padding: 8px;'>✓ Stay calm and confident.</td><td style='padding: 8px;'>✗ Don't panic or get anxious.</td></tr></table>",
    "marks": 5
  },
  {
    "type": "long",
    "text": "<b> View and Counterview</b><br><br><b>Practice Question:</b><br><b>Topic:</b> 'City life is better than village life.'<br><b>View (For the topic):</b><br><ul><li>Better educational and medical facilities</li><li>More job opportunities</li><li>Better transport and entertainment options</li><li>Modern lifestyle</li></ul><br><b>Task:</b> Write a paragraph for the Counterview.",
    "answer": "<b>Solved Example: Counterview</b><br><br><b>Counterview: 'Village life is better than city life'</b><br><br>While city life may offer modern amenities, it cannot match the peace, purity, and simplicity of village life. The biggest advantage of living in a village is the clean and natural environment. One gets to breathe fresh, unpolluted air and drink pure water, which is a luxury in cities. Village life is slow-paced and free from the stress and tension that are a part of the urban rat race. Moreover, villages have a strong sense of community and social bonding, where people know and support each other, unlike the isolation of city apartments. One can enjoy the simple pleasures of nature and lead a healthier and more peaceful life in a village, which is far more valuable than the material comforts of a city.",
    "marks": 5
  },
  {
    "type": "long",
    "text": "<b> Developing a Story / Narrating an Experience</b><br><br><b>Practice Question (Story):</b><br>Develop a story with a suitable title that ends with the following line: '...And that is how I realised that honesty is the best policy.'",
    "answer": "<b>Solved Example: Story Writing</b><br><br><b>The Lost Wallet</b><br><br>Last week, while returning from school, I saw a wallet lying on the pavement. It was a thick leather wallet, and my heart skipped a beat as I picked it up. Opening it, I saw it was full of hundred-rupee notes. There must have been at least five thousand rupees in it. My first thought was to keep it. With that money, I could buy the new video game I had been dreaming of for months. No one had seen me pick it up.<br><br>But then, I saw an ID card in the wallet. It belonged to an elderly man, Mr. Das. A wave of guilt washed over me. I thought about how worried Mr. Das must be. I imagined him needing that money for something important. My conscience wouldn't let me keep it. I found his address on the card and decided to go to his house.<br><br>When I returned the wallet, the old man was overwhelmed with joy. He told me that the money was for his wife's medicines and he had been extremely worried. He blessed me and offered me a reward of five hundred rupees. I politely refused. The look of relief and gratitude on his face was a far greater reward than any video game. <u>And that is how I realised that honesty is the best policy.</u>",
    "marks": 5
  },
  {
    "type": "long",
    "text": "<b> Summary Writing</b><br><br><b>Practice Question:</b><br>Read the passage and write a summary. Suggest a suitable title.<br><br>Travelling is a very important part of life and education. It is not just about visiting new places, but about experiencing different cultures, lifestyles, and perspectives. When we travel, we get to see new landscapes, taste new cuisines, and meet people from different backgrounds. This broadens our horizons and makes us more open-minded and tolerant. Travelling teaches us practical skills like planning, budgeting, and navigating unfamiliar places. It also pushes us out of our comfort zone and helps us become more independent and confident. Visiting historical sites can make history come alive, and interacting with nature can be a source of great peace and inspiration. While bookish knowledge is important, the real-world experiences gained through travelling provide a deeper and more lasting education that cannot be found in a classroom. It is an investment in ourselves that enriches our mind and soul.",
    "answer": "<b>Solved Example: Summary Writing</b><br><br><b>Title: Travelling: The Best Education</b><br><br>Travelling is an essential and enriching part of life that offers a profound education beyond the classroom. It involves experiencing diverse cultures and meeting new people, which broadens one's perspective and promotes open-mindedness. The practical skills of planning and independence are developed while navigating new environments. Furthermore, travelling provides deeper learning by making history tangible at historical sites and offering peace through nature. The real-world experiences gained from travel provide a more valuable and lasting education than mere bookish knowledge, making it a true investment in personal growth.",
    "marks": 5
  },
  {
    "type": "long",
    "text": "<h3>Writing Skills - A Comprehensive Guide (Set 3)</h3><br><b>Topic 1: Letter Writing (Formal)</b><br><br><b>Practice Question:</b><br>You are Anjali/Ankit Sharma from 15, Vasant Vihar, Nagpur. Write a letter to the editor of a local newspaper, drawing attention to the problem of frequent power cuts in your area.",
    "answer": "<b>Solved Example: Formal Letter (Letter to the Editor)</b><br><br>15, Vasant Vihar,<br>Nagpur - 440022.<br>8th September 2025<br><br>To,<br>The Editor,<br>The Nagpur Times,<br>Nagpur - 440001.<br><br><b>Subject: Complaint regarding frequent power cuts in Vasant Vihar.</b><br><br>Respected Sir/Madam,<br><br>Through the columns of your esteemed newspaper, I wish to draw the attention of the concerned authorities to the problem of frequent and long power cuts in the Vasant Vihar area.<br><br>For the past month, our locality has been experiencing unscheduled power cuts that last for several hours every day. This has thrown our normal lives completely out of gear. The studies of students are severely affected, especially with exams approaching. Household chores are disrupted, and the elderly face a lot of hardship, particularly during the hot summer afternoons.<br><br>We have lodged several complaints with the local electricity board, but no permanent solution has been provided. We are only given temporary assurances. The situation is getting worse day by day. We sincerely hope that the authorities will wake up to our plight and take immediate action to ensure a regular and uninterrupted power supply.<br><br>Thanking you.<br><br>Yours faithfully,<br>Anjali Sharma<br>(A concerned resident)",
    "marks": 5
  },
  {
    "type": "long",
    "text": "<b> Letter Writing (Informal)</b><br><br><b>Practice Question:</b><br>Write a letter to your younger brother, advising him to take his studies more seriously as you have received a complaint from your mother.",
    "answer": "<b>Solved Example: Informal Letter</b><br><br>Room No. 21, Ganga Hostel,<br>Fergusson College,<br>Pune - 411004.<br>8th September 2025<br><br>My dear Arun,<br><br>I hope you are doing well. I received mother's letter yesterday, and I must say I am quite disappointed and worried after reading it. She has complained that you have been neglecting your studies completely and spending most of your time playing video games.<br><br>Arun, you are now in Class X, which is a very crucial year for your future. The marks you score in your board exams will determine the stream you get for your higher studies. I know that playing games is important for recreation, but you must learn to strike a balance. You need to understand the importance of time management. If you waste this precious time now, you will regret it later in life.<br><br>I advise you to create a proper study schedule and follow it seriously. Please pay attention in class and clear all your doubts with your teachers. I have full faith in your abilities. Please don't let us down. I hope you will take my advice in the right spirit.<br><br>Give my regards to mother and father.<br><br>Your loving brother,<br>Vikram",
    "marks": 5
  },
  {
    "type": "long",
    "text": "<b> Speech Writing</b><br><br><b>Practice Question:</b><br>Prepare a speech for your school assembly on the topic 'Discipline is the Key to Success'.",
    "answer": "<b>Solved Example: Speech Writing</b><br><br><b>Discipline is the Key to Success</b><br><br>A very good morning to our respected Principal, worthy teachers, and all my dear friends.<br><br>Today, I would like to speak on a virtue that is the foundation of all success: Discipline. It is often said that discipline is the bridge between goals and accomplishment, and I couldn't agree more.<br><br>What is discipline? It is not a punishment, but a system of rules that helps us to control our body and mind. It is the self-control that stops us from watching another episode of a series when we know we have an exam to study for. For a student, discipline is the most important tool. A disciplined student who follows a regular study schedule, completes homework on time, and respects teachers is bound to excel not just in academics, but in all spheres of life.<br><br>Look at any successful person in this world – be it a great scientist, an athlete, or an artist. You will find that discipline has been the backbone of their journey. It is discipline that makes them practice day and night, pushing their limits to achieve greatness. So, my friends, let us embrace discipline not as a burden, but as our guide. Let us be disciplined in our thoughts, our words, and our actions, and I am sure success will be ours.<br><br>Thank you!",
    "marks": 5
  },
  {
    "type": "long",
    "text": "<b> Dialogue Writing</b><br><br><b>Practice Question:</b><br>Write a dialogue between two friends about their plans for the weekend.",
    "answer": "<b>Solved Example: Dialogue Writing</b><br><br><b>Ajay:</b> Hi Vijay! How are you doing?<br><b>Vijay:</b> I'm fine, Ajay. What about you? Any plans for the upcoming weekend?<br><b>Ajay:</b> Not really. I was thinking we could do something interesting. I'm bored of just staying at home.<br><b>Vijay:</b> That's a great idea! How about we go for a one-day trip to the nearby hill station, Lonavala?<br><b>Ajay:</b> Wow, Lonavala! That sounds exciting. The weather would be perfect for it. How will we travel?<br><b>Vijay:</b> We can take the early morning train. It's cheap and comfortable. We can do some trekking, enjoy the views, and eat some hot corn pakodas.<br><b>Ajay:</b> Perfect! So, what time should we meet at the station on Saturday?<br><b>Vijay:</b> The express train leaves at 7:00 AM. Let's meet at the station by 6:30 AM so we can get tickets without any rush.<br><b>Ajay:</b> Done! I am really looking forward to it. It will be a much-needed break.<br><b>Vijay:</b> Me too! See you on Saturday then. Bye!",
    "marks": 5
  },
  {
    "type": "long",
    "text": "<b> Information Transfer (Non-Verbal to Verbal)</b><br><br><b>Practice Question:</b><br>Observe the following pie chart showing the favourite sports of students in a school and write a short paragraph about it.<br><br>",
    "answer": "<b>Solved Example: Non-Verbal to Verbal</b><br><br><b>Students' Favourite Sports</b><br><br>The given pie chart provides information about the favourite sports among the students of a school. It is clear from the chart that cricket is the most popular sport, with a significant 40% of students choosing it as their favourite. The second most popular sport is football, which is favoured by a quarter of the student population, that is, 25%. Following football is the traditional Indian sport of Kabaddi, which is the favourite of 20% of the students. Basketball is also a part of the list, but it is less popular, with only 10% of students preferring it. A very small fraction of students, just 5%, have shown interest in other sports. In conclusion, the pie chart clearly indicates that cricket dominates the sporting preferences of the students in this school.",
    "marks": 5
  },
  {
    "type": "long",
    "text": "<b> View and Counterview</b><br><br><b>Practice Question:</b><br><b>Topic:</b> 'Should Junk Food be Banned in School Canteens?'<br><b>View (For the topic):</b><br><ul><li>Junk food is unhealthy and leads to obesity.</li><li>It causes health problems like diabetes at a young age.</li><li>It affects students' concentration in class.</li><li>Schools should promote healthy eating habits.</li></ul><br><b>Task:</b> Write a paragraph for the Counterview.",
    "answer": "<b>Solved Example: Counterview</b><br><br><b>Counterview: 'Junk Food should NOT be Banned in School Canteens'</b><br><br>While it is true that junk food can be unhealthy, a complete ban on it in school canteens is not a practical solution. Firstly, banning these items will only make them more desirable, and students will end up consuming them from unhygienic vendors outside the school. Instead of a complete ban, the school canteen can take the responsibility of providing healthier versions of popular junk foods, made with better ingredients. Secondly, this issue is a great opportunity to teach students about making responsible food choices. A complete ban takes away their freedom of choice. Guiding them to choose wisely is a more effective and long-term solution than imposing a ban. Ultimately, it is a matter of personal responsibility, and schools should focus on educating students about a balanced diet rather than resorting to extreme measures like a ban.",
    "marks": 5
  },
  {
    "type": "long",
    "text": "<b> Developing a Story / Narrating an Experience</b><br><br><b>Practice Question (Story):</b><br>Develop a story with a suitable title that begins with the following line: 'Rahul was walking home when he heard a strange noise coming from the old, abandoned house...'",
    "answer": "<b>Solved Example: Story Writing</b><br><br><b>The Secret in the Abandoned House</b><br><br><u>Rahul was walking home when he heard a strange noise coming from the old, abandoned house on the corner of his street.</u> It was a faint, whimpering sound. Everyone in the neighbourhood said the house was haunted, but Rahul's curiosity got the better of his fear. He pushed the creaky gate open and tiptoed towards the broken front door.<br><br>The whimpering grew louder as he stepped inside. Following the sound, he reached a dark room. In the corner, huddled under a pile of old rags, was a small, terrified kitten. It was shivering with cold and hunger. Rahul's heart went out to the tiny creature. He gently picked it up, wrapped it in his jacket, and rushed back home.<br><br>At home, he gave the kitten some warm milk. The next day, he made a 'Found Kitten' poster with his drawing and put it up on the street. That evening, a little girl named Priya, who had recently moved into the neighbourhood, came to his door with her parents. She had tears of joy in her eyes as she saw her lost kitten, 'Misty'. She explained how Misty had run away two days ago. Priya's parents thanked Rahul for his kindness. Rahul not only felt the satisfaction of doing a good deed but also made a new friend that day.",
    "marks": 5
  },
  {
    "type": "long",
    "text": "<b> Summary Writing</b><br><br><b>Practice Question:</b><br>Read the passage and write a summary. Suggest a suitable title.<br><br>Physical exercise is crucial for maintaining a healthy lifestyle. It refers to any bodily activity that enhances or maintains physical fitness and overall health and wellness. Regular exercise has numerous benefits. It strengthens our muscles and bones, which helps in preventing injuries. It is also a very effective way to control body weight, as it burns excess calories. People who exercise regularly have a lower risk of developing serious health problems like heart disease, diabetes, and high blood pressure. But the benefits are not just physical. Exercise is also a great stress buster. It helps to improve our mood by releasing chemicals called endorphins, which make us feel happy and relaxed. It can also improve our sleep quality and boost our energy levels. Despite knowing these benefits, many people lead a sedentary lifestyle, which is a major cause of health issues. Therefore, it is essential to make physical exercise a regular part of our daily routine.",
    "answer": "<b>Solved Example: Summary Writing</b><br><br><b>Title: Benefits of Regular Exercise</b><br><br>Physical exercise is essential for a healthy life, offering both physical and mental benefits. It strengthens muscles and bones, helps in weight management, and significantly reduces the risk of major diseases like heart problems and diabetes. Mentally, exercise acts as an effective stress reliever, improves mood by releasing endorphins, and enhances sleep quality and energy levels. Given the health risks of a sedentary lifestyle, incorporating regular physical activity into our daily routine is vital for overall well-being.",
    "marks": 5
  }
]



