[
  {
    "type": "mcq",
    "text": "The energy difference between the shells goes on .......... when moved away from the nucleus.",
    "options": [
      "increasing",
      "decreasing",
      "equalizing",
      "static"
    ],
    "correct_answer": "B",
    "marks": 1
  },
  {
    "type": "mcq",
    "text": "The value of Plank's constant is -",
    "options": [
      "6.626 x $10^{-34}$ Js",
      "6.023 x $10^{-24}$ Js",
      "1.667 x $10^{-23}$ Js",
      "6.626 x $10^{-28}$ Js"
    ],
    "correct_answer": "A",
    "marks": 1
  },
  {
    "type": "mcq",
    "text": "p-orbitals are......... in shape.",
    "options": [
      "spherical",
      "dumb bell",
      "double dumbell",
      "diagonal"
    ],
    "correct_answer": "C",
    "marks": 1
  },
  {
    "type": "mcq",
    "text": "“No two electrons in the same atoms can have identical set of four quantum numbers”. This statement is known as -",
    "options": [
      "Pauli's exclusion principle",
      "Hund's rule",
      "Aufbau rule",
      "Heisenberg uncertainty principle"
    ],
    "correct_answer": "A",
    "marks": 1
  },
  {
    "type": "mcq",
    "text": "Principal Quantum number describes-",
    "options": [
      "shape of orbital",
      "size of the orbital",
      "spin of electron",
      "orientation of in the orbital"
    ],
    "correct_answer": "B",
    "marks": 1
  },
  {
    "type": "short",
    "text": "If an element 'X' has mass number 11 and it has 6 neutrons, then write its representation.",
    "answer": "Mass number = Number of protons + Number of neutrons.<br>Number of protons = 11 - 6 = 5.<br>The element with 5 protons is Boron (B).<br>The representation is **$^{11}_5$B**.",
    "marks": 1
  },
  {
    "type": "short",
    "text": "Name the element that shows simplest emission spectrum.",
    "answer": "The element that shows the simplest emission spectrum is **Hydrogen (H)** because its atom contains only one electron.",
    "marks": 1
  },
  {
    "type": "short",
    "text": "State Heisenberg uncertainty principle.",
    "answer": "Heisenberg's uncertainty principle states that it is impossible to simultaneously determine with perfect accuracy both the position and the momentum of a subatomic particle, such as an electron.",
    "marks": 2
  },
  {
    "type": "short",
    "text": "Give the names of quantum numbers.",
    "answer": "The four quantum numbers are: **Principal quantum number (n)**, **Azimuthal or angular momentum quantum number (l)**, **Magnetic quantum number ($m_l$)**, and **Spin quantum number ($m_s$)**.",
    "marks": 2
  },
  {
    "type": "short",
    "text": "Identify from the following the isoelectronic species: $Ne, O^{2-}, Na^+, Ar, Cl^-, K^+$",
    "answer": "Isoelectronic species are atoms or ions that have the same number of electrons. Ne has 10 electrons. $O^{2-}$ (8+2), $Na^+$ (11-1) also have 10 electrons. Ar has 18 electrons. $Cl^-$ (17+1), $K^+$ (19-1) also have 18 electrons. The isoelectronic species are **(Ne, $O^{2-}$, $Na^+$)** and **(Ar, $Cl^-$, $K^+$)**.",
    "marks": 2
  },
  {
    "type": "short",
    "text": "Explain the anomalous behavior of copper and chromium.",
    "answer": "The anomalous behavior of copper (Cu) and chromium (Cr) is due to the extra stability of half-filled and completely filled d-orbitals. Chromium's electronic configuration is [$Ar$]$3d^54s^1$ instead of [$Ar$]$3d^44s^2$, and copper's is [$Ar$]$3d^{10}4s^1$ instead of [$Ar$]$3d^94s^2$. This happens because half-filled ($d^5$) and completely filled ($d^{10}$) d-orbitals have a lower energy state and are more stable.",
    "marks": 2
  },
  {
    "type": "short",
    "text": "Write the condensed orbital notation of electonic configuration of the following elements: a. Lithium (Z=3), b. Carbon (Z=6), c. Oxygen (Z=8), d. Silicon (Z=14), e. Chlorine (Z=17), f. Calcium (Z=20)",
    "answer": "<strong>a. Lithium (Z=3):</strong> $1s^22s^1$<br><strong>b. Carbon (Z=6):</strong> $1s^22s^22p^2$<br><strong>c. Oxygen (Z=8):</strong> $1s^22s^22p^4$<br><strong>d. Silicon (Z=14):</strong> [$Ne$]$3s^23p^2$<br><strong>e. Chlorine (Z=17):</strong> [$Ne$]$3s^23p^5$<br><strong>f. Calcium (Z=20):</strong> [$Ar$]$4s^2$",
    "marks": 3
  },
  {
    "type": "short",
    "text": "Draw shapes of 2s and 2p orbitals.",
    "answer": "The **2s orbital** is spherical in shape. The **2p orbitals** are dumbbell-shaped, with three orientations along the x, y, and z axes ($p_x, p_y, p_z$).",
    "marks": 2
  },
  {
    "type": "short",
    "text": "Explain in brief the significance of azimuthal quantum number.",
    "answer": "The **azimuthal quantum number (l)**, also known as the angular momentum quantum number, describes the **shape of an orbital**. Its value ranges from 0 to n-1. For a given principal quantum number 'n', the value of 'l' defines the subshells: l=0 corresponds to an s-orbital (spherical), l=1 to a p-orbital (dumbbell), l=2 to a d-orbital (complex), and so on.",
    "marks": 2
  },
  {
    "type": "short",
    "text": "If n=3, what are the quantum number l and m?",
    "answer": "For a principal quantum number n=3:<br>The azimuthal quantum number **l** can have values from 0 to n-1, so **l = 0, 1, 2**.<br>The magnetic quantum number **m** can have values from -l to +l. So:<br>For l=0, m=0.<br>For l=1, m = -1, 0, +1.<br>For l=2, m = -2, -1, 0, +1, +2.",
    "marks": 2
  },
  {
    "type": "short",
    "text": "The electronic configuration of oxygen is written as $1s^22s^22p_x^22p_y^12p_z^1$ and not as $1s^22s^22p_x^22p_y^22p_z^0$. Explain.",
    "answer": "This is explained by **Hund's rule of maximum multiplicity**. Hund's rule states that for a given subshell, electrons will occupy separate orbitals with parallel spins before they pair up. In the case of oxygen, the four p-electrons first occupy each of the three p-orbitals ($p_x, p_y, p_z$) with a single electron and parallel spin, leaving the fourth electron to pair up in one of the orbitals. The correct configuration is $1s^22s^22p_x^22p_y^12p_z^1$.",
    "marks": 2
  },
  {
    "type": "short",
    "text": "Explain on 'Principal Quantum number'.",
    "answer": "The **Principal quantum number (n)** is the main quantum number used to describe the electronic state of an atom. It represents the **principal energy level or shell** of an electron. Its value can be any positive integer (1, 2, 3, ...). As 'n' increases, the electron's energy level increases, and its average distance from the nucleus also increases.",
    "marks": 2
  },
  {
    "type": "long",
    "text": "Differentiate between Isotopes and Isobars.",
    "answer": "<strong>Isotopes</strong> are atoms of the same element that have the same atomic number (number of protons) but a different mass number (number of neutrons). They have the same chemical properties. For example, Carbon-12 and Carbon-14 are isotopes. <strong>Isobars</strong> are atoms of different elements that have the same mass number but a different atomic number. They have different chemical and physical properties. For example, Argon-40 and Calcium-40 are isobars.",
    "marks": 3
  },
  {
    "type": "long",
    "text": "Define the terms: i. Isotones, ii. Isoelectronic species, iii. Electronic configuration",
    "answer": "<strong>i. Isotones:</strong> Atoms of different elements that have the same number of neutrons but a different number of protons and mass number. For example, Carbon-14 (6p, 8n) and Nitrogen-15 (7p, 8n) are isotones.<br><strong>ii. Isoelectronic species:</strong> Atoms or ions that have the same number of electrons. For example, $Na^+$ and $Ne$ both have 10 electrons.<br><strong>iii. Electronic configuration:</strong> The arrangement of electrons in the orbitals of an atom or molecule. It describes how electrons are distributed among the various energy levels and subshells.",
    "marks": 3
  },
  {
    "type": "long",
    "text": "State and explain Pauli's exclusion principle.",
    "answer": "<strong>Pauli's exclusion principle</strong> states that no two electrons in the same atom can have an identical set of four quantum numbers ($n, l, m_l, m_s$). This means that an orbital can hold a maximum of two electrons, and these two electrons must have opposite spins. For example, the two electrons in the 1s orbital will have the same n, l, and $m_l$ values, but their spin quantum numbers ($m_s$) will be different (+1/2 and -1/2).",
    "marks": 3
  },
  {
    "type": "long",
    "text": "State Hund's rule of maximum multiplicity with suitable example.",
    "answer": "<strong>Hund's rule of maximum multiplicity</strong> states that when filling a set of degenerate orbitals (orbitals with the same energy), electrons will occupy each orbital singly with parallel spins before any pairing occurs. This maximizes the total spin multiplicity and leads to a more stable electronic state. **Example:** For a nitrogen atom (Z=7), the 2p subshell has three orbitals ($2p_x, 2p_y, 2p_z$). The three 2p electrons will occupy each of these orbitals one by one with parallel spins: $1s^22s^22p_x^12p_y^12p_z^1$. The configuration $1s^22s^22p_x^22p_y^12p_z^0$ is incorrect according to Hund's rule.",
    "marks": 3
  },
  {
    "type": "long",
    "text": "Model of an atom: State the drawbacks of Rutherford's Atomic model.",
    "answer": "The main drawbacks of Rutherford's atomic model were: **1. Instability of the atom:** According to classical electromagnetic theory, an accelerating electron should continuously emit radiation and lose energy. This would cause the electron to spiral into the nucleus, leading to the collapse of the atom. Rutherford's model could not explain the stability of the atom. **2. Inability to explain atomic spectra:** The model predicted a continuous emission spectrum, but experiments showed that atoms produce discrete line spectra. This suggested that electrons can only exist in specific energy levels, which was not accounted for by Rutherford's model.",
    "marks": 2
  },
  {
    "type": "long",
    "text": "State postulates of Bohr's Theory of hydrogen atom.",
    "answer": "<strong>1. Quantized Orbits:</strong> Electrons can only revolve around the nucleus in certain specific, non-radiating orbits called stationary orbits. Each orbit is associated with a fixed amount of energy. **2. Quantization of Energy:</strong> An electron in an orbit has a fixed energy. The electron does not radiate energy as long as it stays in a particular orbit. **3. Quantization of Angular Momentum:</strong> The angular momentum of an electron in a given orbit is quantized, meaning it is an integral multiple of $h/(2\\pi)$, where h is Planck's constant. **4. Electronic Transitions:</strong> An electron can jump from a lower energy orbit to a higher energy orbit by absorbing energy. Conversely, it can jump from a higher energy orbit to a lower one by emitting energy in the form of a photon.",
    "marks": 3
  },
  {
    "type": "long",
    "text": "Mention demerits of Bohr's Atomic model.",
    "answer": "The main demerits of Bohr's atomic model are: 1. It could only explain the spectra of single-electron species like hydrogen ($H$), $He^+$, and $Li^{2+}$, but failed to explain the spectra of multi-electron atoms. 2. It could not explain the fine structure of the spectral lines (the splitting of spectral lines into multiple lines under a powerful microscope). 3. It could not explain the Zeeman effect (the splitting of spectral lines in the presence of a magnetic field) or the Stark effect (splitting in an electric field). 4. It contradicted the Heisenberg uncertainty principle.",
    "marks": 3
  },
  {
    "type": "long",
    "text": "State the order of filling atomic orbitals following Aufbau principle.",
    "answer": "The **Aufbau principle** states that in the ground state of an atom or ion, electrons fill atomic orbitals of the lowest available energy levels before occupying higher energy levels. The order of filling is determined by the $(n+l)$ rule, which gives the following sequence: $1s, 2s, 2p, 3s, 3p, 4s, 3d, 4p, 5s, 4d, 5p, 6s, 4f, 5d, 6p, 7s, ...$.",
    "marks": 3
  },
  {
    "type": "long",
    "text": "Using concept of quantum numbers, calculate the maximum numbers of electrons present in the 'M' shell. Give their distribution in shells, subshells and orbitals.",
    "answer": "The 'M' shell corresponds to the principal quantum number **n = 3**.<br>The maximum number of electrons in a shell is given by the formula $2n^2$. For n=3, the maximum number of electrons is $2(3)^2 = 2 \\times 9 = 18$ electrons.<br>The distribution of these 18 electrons is as follows:<br>- For n=3, the azimuthal quantum number 'l' can be 0, 1, and 2. This corresponds to the 3s, 3p, and 3d subshells.<br>- The number of orbitals in a subshell is given by $2l+1$. The maximum number of electrons in a subshell is $2(2l+1)$.<br>- For the **3s subshell (l=0)**, there is 1 orbital, which can hold a maximum of 2 electrons.<br>- For the **3p subshell (l=1)**, there are 3 orbitals, which can hold a maximum of 6 electrons.<br>- For the **3d subshell (l=2)**, there are 5 orbitals, which can hold a maximum of 10 electrons.<br>Total electrons: 2 (from 3s) + 6 (from 3p) + 10 (from 3d) = 18 electrons.",
    "marks": 4
  },
  {
    "type": "long",
    "text": "Indicate the number of unpaired electrons in: a. Si (Z=14), b. Cr (Z=24)",
    "answer": "<strong>a. Silicon (Si) with Z=14:</strong><br>Electronic configuration: $1s^22s^22p^63s^23p^2$.<br>The electrons in the 3p subshell are distributed among the three 3p orbitals ($p_x, p_y, p_z$) according to Hund's rule. The two electrons will occupy separate orbitals with parallel spins. Thus, there are **2 unpaired electrons**.<br><strong>b. Chromium (Cr) with Z=24:</strong><br>Electronic configuration: $1s^22s^22p^63s^23p^64s^13d^5$.<br>This is an anomalous configuration for stability. The 4s orbital has 1 electron and the five 3d orbitals each have 1 electron. All these electrons have parallel spins. Thus, there are a total of **6 unpaired electrons**.",
    "marks": 3
  },
  {
    "type": "long",
    "text": "An atom of an element contains 29 electrons and 35 neutrons. Deduce- a. the number of protons, b. the electronic configuration of that element",
    "answer": "Given: Number of electrons = 29; Number of neutrons = 35.<br><strong>a. The number of protons:</strong> In a neutral atom, the number of protons is equal to the number of electrons. Therefore, the number of protons is **29**. This element is Copper (Cu).<br><strong>b. The electronic configuration of that element:</strong> The atomic number is 29. The electronic configuration is $1s^22s^22p^63s^23p^64s^13d^{10}$. This is an exception to the Aufbau principle, as the filled d-orbital ($3d^{10}$) and half-filled s-orbital ($4s^1$) provide greater stability than the configuration $4s^23d^9$.",
    "marks": 3
  }
]