[
  {
    "type": "mcq",
    "text": "The size of colloidal particles lies between-",
    "options": [
      "$10^{-10}$ m and $10^{-9}$ m",
      "$10^{-9}$ m and $10^{-6}$ m",
      "$10^{-6}$ m and $10^{-4}$ m",
      "$10^{-4}$ m and $10^{-2}$ m"
    ],
    "correct_answer": "B",
    "marks": 1
  },
  {
    "type": "mcq",
    "text": "Gum in water is an example of",
    "options": [
      "true solution",
      "suspension",
      "lyophilic sol",
      "lyophobic sol"
    ],
    "correct_answer": "C",
    "marks": 1
  },
  {
    "type": "mcq",
    "text": "In Haber process of production of ammonia $K_2O$ is used as",
    "options": [
      "catalyst",
      "inhibitor",
      "promotor",
      "adsorbate"
    ],
    "correct_answer": "C",
    "marks": 1
  },
  {
    "type": "mcq",
    "text": "Fruit Jam is an example of",
    "options": [
      "sol",
      "gel",
      "emulsion",
      "true solution"
    ],
    "correct_answer": "B",
    "marks": 1
  },
  {
    "type": "short",
    "text": "Name type of adsorption in which vander Waals forces are present.",
    "answer": "The type of adsorption in which van der Waals forces are present is **Physisorption** or **physical adsorption**.",
    "marks": 1
  },
  {
    "type": "short",
    "text": "Name type of adsorption in which compound is formed.",
    "answer": "The type of adsorption in which a compound is formed is **Chemisorption** or **chemical adsorption**.",
    "marks": 1
  },
  {
    "type": "short",
    "text": "Write an equation for Freundlich adsorption isotherm.",
    "answer": "The Freundlich adsorption isotherm is represented by the equation: **$\\frac{x}{m} = kP^{1/n}$** (for gases) or **$\\frac{x}{m} = kC^{1/n}$** (for solutions), where x is the mass of adsorbate, m is the mass of adsorbent, P is the pressure, C is the concentration, and k and n are constants.",
    "marks": 1
  },
  {
    "type": "short",
    "text": "Give four uses of adsorption.",
    "answer": "1. **Gas masks** use activated charcoal to adsorb poisonous gases. 2. **Sugar refining** uses animal charcoal to remove colors from sugar solutions. 3. **Catalysis** in industrial processes, such as the Haber process. 4. **Chromatographic analysis** for separating components of a mixture.",
    "marks": 2
  },
  {
    "type": "short",
    "text": "Why finely divided substance is more effective as adsorbent?",
    "answer": "A finely divided substance is a more effective adsorbent because it has a significantly larger **surface area per unit mass**. Adsorption is a surface phenomenon, and a larger surface area provides more sites for the adsorbate molecules to attach to, thus increasing the rate and extent of adsorption.",
    "marks": 2
  },
  {
    "type": "short",
    "text": "What is the adsorption isotherm?",
    "answer": "An **adsorption isotherm** is a graph or mathematical equation that describes the relationship between the amount of a substance adsorbed onto a surface and the pressure (for gases) or concentration (for solutions) of the substance at a constant temperature.",
    "marks": 1
  },
  {
    "type": "short",
    "text": "Aqueous solution of raw sugar, when passed over beds of animal charcoal, becomes colourless. Explain.",
    "answer": "Animal charcoal is a powerful **adsorbent**. When the raw sugar solution is passed over its surface, the colored impurities present in the solution are adsorbed onto the surface of the charcoal particles, leaving the sugar solution colorless. This is a practical application of adsorption.",
    "marks": 2
  },
  {
    "type": "short",
    "text": "What happens when a beam of light is passed through a colloidal sol?",
    "answer": "When a beam of light is passed through a colloidal sol, the path of the light becomes visible due to the scattering of light by the large colloidal particles. This phenomenon is known as the **Tyndall effect**.",
    "marks": 1
  },
  {
    "type": "short",
    "text": "Mention factors affecting adsorption of gas on solids.",
    "answer": "The factors affecting the adsorption of a gas on a solid include: 1. **Nature of the gas** (easily liquefiable gases are more readily adsorbed). 2. **Nature and surface area of the adsorbent**. 3. **Temperature** (physisorption decreases with temperature, chemisorption first increases then decreases). 4. **Pressure** of the gas.",
    "marks": 2
  },
  {
    "type": "short",
    "text": "Give Bredig's arc method.",
    "answer": "Bredig's arc method is an electrical dispersion method used to prepare colloidal sols of metals like gold, silver, and platinum. An electric arc is struck between two metal electrodes immersed in a dispersion medium (like water). The intense heat vaporizes some of the metal, and the vapor condenses to form colloidal particles. A stabilizer is often added to the medium to prevent coagulation.",
    "marks": 2
  },
  {
    "type": "short",
    "text": "Explain the term emulsions and types of emulsions.",
    "answer": "An **emulsion** is a colloidal system in which the dispersed phase and the dispersion medium are both liquids that are immiscible. There are two main types: **1. Oil-in-water (O/W) emulsions**, where oil is the dispersed phase and water is the dispersion medium (e.g., milk). **2. Water-in-oil (W/O) emulsions**, where water is the dispersed phase and oil is the dispersion medium (e.g., butter).",
    "marks": 2
  },
  {
    "type": "short",
    "text": "Distinguish between the following: a. Lyophilic and Lyophobic sols, b. Adsorption and absorption.",
    "answer": "<strong>a. Lyophilic and Lyophobic sols:</strong><br> - **Lyophilic sols** (solvent-loving) are stable, reversible, and easily prepared by mixing the dispersed phase and dispersion medium. The dispersed phase has a strong affinity for the medium.<br> - **Lyophobic sols** (solvent-hating) are unstable, irreversible, and require special methods for preparation. The dispersed phase has a weak affinity for the medium.<br><strong>b. Adsorption and Absorption:</strong><br> - **Adsorption** is a surface phenomenon where molecules of a substance (adsorbate) accumulate on the surface of another substance (adsorbent).<br> - **Absorption** is a bulk phenomenon where a substance is uniformly distributed throughout the bulk of another substance.",
    "marks": 3
  },
  {
    "type": "short",
    "text": "Explain how the adsorption of gas on solid varies with a. nature of adsorbate and adsorbent, b. surface area of adsorbent.",
    "answer": "a. **Nature of adsorbate and adsorbent:** Adsorption is more significant for gases that are easily liquefiable and have a stronger van der Waals force. Similarly, the nature of the adsorbent matters; porous and finely divided adsorbents (like charcoal) are more effective due to their high surface area.<br>b. **Surface area of adsorbent:** Adsorption is a surface phenomenon, so it is directly proportional to the surface area of the adsorbent. A larger surface area provides more active sites for the gas molecules to adhere to, leading to a higher extent of adsorption.",
    "marks": 2
  },
  {
    "type": "short",
    "text": "Explain two applications of adsorption.",
    "answer": "1. **In Gas Masks:** Gas masks contain activated charcoal, which adsorbs poisonous gases present in the air, allowing the wearer to breathe clean air. 2. **In Catalysis:** Many industrial chemical reactions, like the Haber process for ammonia synthesis, use solid catalysts that adsorb reactant molecules onto their surface, increasing the reaction rate.",
    "marks": 2
  },
  {
    "type": "short",
    "text": "Explain micelle formation in soap solution.",
    "answer": "When soap (e.g., sodium stearate, $C_{17}H_{35}COONa$) is dissolved in water above its critical micelle concentration (CMC), the hydrophobic 'hydrocarbon tail' of the soap anion moves away from the water, while the hydrophilic 'polar head' remains in contact with the water. The anions aggregate to form a spherical structure called a **micelle**, with the tails pointing inward and the heads forming the outer surface, thus stabilizing the structure in the aqueous solution.",
    "marks": 2
  },
  {
    "type": "long",
    "text": "Define the terms: a. Inhibition, b. Electrophoresis, c. Catalysis.",
    "answer": "a. **Inhibition:** A process in which the rate of a chemical reaction is decreased by the presence of a substance called an inhibitor. Inhibitors can block the active sites of a catalyst or prevent a reaction from occurring.<br>b. **Electrophoresis:** The movement of charged colloidal particles under the influence of an electric field. Positively charged particles move towards the cathode, and negatively charged particles move towards the anode. It is used to determine the charge on colloidal particles.<br>c. **Catalysis:** The process of increasing the rate of a chemical reaction by adding a substance called a catalyst, which is not consumed in the overall reaction.",
    "marks": 3
  },
  {
    "type": "long",
    "text": "Define Adsorption. Why students can read black board written by chalks?",
    "answer": "Adsorption is the phenomenon in which molecules of a substance accumulate on the surface of another substance. The chalk stick adsorbs the ink from the blackboard due to its porous nature. When a student reads the blackboard, it's a visual process. When chalk is used to write on the blackboard, it is the chalk dust that adheres to the surface of the board, not an adsorption process. The question seems to confuse writing with chalk on a blackboard and an adsorption phenomenon. A more accurate example of adsorption on a blackboard would be chalk dust sticking to the board's surface.",
    "marks": 2
  },
  {
    "type": "long",
    "text": "Write characteristics of adsorption.",
    "answer": "1. It is a **surface phenomenon**. 2. The process is usually **exothermic**, meaning it releases heat. 3. The extent of adsorption increases with an increase in the **surface area** of the adsorbent. 4. The process is usually **reversible**, especially in the case of physisorption. 5. It is dependent on the **temperature and pressure** of the system.",
    "marks": 3
  },
  {
    "type": "long",
    "text": "Identify dispersed phase and dispersion medium in the following colloidal dispersions: a. milk, b. blood, c. printing ink, d. fog.",
    "answer": "a. **Milk:** Dispersed phase is **liquid fat**, dispersion medium is **water**.<br>b. **Blood:** Dispersed phase is **proteins and cells**, dispersion medium is **plasma**.<br>c. **Printing ink:** Dispersed phase is **solid carbon**, dispersion medium is **oil**.<br>d. **Fog:** Dispersed phase is **liquid water**, dispersion medium is **gas (air)**.",
    "marks": 2
  },
  {
    "type": "long",
    "text": "Write notes on: a. Tyndall effect, b. Brownian motion, c. Types of emulsion, d. Hardy-Schulze rule.",
    "answer": "a. **Tyndall effect:** The scattering of light by colloidal particles when a beam of light passes through a colloidal sol. It is used to distinguish between true solutions and colloidal sols.<br>b. **Brownian motion:** The continuous, random zigzag movement of colloidal particles suspended in a medium. It is caused by the bombardment of the colloidal particles by the molecules of the dispersion medium and helps to prevent the particles from settling down.<br>c. **Types of emulsion:** Emulsions are colloidal systems of two immiscible liquids. They are of two types: oil in water (O/W), where oil is the dispersed phase (e.g., milk), and water in oil (W/O), where water is the dispersed phase (e.g., butter).<br>d. **Hardy-Schulze rule:** This rule states that the coagulating power of an electrolyte is directly proportional to the valency of the active ion (the ion carrying the opposite charge to the colloidal particles). For example, to coagulate a negatively charged sol, the order of coagulating power of cations is $Al^{3+} > Ba^{2+} > Na^+$.",
    "marks": 4
  },
  {
    "type": "long",
    "text": "Explain Electrophoresis in brief with the help of diagram. What are its applications?",
    "answer": "Electrophoresis is the movement of charged colloidal particles under the influence of an electric field. The colloidal particles, being charged, migrate towards the oppositely charged electrode. This can be visualized by placing a U-tube containing a colloidal sol with platinum electrodes immersed in it. When a potential difference is applied, the sol particles move to the respective electrodes, and the boundary of the sol becomes visible. **Applications:** It is used to determine the charge of a colloidal particle and for separating proteins and other large molecules.",
    "marks": 3
  },
  {
    "type": "long",
    "text": "Distinguish between Adsorption and absorption. Give one example.",
    "answer": "<strong>Adsorption</strong> is a surface phenomenon where molecules accumulate on the surface of a substance. It is a rapid process that slows down as the surface becomes saturated. **Example:** Water vapor adsorbing on the surface of silica gel. <strong>Absorption</strong> is a bulk phenomenon where molecules are uniformly distributed throughout the bulk of a substance. It occurs at a uniform rate. **Example:** Water vapor being absorbed by anhydrous calcium chloride.",
    "marks": 2
  },
  {
    "type": "long",
    "text": "Distinguish between Physisorption and chemisorption. Give one example.",
    "answer": "<strong>Physisorption</strong> (physical adsorption) is a weak, reversible process involving van der Waals forces between the adsorbate and adsorbent. It is a non-specific, multilayered process. **Example:** Nitrogen gas adsorbing on a solid surface at low temperature. <strong>Chemisorption</strong> (chemical adsorption) is a strong, irreversible process involving the formation of chemical bonds. It is highly specific and is a monolayered process. **Example:** Hydrogen gas adsorbing on a nickel surface, forming nickel hydride.",
    "marks": 2
  }
]