[
  {
    "type": "mcq",
    "text": "Which of the following compound has highest boiling point?",
    "options": [
      "n-pentane",
      "iso-butane",
      "butane",
      "neopentane"
    ],
    "correct_answer": "A",
    "marks": 1
  },
  {
    "type": "mcq",
    "text": "Acidic hydrogen is present in:",
    "options": [
      "acetylene",
      "ethylene",
      "dimethyl acetylene",
      "diethyl acetylene"
    ],
    "correct_answer": "A",
    "marks": 1
  },
  {
    "type": "mcq",
    "text": "Identify 'A' in the following reaction: $CH_3-C \\equiv CH-X \\rightarrow CH_3-C \\equiv C-CH_3$.",
    "options": [
      "$KMnO_4/H^+$",
      "alkaline $KMnO_4$",
      "dil. $H_2SO_4/1\\% HgSO_4$",
      "$NaOH/H_2O$"
    ],
    "correct_answer": "D",
    "marks": 1
  },
  {
    "type": "mcq",
    "text": "Major product of chlorination of ethyl benzene is:",
    "options": [
      "m-chlorethyl benzene",
      "p-chlorethyl benzene",
      "chlorobenzene",
      "o-chlorethylbenzene"
    ],
    "correct_answer": "D",
    "marks": 1
  },
  {
    "type": "mcq",
    "text": "1-chloropropane on treatment with alc. KOH produces:",
    "options": [
      "propane",
      "propene",
      "propyne",
      "propyl alcohol"
    ],
    "correct_answer": "B",
    "marks": 1
  },
  {
    "type": "short",
    "text": "Name the following: a. The type of hydrocarbon that is used as lubricant. b. Alkene used in the manufacture of polythene bags. c. The hydrocarbon said to possess carcinogenic property. d. What are the main natural sources of alkane?",
    "answer": "a. **Alkanes** or **long-chain hydrocarbons** are used as lubricants.<br>b. **Ethene ($C_2H_4$)** is the alkene used in the manufacture of polythene bags.<br>c. **Polycyclic aromatic hydrocarbons (PAHs)** possess carcinogenic properties.<br>d. The main natural sources of alkanes are **petroleum** and **natural gas**.",
    "marks": 2
  },
  {
    "type": "short",
    "text": "Name two reagents used for acylation of benzene.",
    "answer": "Two reagents used for the acylation of benzene (Friedel-Crafts acylation) are **acetyl chloride ($CH_3COCl$)** and **acetic anhydride ($CH_3COO)_2O$)** in the presence of an anhydrous aluminum chloride ($AlCl_3$) catalyst.",
    "marks": 1
  },
  {
    "type": "short",
    "text": "Read the following reaction and answer the questions given below: Benzene + $CH_3Cl$ with anhydrous $AlCl_3$ gives Toluene + HCl. a. Write the name of the reaction, b. Identify the electrophile in it, c. How is this electrophile generated?",
    "answer": "a. The name of the reaction is **Friedel-Crafts alkylation**.<br>b. The electrophile in this reaction is the **methyl carbocation ($CH_3^+$)**.<br>c. The electrophile is generated by the reaction between methyl chloride ($CH_3Cl$) and the Lewis acid catalyst, anhydrous aluminum chloride ($AlCl_3$). The $AlCl_3$ accepts the lone pair of electrons from the chlorine atom, forming the carbocation: **$CH_3-Cl + AlCl_3 \\rightarrow CH_3^+ + [AlCl_4]^-$**.",
    "marks": 3
  },
  {
    "type": "short",
    "text": "Identify giving reason whether the following compounds are aromatic or not. a. Cyclopentadiene, b. Cyclobutadiene, c. Benzene, d. Cycloheptatrienyl cation.",
    "answer": "A compound is aromatic if it is cyclic, planar, has a conjugated system of pi electrons, and obeys Hückel's rule (4n+2 pi electrons).<br>a. **Cyclopentadiene:** Not aromatic. It has a cyclic structure but is not fully conjugated due to the presence of a $sp^3$-hybridized carbon atom.<br>b. **Cyclobutadiene:** Not aromatic. It is cyclic and conjugated but has 4 pi electrons, which does not obey Hückel's rule. It is anti-aromatic.<br>c. **Benzene:** Aromatic. It is cyclic, planar, has a fully conjugated system, and has 6 pi electrons (4n+2 for n=1).<br>d. **Cycloheptatrienyl cation:** Aromatic. It is cyclic, planar, has a fully conjugated system, and has 6 pi electrons (4n+2 for n=1).",
    "marks": 4
  },
  {
    "type": "long",
    "text": "What is the action of following on but-2-ene? a. dil alkaline $KMnO_4$, b. acidic $KMnO_4$.",
    "answer": "a. **dilute alkaline $KMnO_4$ (Baeyer's reagent):** But-2-ene reacts with dilute alkaline $KMnO_4$ at room temperature to produce butan-2,3-diol. The purple color of the permanganate solution is discharged, which is a test for unsaturation. The reaction is: **$CH_3-CH=CH-CH_3 + H_2O + [O] \\xrightarrow{KMnO_4/OH^-} CH_3-CH(OH)-CH(OH)-CH_3$**.<br>b. **acidic $KMnO_4$:** But-2-ene reacts with hot, concentrated acidic $KMnO_4$ to undergo oxidative cleavage of the double bond. The products are two molecules of ethanoic acid. The reaction is: **$CH_3-CH=CH-CH_3 + [O] \\xrightarrow{KMnO_4/H^+} 2CH_3COOH$**.",
    "marks": 2
  },
  {
    "type": "long",
    "text": "Complete the following reaction sequence: $HC \\equiv CH \\xrightarrow{LiNH_2} A \\xrightarrow{CH_3CH_2Cl} B \\xrightarrow{HBr} C$.",
    "answer": "1. **$HC \\equiv CH \\xrightarrow{LiNH_2} A$**: Acetylene reacts with a strong base like sodamide (or lithium amide, $LiNH_2$) to form sodium acetylide. So, A is **$HC \\equiv CNa$** (or $HC \\equiv CLi$).<br>2. **$A \\xrightarrow{CH_3CH_2Cl} B$**: The acetylide ion in A acts as a nucleophile and reacts with ethyl chloride in a substitution reaction. So, B is **$HC \\equiv C-CH_2-CH_3$** (But-1-yne).<br>3. **$B \\xrightarrow{HBr} C$**: But-1-yne reacts with HBr in an addition reaction following Markovnikov's rule. The H atom adds to the carbon with more hydrogen atoms, and Br adds to the carbon with fewer hydrogen atoms. So, C is **$CH_3-CH_2-C(Br)=CH_2$** (2-bromobut-1-ene).",
    "marks": 3
  },
  {
    "type": "long",
    "text": "Comment on the acidic nature of B. ($HC \\equiv C-CH_2-CH_3$)",
    "answer": "The compound B is but-1-yne, which is a terminal alkyne. The carbon atom involved in the triple bond is sp hybridized, which is highly electronegative. As a result, the hydrogen atom attached to this carbon is acidic and can be easily removed by a strong base like sodamide.",
    "marks": 2
  },
  {
    "type": "long",
    "text": "Write the balanced chemical reactions to get benzene from a. Sodium benzoate, b. Phenol.",
    "answer": "a. **From Sodium benzoate:** Benzene can be prepared by the decarboxylation of sodium benzoate. This is done by heating sodium benzoate with sodalime (a mixture of NaOH and CaO). The reaction is: **$C_6H_5COONa + NaOH \\xrightarrow{CaO, \\Delta} C_6H_6 + Na_2CO_3$**.<br>b. **From Phenol:** Benzene can be prepared by the reduction of phenol. This is done by passing phenol vapors over heated zinc dust. The reaction is: **$C_6H_5OH + Zn \\xrightarrow{\\Delta} C_6H_6 + ZnO$**.",
    "marks": 2
  },
  {
    "type": "long",
    "text": "Predict the possible products of the following reaction: a. chlorination of nitrobenzene, b. sulfonation of chlorobenzene, c. bromination of phenol, d. nitration of toluene.",
    "answer": "a. **Chlorination of nitrobenzene:** The nitro group ($-NO_2$) is a strong deactivating and meta-directing group. The product will be **m-chloronitrobenzene**.<br>b. **Sulfonation of chlorobenzene:** The chloro group ($-Cl$) is a deactivating but ortho-para directing group. The products will be a mixture of **o-chlorobenzenesulfonic acid** and **p-chlorobenzenesulfonic acid**.<br>c. **Bromination of phenol:** The hydroxyl group ($-OH$) is a powerful activating and ortho-para directing group. The reaction will be very fast, and the product will be **2,4,6-tribromophenol**.<br>d. **Nitration of toluene:** The methyl group ($-CH_3$) is an activating and ortho-para directing group. The products will be a mixture of **o-nitrotoluene** and **p-nitrotoluene**.",
    "marks": 4
  },
  {
    "type": "long",
    "text": "Identify the main product of the reaction: a. $CH_3-CH_2-CH_3$ with $O_2$ and heat, b. $CH_3-CH(OH)-CH_3$ with $H_2SO_4$ and heat, c. $HC \\equiv C-CH_3$ with $H_2$ and Pd/C/quinoline, d. $H-C\\equiv C-H$ with $H_2O$ and $H_2SO_4$/$HgSO_4$.",
    "answer": "a. The main product of the complete combustion of propane ($CH_3-CH_2-CH_3$) is **carbon dioxide ($CO_2$) and water ($H_2O$)**.<br>b. The main product of the dehydration of propan-2-ol ($CH_3-CH(OH)-CH_3$) is **propene ($CH_3-CH=CH_2$)**.<br>c. The main product of the partial hydrogenation of propyne ($HC \\equiv C-CH_3$) is **propene ($CH_3-CH=CH_2$)**.<br>d. The main product of the hydration of acetylene ($HC \\equiv C-H$) is an enol intermediate that tautomerizes to **ethanal ($CH_3CHO$)**.",
    "marks": 4
  },
  {
    "type": "long",
    "text": "Read the following reaction and answer the questions given below: $CH_3-C(CH_3)=CH_2 + HBr \\xrightarrow{\\text{benzoyl peroxide}} CH_3-CH(CH_3)-CH_2Br$. a. Write IUPAC name of the product, b. State the rule that governs formation of this product.",
    "answer": "a. The IUPAC name of the product is **1-Bromo-2-methylpropane**.<br>b. The rule that governs the formation of this product is the **Anti-Markovnikov's rule** or the peroxide effect. In the presence of a peroxide, the H atom adds to the carbon with fewer hydrogen atoms, and the Br atom adds to the carbon with more hydrogen atoms.",
    "marks": 2
  },
  {
    "type": "long",
    "text": "Identify A, B, C in the following reaction sequence: $CH_2=CH_2 \\xrightarrow{Br_2/CCl_4} A \\xrightarrow{Zn} B \\xrightarrow{dil\\;alkaline\\;KMnO_4} C$.",
    "answer": "1. **$CH_2=CH_2 \\xrightarrow{Br_2/CCl_4} A$**: Ethene reacts with bromine in the presence of $CCl_4$ to form 1,2-dibromoethane. So, A is **$CH_2Br-CH_2Br$**.<br>2. **$A \\xrightarrow{Zn} B$**: 1,2-dibromoethane reacts with zinc metal to undergo dehalogenation, regenerating ethene. So, B is **$CH_2=CH_2$**.<br>3. **$B \\xrightarrow{dil\\;alkaline\\;KMnO_4} C$**: Ethene reacts with cold, dilute alkaline potassium permanganate (Baeyer's reagent) to form ethane-1,2-diol (ethylene glycol). So, C is **$CH_2OH-CH_2OH$**.",
    "marks": 3
  },
  {
    "type": "long",
    "text": "Arrange the three isomers of alkane with molecular formula $C_6H_{12}$ in increasing order of boiling points and write their IUPAC names.",
    "answer": "The molecular formula $C_6H_{12}$ corresponds to hexene isomers, not alkanes. Assuming the question is for a molecular formula of $C_5H_{12}$, the three isomers are n-pentane, isopentane (2-methylbutane), and neopentane (2,2-dimethylpropane). The boiling point decreases as the branching increases. The order of increasing boiling points is: **Neopentane < Isopentane < n-Pentane**. The IUPAC names are: **2,2-dimethylpropane**, **2-methylbutane**, and **n-pentane**.",
    "marks": 3
  },
  {
    "type": "long",
    "text": "Write IUPAC names of the products obtained by the reaction of cold concentrated sulphuric acid followed by water with the following compounds: a. propene, b. but-1-ene.",
    "answer": "a. **Propene** reacts with cold concentrated sulfuric acid to form propyl hydrogensulfate, which on hydrolysis with water gives propan-2-ol. The IUPAC name of the product is **Propan-2-ol**.<br>b. **But-1-ene** reacts with cold concentrated sulfuric acid to form butyl hydrogensulfate, which on hydrolysis with water gives butan-2-ol. The IUPAC name of the product is **Butan-2-ol**.",
    "marks": 2
  },
  {
    "type": "long",
    "text": "Write the balanced chemical reaction for preparation of ethane from a. Ethyl bromide, b. Ethyl magnesium iodide.",
    "answer": "a. **From Ethyl bromide:** Ethyl bromide can be reduced to ethane using a reducing agent like zinc and dilute hydrochloric acid. The reaction is: **$CH_3CH_2Br + Zn + H^+ \\rightarrow CH_3CH_3 + Zn^{2+} + Br^-$**.<br>b. **From Ethyl magnesium iodide:** Ethane can be prepared by treating a Grignard reagent, ethyl magnesium iodide, with water. The reaction is: **$CH_3CH_2MgI + H_2O \\rightarrow CH_3CH_3 + Mg(OH)I$**.",
    "marks": 2
  },
  {
    "type": "long",
    "text": "How many monochlorination products are possible for a. 2-methylpropane? b. 2-methylbutane? Draw their structures and write their IUPAC names.",
    "answer": "a. **2-methylpropane:** There are two types of non-equivalent hydrogen atoms in 2-methylpropane. Therefore, two monochlorination products are possible: **1-chloro-2-methylpropane** and **2-chloro-2-methylpropane**.<br>b. **2-methylbutane:** There are four types of non-equivalent hydrogen atoms in 2-methylbutane. Therefore, four monochlorination products are possible: **1-chloro-2-methylbutane**, **2-chloro-2-methylbutane**, **3-chloro-2-methylbutane**, and **1-chloro-3-methylbutane**.",
    "marks": 4
  },
  {
    "type": "long",
    "text": "Write all the possible products for pyrolysis of butane.",
    "answer": "Pyrolysis (cracking) of butane ($CH_3CH_2CH_2CH_3$) can produce a variety of products, including a mixture of smaller alkanes and alkenes: **ethane ($CH_3CH_3$), ethene ($CH_2=CH_2$), propane ($CH_3CH_2CH_3$), propene ($CH_3CH=CH_2$), and hydrogen gas ($H_2$)**.",
    "marks": 2
  },
  {
    "type": "long",
    "text": "Which of the following will exhibit geometrical isomerism? a. $CH_3-CH_2-C \\equiv C-CH_3$ b. $(CH_3)_2C=CH_2$ c. $CH_3-CH=C-CH_3$ d. $C_6H_5-CH=CH-CH_2Cl$",
    "answer": "Geometrical isomerism (cis-trans isomerism) is possible in compounds that have restricted rotation around a bond (like a double bond or a ring) and have two different groups attached to each of the atoms involved in the bond. <br>a. $CH_3-CH_2-C \\equiv C-CH_3$ has a triple bond, so no rotation. No geometrical isomerism.<br>b. $(CH_3)_2C=CH_2$ has two identical methyl groups attached to one carbon of the double bond. No geometrical isomerism.<br>c. $CH_3-CH=C-CH_3$ (But-2-ene) has different groups on both carbons of the double bond. It will exhibit geometrical isomerism. Both **cis-but-2-ene** and **trans-but-2-ene** are possible.<br>d. $C_6H_5-CH=CH-CH_2Cl$ also has different groups on both carbons of the double bond, so it will exhibit geometrical isomerism. Both **cis** and **trans** isomers are possible.",
    "marks": 2
  },
  {
    "type": "long",
    "text": "What is the action of following on ethyl iodide? a. alc. KOH, b. Zn, HCl.",
    "answer": "a. **alcoholic KOH:** Ethyl iodide ($CH_3CH_2I$) reacts with alcoholic KOH to undergo dehydrohalogenation, which is an elimination reaction. The product is **ethene ($CH_2=CH_2$)**.<br>b. **Zn, HCl:** Ethyl iodide reacts with zinc and dilute hydrochloric acid to undergo a reduction reaction. The product is **ethane ($CH_3CH_3$)**.",
    "marks": 2
  },
  {
    "type": "long",
    "text": "An alkane 'A' on ozonolysis gives 2 moles of ethanal. Write the structure and IUPAC name of 'A'.",
    "answer": "Ozonolysis of an alkene gives carbonyl compounds. If an alkene 'A' gives two moles of ethanal ($CH_3CHO$), the alkene must have been formed by joining the two ethanal molecules at their carbonyl carbons. The structure of 'A' is **but-2-ene ($CH_3-CH=CH-CH_3$)**. The IUPAC name of 'A' is **but-2-ene**.",
    "marks": 2
  },
  {
    "type": "long",
    "text": "Acetone and acetaldehyde are the ozonolysis products of an alkene. Write the structural formula of an alkene and give IUPAC name of it.",
    "answer": "The two ozonolysis products are acetone ($CH_3COCH_3$) and acetaldehyde ($CH_3CHO$). To find the alkene, we remove the oxygen atoms from the carbonyl groups and connect the two carbons with a double bond. The structural formula of the alkene is **$CH_3-C(CH_3)=CH-CH_3$**. The IUPAC name of this alkene is **2-methylbut-2-ene**.",
    "marks": 2
  },
  {
    "type": "long",
    "text": "Write the reaction to convert a. propene to n-propyl alcohol.",
    "answer": "To convert propene to n-propyl alcohol, an anti-Markovnikov hydration must be performed. This is achieved by hydroboration-oxidation. The reaction is: **$CH_3-CH=CH_2 \\xrightarrow{1. BH_3, THF \\text{ (hydroboration)} \\\\ 2. H_2O_2, NaOH \\text{ (oxidation)}} CH_3-CH_2-CH_2OH$**.",
    "marks": 2
  }
]