[
  {
    "type": "mcq",
    "text": "The ability of a person to establish good relationships with other people is called _______.",
    "options": [
      "physical health",
      "mental health",
      "social health",
      "emotional health"
    ],
    "correct_answer": "C",
    "answer": "<b>Explanation:</b> Social health is defined as the ability to form satisfying interpersonal relationships with others. It also relates to the ability to adapt comfortably to different social situations. The correct option is <b>C</b>.",
    "marks": 1
  },
  {
    "type": "mcq",
    "text": "Laughter club is a remedy to drive away _______.",
    "options": [
      "addiction",
      "stress",
      "infectious diseases",
      "poverty"
    ],
    "correct_answer": "B",
    "answer": "<b>Explanation:</b> Laughter is a well-known stress reliever. Laughter clubs provide an environment for people to laugh together, which helps in reducing stress and improving mental well-being. The correct option is <b>B</b>.",
    "marks": 1
  },
  {
    "type": "mcq",
    "text": "Alcohol consumption mainly affects the _______ system.",
    "options": [
      "nervous",
      "excretory",
      "respiratory",
      "digestive"
    ],
    "correct_answer": "A",
    "answer": "<b>Explanation:</b> Alcohol is a depressant that primarily affects the central nervous system. It slows down brain function, impairs coordination, judgment, and reaction time. The correct option is <b>A</b>.",
    "marks": 1
  },
  {
    "type": "mcq",
    "text": "The continuous and unnecessary use of the internet and mobile phones can lead to a condition called _______.",
    "options": [
      "selfie-cide",
      "cybercrime",
      "addiction",
      "social anxiety"
    ],
    "correct_answer": "C",
    "answer": "<b>Explanation:</b> Excessive use of mobile phones and the internet can become a behavioral addiction, similar to other addictions, leading to problems like isolation, loneliness, and decreased productivity. The correct option is <b>C</b>.",
    "marks": 1
  },
  {
    "type": "mcq",
    "text": "Which of the following is NOT a factor that disturbs social health?",
    "options": [
      "Education",
      "Addiction",
      "Mental stress",
      "Financial status"
    ],
    "correct_answer": "A",
    "answer": "<b>Explanation:</b> Education is a factor that generally enhances social health by providing opportunities and improving a person's ability to interact with society. The other options can negatively impact social health. The correct option is <b>A</b>.",
    "marks": 1
  },
  {
    "type": "mcq",
    "text": "_______ is a poisonous substance present in tobacco.",
    "options": [
      "Caffeine",
      "Nicotine",
      "Cocaine",
      "Morphine"
    ],
    "correct_answer": "B",
    "answer": "<b>Explanation:</b> Tobacco contains nicotine, a highly addictive psychoactive drug that affects the central nervous system and can cause various health problems, including cancer. The correct option is <b>B</b>.",
    "marks": 1
  },
  {
    "type": "mcq",
    "text": "Which of the following is an example of a cybercrime?",
    "options": [
      "Donating to online charities",
      "Online shopping",
      "Hacking bank accounts",
      "Watching movies online"
    ],
    "correct_answer": "C",
    "answer": "<b>Explanation:</b> Cybercrime refers to criminal activities carried out using computers and the internet. Hacking into someone's bank account to steal money is a serious cybercrime. The correct option is <b>C</b>.",
    "marks": 1
  },
  {
    "type": "mcq",
    "text": "The 'Salaam Mumbai Foundation' is an organization that works for _______.",
    "options": [
      "educating children in slums",
      "environmental conservation",
      "disaster management",
      "women's empowerment"
    ],
    "correct_answer": "A",
    "answer": "<b>Explanation:</b> The Salaam Mumbai Foundation is an NGO that works in the field of education, sports, arts, and health for children living in slums, empowering them to have a better future and stay away from addictions like tobacco. The correct option is <b>A</b>.",
    "marks": 1
  },
  {
    "type": "short",
    "text": "What is social health?",
    "answer": "Social health is the ability of a person to establish good, positive, and satisfying relationships with other people and to adapt to different social situations.",
    "marks": 1
  },
  {
    "type": "short",
    "text": "Define 'addiction'.",
    "answer": "Addiction is a state of compulsive engagement in rewarding stimuli despite adverse consequences. It can be a physical and/or psychological dependency on substances like tobacco and alcohol, or on activities like using a mobile phone.",
    "marks": 1
  },
  {
    "type": "short",
    "text": "What is a 'cybercrime'?",
    "answer": "Cybercrime is any illegal activity that involves a computer, a network device, or a network. Examples include online financial fraud, hacking, and spreading malware.",
    "marks": 1
  },
  {
    "type": "short",
    "text": "Find the odd one out: Hobbies, Addiction, Peer group, Education.",
    "answer": "<b>Addiction.</b><br><b>Reason:</b> Hobbies, having a good peer group, and education are factors that positively influence social health. Addiction is a factor that endangers social health.",
    "marks": 1
  },
  {
    "type": "short",
    "text": "Find the odd one out: Tobacco, Alcohol, Drugs, Laughter Club.",
    "answer": "<b>Laughter Club.</b><br><b>Reason:</b> Tobacco, alcohol, and drugs are addictive substances harmful to health. A Laughter Club is a positive activity for stress management.",
    "marks": 1
  },
  {
    "type": "short",
    "text": "Complete the analogy: Physical Health : Exercise :: Mental Health : _______.",
    "answer": "<b>Stress management / Hobbies.</b>",
    "marks": 1
  },
  {
    "type": "short",
    "text": "Complete the analogy: Tobacco : Carcinogenic :: Alcohol : _______.",
    "answer": "<b>Affects nervous system / liver.</b>",
    "marks": 1
  },
  {
    "type": "short",
    "text": "What are the two main aspects of social health?",
    "answer": "The two main aspects of social health are:<br>1. The ability to form healthy and rewarding interpersonal relationships with family, friends, and colleagues.<br>2. The ability to adapt and act appropriately in a variety of social situations.",
    "marks": 2
  },
  {
    "type": "short",
    "text": "List any four factors that help in maintaining good social health.",
    "answer": "Four factors that help maintain good social health are:<br>1. Having a large number of friends and relatives.<br>2. Strong personality and self-confidence.<br>3. Cultivating hobbies like music, drawing, or sports.<br>4. Good financial status and satisfying job.",
    "marks": 2
  },
  {
    "type": "short",
    "text": "What are the harmful effects of tobacco consumption?",
    "answer": "The harmful effects of tobacco consumption are:<br>1. It contains nicotine, which is highly addictive and affects the central nervous system.<br>2. Tobacco smoke contains carcinogenic compounds that can cause cancer of the mouth, throat, and lungs.<br>3. It can lead to coughing, shortness of breath, and other respiratory diseases.",
    "marks": 2
  },
  {
    "type": "short",
    "text": "What are the negative effects of excessive mobile phone usage?",
    "answer": "Excessive mobile phone usage can lead to:<br>1. Problems like tiredness, headaches, insomnia, and joint pains.<br>2. The radiation from cell phones can be harmful, especially for children.<br>3. It can lead to addiction, isolation, reduced in-person social interaction, and lack of focus on other important activities.",
    "marks": 2
  },
  {
    "type": "short",
    "text": "What is stress? What causes it?",
    "answer": "Stress is the body's reaction to any change that requires an adjustment or response. It is a feeling of emotional or physical tension.<br>It can be caused by various factors, including increased competition in education and work, loneliness, nuclear families, peer pressure, and addiction.",
    "marks": 2
  },
  {
    "type": "short",
    "text": "What is the importance of having a good peer group?",
    "answer": "A good peer group has a strong positive influence on an individual's social health. Good friends provide support, encouragement, and companionship. They help in developing a strong personality, building self-confidence, and helping to avoid bad habits and addiction.",
    "marks": 2
  },
  {
    "type": "short",
    "text": "How can hobbies help in improving social health?",
    "answer": "Hobbies help us to utilize our free time effectively. They can be a great way to relieve stress and divert our energy and mind towards positive things. Engaging in hobbies like sports, music, or art can also help us connect with like-minded people, thus improving our social circle.",
    "marks": 2
  },
   {
    "type": "short",
    "text": "What is 'selfie-cide'? Why is it a concern?",
    "answer": "Selfie-cide refers to the act of dying or getting seriously injured while taking a selfie in a dangerous location or situation.<br>It is a concern because it reflects a growing obsession and addiction to social media validation, where individuals risk their lives for the sake of getting a dramatic picture, indicating poor judgment and mental stress.",
    "marks": 2
  },
  {
    "type": "short",
    "text": "What role does the IT Act of 2000 play?",
    "answer": "The Information Technology (IT) Act of 2000 is India's primary law dealing with cybercrime and electronic commerce. It provides a legal framework for electronic transactions and aims to control cybercrime activities by defining various offenses and prescribing punishments for them. A cybercrime cell works under this act.",
    "marks": 2
  },
  {
    "type": "long",
    "text": "Which factors endanger social health? Explain any two.",
    "answer": "Several factors can endanger social health. Some of them are mental stress, addiction, incurable diseases, and peer pressure.<br><br>1. <b>Mental Stress:</b> In today's competitive world, stress has become common due to increased competition in education, employment, and business. Factors like nuclear families, loneliness, and lack of communication can worsen stress. Chronic stress can lead to anxiety, depression, and social withdrawal, thereby harming social health.<br><br>2. <b>Addiction:</b> Addiction to substances like tobacco, alcohol, and drugs has severe negative consequences. These substances can damage physical health (e.g., cancer, liver damage) and mental health (impaired brain function). Addiction often leads to social isolation, financial problems, and criminal behavior, completely destroying an individual's social life.",
    "marks": 3
  },
  {
    "type": "long",
    "text": "What are the ways to manage stress?",
    "answer": "Stress can be managed in several positive ways:<br>1. <b>Developing Hobbies:</b> Engaging in hobbies like music, reading, sports, or art helps to divert energy and mind towards positive activities.<br>2. <b>Communication:</b> Talking and sharing feelings with close friends, family members, teachers, or counselors can help to relieve stress.<br>3. <b>Physical Exercise:</b> Regular exercise, yoga, meditation, and deep breathing are effective techniques for reducing stress.<br>4. <b>Laughter:</b> Laughing is a great stress buster. Joining a laughter club can be very beneficial.<br>5. <b>Time Management:</b> Planning daily routines and managing time effectively can reduce the pressure of tasks.",
    "marks": 3
  },
  {
    "type": "long",
    "text": "Explain the role of 'Unified Movement against Tobacco'.",
    "answer": "The 'Unified Movement against Tobacco' is a campaign started by 45 different well-known organizations like the World Health Organization (WHO), Tata Trust, etc. <br><b>The main objectives of this movement are:</b><br>1. To control the consumption of tobacco and provide guidance to activists who work against tobacco.<br>2. To protect the rights of non-smokers by campaigning for smoke-free public spaces.<br>3. To raise awareness about the health hazards of tobacco use among the public, especially the youth.<br>4. To advocate for stronger laws and policies related to tobacco control.",
    "marks": 3
  },
  {
    "type": "long",
    "text": "How can modern technology be a cause of social health problems?",
    "answer": "While modern technology has many benefits, its excessive and imprudent use can lead to social health problems:<br>1. <b>Addiction and Isolation:</b> Continuous use of mobile phones and the internet can become an addiction, leading people to spend more time in the virtual world than interacting with family and friends in person. This causes social isolation and loneliness.<br>2. <b>Cybercrime:</b> Technology has given rise to new crimes like financial fraud, identity theft, and online harassment (cyberbullying), which can cause immense financial and mental distress.<br>3. <b>Spread of Misinformation:</b> Platforms like social media can be used to spread fake news and inappropriate content, which can create social unrest and negative thinking.<br>4. <b>Distraction and Stress:</b> Constant notifications and the pressure to be always 'online' can be a source of distraction and stress, affecting both mental peace and real-world responsibilities.",
    "marks": 3
  },
  {
    "type": "long",
    "text": "What are the objectives of disaster management?",
    "answer": "The objectives of disaster management are:<br>1. <b>Minimization of Loss:</b> To minimize the loss of life and property during a disaster.<br>2. <b>Preparedness:</b> To prepare the community to face disasters by creating awareness, conducting mock drills, and developing early warning systems.<br>3. <b>Rapid Response:</b> To provide quick and effective rescue and relief operations to the affected people, including medical aid, food, and shelter.<br>4. <b>Rehabilitation:</b> To help the affected community to return to normalcy by reconstructing infrastructure and providing support for psychological and economic recovery.<br>5. <b>Mitigation:</b> To take measures that can reduce the impact of future disasters.",
    "marks": 4
  },
  {
    "type": "long",
    "text": "Explain the importance of social health.",
    "answer": "Social health is a vital component of a person's overall health and well-being. Its importance can be understood from the following points:<br>1. <b>Mental and Emotional Well-being:</b> Having strong social connections and a good support system of friends and family helps in managing stress, reducing feelings of loneliness, and provides emotional support during difficult times.<br>2. <b>Sense of Belonging:</b> Being part of a community or group gives a person a sense of belonging and purpose, which is crucial for self-esteem and confidence.<br>3. <b>Better Physical Health:</b> Studies have shown that people with good social health tend to have better physical health and a longer life expectancy. Social interaction is linked to a stronger immune system.<br>4. <b>Personal Growth:</b> Interacting with diverse people helps in developing communication skills, empathy, and a broader perspective on life, contributing to personal growth.",
    "marks": 4
  },
  {
    "type": "long",
    "text": "What measures would you suggest to de-addict a person from alcohol or tobacco?",
    "answer": "De-addiction is a challenging process that requires a combination of professional help and strong personal and social support.<br>1. <b>Professional Counseling:</b> The first step is to seek help from a professional counselor or a psychiatrist. They can provide psychological support and help the person understand the root cause of their addiction.<br>2. <b>De-addiction Centers:</b> Enrolling the person in a reputed de-addiction or rehabilitation center is very effective. These centers provide a controlled environment, medical supervision, and structured therapy programs.<br>3. <b>Family and Peer Support:</b> The support of family and friends is crucial. They should be patient, understanding, and encouraging, rather than judgmental. Involving them in counseling sessions can also be helpful.<br>4. <b>Developing Hobbies:</b> The person should be encouraged to engage in new hobbies and recreational activities to divert their mind and energy towards positive things. This helps in preventing a relapse.",
    "marks": 4
  },
  {
    "type": "long",
    "text": "What are the effects of peer group pressure? How can one cope with it?",
    "answer": "Peer group pressure is the influence that a peer group exerts on an individual to change their attitudes, values, or behaviors to conform to group norms.<br><br><b>Effects:</b><br>It can be both positive and negative. <br><b>Positive:</b> A good peer group can motivate a person to study hard, participate in sports, and develop good habits.<br><b>Negative:</b> A negative peer group can pressure a person into habits like smoking, drinking, drug abuse, and other risky behaviors.<br><br><b>How to Cope:</b><br>1. <b>Be Assertive:</b> It is important to be firm and learn to say 'No' to things that you know are wrong, without being aggressive.<br>2. <b>Choose Friends Wisely:</b> Spend time with friends who have good habits and respect your decisions.<br>3. <b>Build Self-Confidence:</b> Having strong self-esteem and being confident in your own values makes you less susceptible to negative pressure.<br>4. <b>Seek Help:</b> If the pressure is too much to handle, one should talk to parents, teachers, or a trusted adult.",
    "marks": 4
  }
]

